/**
 * 山西-晋城市-特产美食
 * 泽州馔面、沁水饸饹、阳城杂割、陵川面羊、阳城肉罐肉、
 * 晋城十大碗
炒凉粉儿、蒸槐花
清汤饸饹
大米过油肉
烫面饺
毛头丸
素氽汤
巴公烧大葱
阳城烧肝
高平烧豆腐
陵川党参炖土鸡
王府八八筵
阳城烧肝
晋城烧大葱
卷白馍
烧三鲜
白起肉

 * 
 * 
 * 
 * 
 * 

晋城十大碗
是晋城地区特色综合菜系，具有悠久的历史和传说。十大碗的十大菜系主要有木耳圪贝、烧大葱、毛头丸、过油肉、小酥肉、 糊卜肉、糖醋溜丸、油圪麻、天鹅蛋、甜饭等。其以凉菜、热菜、汤菜、主食为系统体系，按照“十大碗”、“六六”、“八六”、“八八”为区分标准，是本地区婚丧嫁娶、宴请宾朋的特色饮食。 [56]
炒凉粉儿
是晋城市一道民间传统风味小吃，至今已有100多年的历史。先将凉粉切成长宽各3—4厘米、厚约1厘米的方块，放置待用。锅内放少量食油，烧热后将切好的凉粉块入锅翻炒。再将醋汁蒜沫浇 入，加盖，待蒜、醋味入里后出锅。
蒸槐花
蒸槐花是一道晋城小吃。蒸菜可用的原料很多，春季一般用野菜，如荠菜、面条菜、白蒿等来蒸，夏季多用荆芥、茼蒿、茄子，秋冬季节则用土豆、萝卜、胡萝卜、莲藕等来蒸，将蔬菜择洗干净，块茎类的经过切细丝，拌上面粉（或玉米面、小米面），上屉蒸熟，用调料拌匀直接食用，或者蒸熟后炒食，亦菜亦饭、方便快捷、别具风味。 [57]
清汤饸饹
是最具晋城特色的一种小吃，做法简单又极具特色。清汤饸饹的配菜需要胡萝卜、豆角、豆芽、粉条，也可以加豆腐，加土豆等等。胡萝卜和豆角洗干净切成丝，过水粉条在水里泡好，放少许盐和味精，用手搅拌均匀，混合好的菜离很远就能闻到扑鼻的香味。 [58]
大米过油肉
是山西晋城一带的特色小吃，制作原料有猪瘦肉、蒜薹、西红柿等。晋城大米过油肉的特点是多汤水，具有浓厚的晋城地方特色。
烫面饺
晋城传统风味小吃，此品种由北宋时期的“角子”演变改制而来。以七分烫面三分死面和面制皮，韭黄、鲜肉作馅，形似月牙，背面有褶如百叶裙，汤满肉鲜，面皮筋光香甜。 [59]
毛头丸
毛头丸子是阳城的独特佳肴，其主材是萝卜。丸子表面毛茬茬的，如同黄毛丫头的头发，因此得名。 [60]
素氽汤
是晋城特色风味小吃。起源于清朝的泽州府（今晋城），素氽汤不同于其它地方氽汤，别具风味，成为晋城人喜庆宴席必备的汤肴。 [61]
巴公烧大葱
用瘦猪肉丝或羊肉及大葱加佐料烧制。制作时先将巴公大葱葱白切段8--10厘米，用开水煮熟，油炸，再过水，捞出去水备用，在碗中放入少量虾皮，把烧好的葱段放入碗底，中间放入炒好的肉丝，撒少量白糖，蒸后扣到盘中，浇上少量烧葱原汁即可食用。 [62]
阳城烧肝
晋城的地方名吃。以鲜猪肝加佐料，用花油包卷，经煎、蒸、炸等工序达焦黄酥软即成。其特点是外焦里脆，味美适口，佐酒佳肴，热食不腻。 [63]
高平烧豆腐
据说公元前260年长平之战后，秦军将领白起坑杀赵军降卒40万人，激起了高平人的憎恨，便把豆腐比作“白起肉”，火烧水煮而食之。不料，人们食后颇觉新鲜，别具一番风味。于是烧豆腐便在高平境内流传下来。 [64]
陵川党参炖土鸡
是陵川风味美食，厨师们用党参与土鸡搭配，炖制出美味、滋补的地方美食，陵川炖土鸡。 [64]
王府八八筵
王府八八筵流传于阳城东乡，因其主菜贯穿周易太极“八卦生万物”和“好事成双”理念，且主菜为十六道而得名。其历史悠久，风味独特，是名扬天下的一种古老名宴。
阳城烧肝
阳城烧肝，是山西省晋城市阳城县地方名吃。以鲜猪肝加佐料，用花油包卷，经煎、蒸、炸等工序达焦黄酥软即成。其特点是外焦里脆，味美适口，佐酒佳肴，热食不腻。
炒凉粉
炒凉粉（Fried jelly），是河南省开封市的一道传统小吃，属于豫菜系，该菜品色泽透明，晶莹剔透，嫩滑爽口。有诗称赞：“冰镇刮条漏鱼穿，晶莹沁齿有余寒。味调浓淡随君意，只管凉来不管酸。” 凉粉种类繁多，用豆类、米类或山芋的淀粉等，加适量水稀释成糊，煮熟后冷凝成块，俗称“凉粉’。如豌豆粉、绿豆粉、山芋粉等，爽口清香味浓。
晋城烧大葱
晋城烧大葱是以大葱、荔枝为主料制作的食品。
卷白馍
卷白馍是山西晋城市有名的风味小吃，每年的农历二月初二，家家必吃卷白膜。
烧三鲜
烧三鲜这道菜菜品丰富，选材广泛，既可以用鱿鱼、海参、鱼肚等做成海鲜式三鲜，也可以用猪皮、烧肉、丸子等做成家常味三鲜。既可以做成烧菜也可以做成烩菜，既可以端上大宴，也可以放到流水席。味道适口，口感丰富，很符合广大“观众”的口味。
白起肉
白起肉又称烧豆腐、高平烧豆腐。是山西省晋城高平市特有的传统小吃，已有两千多年的历史。据说高平地区的谷口村（也叫杀谷），有一种烘烤的豆腐，叫做“白起肉”。皆因白起心地过于残忍，长平之战更是惨绝人寰。击败了纸上谈兵的赵括后，四十万赵军悉数向秦军投降，一日之内，白起竟坑杀殆尽。 当地百姓世代憎恨白起，为了祭奠被饿降遭坑杀的亡灵，就用菽饭作供菜，把豆腐当成肉，用炉火烧烤，用豆腐渣和蒜泥生姜调和成“蘸头”，表示把白起的脑浆捣成泥，与豆腐一起食用，曰“白起肉”。可见其仇之深、其恨之深。后来这白起肉就逐渐流传开来，成为烧豆腐，因此高平的烧豆腐最为著名。
高平十大碗
高平十大碗是一道地方名肴，属于晋菜系。高平十大碗是指高平当地的一种传统宴席，共十碗，依次为：水白肉、核桃肉、小酥肉、天和蛋、软米饭、扁豆汤、红烧肉、丸子汤、粉皮芥末汤、肠子汤。素有“碗汤

 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const jinchengFoodsList = [
  // 灯影牛肉
  {
    province: '山西省', // 省
    city: '晋城市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jinCuisine', // 菜系编码
    cuisineCategoryName: '晋菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '山西省', // 省
    city: '晋城市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jinCuisine', // 菜系编码
    cuisineCategoryName: '晋菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
