/**
 * 山西-忻州市-特产美食
 * 
 * 
 * 定襄蒸肉,莜面窝窝,保德碗托,砍三刀,神池月饼,原平锅魁,河曲酸捞饭,高粱面鱼鱼,莜面栲栳栳,代州面麻片,崞阳麻叶,忻州瓦酥,


 * 
 * 
 * 
 * 
定襄蒸肉
山西定襄塞北的一种汉族名吃，相传为当地进贡宫廷之贡品，也是当地民间宴席必备佳肴之一。食材主要以精瘦猪肉为主，辅以淀粉、植物油及各种调味品制成。具有肉香扑鼻，多食不腻等特点。 [43]
莜面窝窝
山西十大面食之一。其中忻州的做法最典型：将莜面加一倍开水或冷水和制，用手掌在光滑的板面上推一个，食指卷一个，做成如“猫耳朵”似的筒状形，长寸许、薄如叶、色淡黄。 [44]
保德碗托
是山西省忻州保德县的一种汉族传统小吃。风味独特，为小吃之上品。碗托，顾名思义是将荞麦面制成的糊放入碗中，上笼蒸熟晾凉后，拔出一个和碗形状相似的“托”来。地道的保德“碗托”用的荞麦面，是把粗的、黑的筛去，留下白的、细的，称为“上荞面”。保德县盛产荞麦，所制荞面碗托，观之晶莹光亮，粉白微青，质地精细，柔软，光滑，细嫩，清香利口。
砍三刀
又名油食儿、油布袋，色呈金黄，绵甜利口，是流传于山西太行山区的河北平山、井陉及山西五台山一带人春节期间的汉族面食小吃之一。因炸制时，为使麻油渗入其中，要在上面砍三刀，故称“砍三刀”，又因其吃起来油香四溢，故又称“油布袋”。每年年关，家家制作，户户蒸食，代代相传，已有300多年的历史。在漫长的封建社会里，五台劳动人民生活贫困，常年以玉米为主食。为了改变这种单调乏味的饮食，五台人便创制了一种粗粮细作的食品。 [45]
神池月饼
神池县的特产，以香鲜酥甜闻名忻州乃至整个山西。神池月饼被认定为“山西名小吃”、“山西名点”，以其“皮酥馅香、口味浓郁、松软不腻、久存不变”的特色赢得了晋陕蒙一带民众的喜爱。神池月饼以白面、胡油、食糖为主要原料，拌以玫瑰、青红丝、核桃仁、花生米、葡萄干、芝麻等辅料加工而成。具有甜而不腻、酥而不散，久放不馊之特点，每到中秋时节远销忻州市各县及太原、大同、朔州、北京等地。神池也被誉为“月饼之乡”。 [46]
原平锅魁
山西省一种烤制的汉族传统名点，面饼呈黄色，具有香、甜、酥、脆的特点。根据包馅与不包馅可以分成空心锅魁和实心锅魁两种。其状若块，约三寸长，寸许宽，卷边滚圆。不包馅的称空心锅魁，包馅的另有名称。应市的多是甜馅锅魁，最上乘的是玫澄锅魁。锅魁饼面橙黄色，具有香、甜、酥、脆的特点，加之包馅的不同、又各具风味，久食不厌。原平锅魁特点是嘴嚼利口不沾牙，存放色味不变，始终酥脆如初。 [47-48]
河曲酸捞饭
河曲人发现泡酸了的糜米饭有清热解渴的功用，于是用心制成酸汤将米放入，在15℃以上浸泡4至8小时后澄出糜米即可做成酸粥，河曲人将这种粥称之为酸稀粥。在酸汤中煮至八成熟捞出后上笼蒸熟的米饭，称为酸捞饭或“糜糜饭”。久而久之，河曲人家家户户锅台上都有了一只“酸米罐”，里面泡着糜米，利用锅台的温度任其发酵，随吃随捞。河曲人做酸粥时还经常加入土豆、红薯块，酸捞饭一般配大烩菜食用。酸米汤不仅是解渴生津的好饮料，还可以解酒。 [49-50]
高粱面鱼鱼
在晋北的忻州、定襄、五台、原平、代县一带是家常饭。主妇们将和好的面挤成枣样大小的剂子，两手同时从大案两头搓起，成细若香头的小鱼，蒸好浇上汤菜食之。若是时间紧，来不及搓鱼，便捏成很薄的红面壳壳。要么掰成块加菜拌食、要么切条，用鸡蛋、酸菜炒食，同样令人垂涎。过去村里孩子玩饿了，取一个红面壳壳，在里边倒一点盐醋，滴一点食油，从边上掰一块蘸点盐醋吃，吃到最后，盐醋、壳壳来个一口香，老百姓叫“油盐蘸窝窝”。 [51-52]
莜面栲栳栳
“莜面栲栳栳”（栲栳kǎolǎo）是山西高寒地区尤其是忻州地区的一种面食小吃。栲栳是指用柳条编成，形状像斗的容器。也叫“笆斗”。“栲栳栳”是用莜面精工细作的一种面食品，因其形状象“笆斗”，民间叫“栳栳”。是用竹篾或柳条编制成的一种上下粗细一致的圆框，形状象斗，是农家专门用来打水或装东西的一种用具，因“栲栳栳”形如“笆斗”故得名。
代州面麻片
历史悠久，以片薄、质脆、香甜可口著称，已有近百年历史。代州城有名的商号“聚星瑞”、“兴盛斋”、“富成斋”、“天兴昌”、“巨盛斋”、“福盛魁”等，主营面麻片，并向州外推销，享誉山西。据说，清朝末年，一位在江苏做官的代州人特别喜欢吃江苏的麻片。告老还乡时，便带了一名专做麻片的厨师回乡，在家做麻片，供自己食用。后来这位厨师将其技艺传给了代州人，经代州人的改进，制成了独具特色的代州麻片。 [53]
崞阳麻叶
制作复杂，选用精制面粉、发酵粉和糖剂，辅助油、盐、碱、矾等，加水按一定比例配制搅拌成松软面团，用刀雎切成约半两重的小面块，拉长两根扭两圈，圆圆的，粗细不等，放入油锅中炸到金黄色捞出即可食用。油料一般选用晋西北的胡麻油。 [42]
忻州瓦酥
形状似瓦，故名"瓦酥"。瓦酥制作历史悠久，始于明末清初。在清朝时，慈禧太后品尝后，龙颜大开，赐名为"龙凤瓦酥"。瓦酥以其质酥脆，味香郁，堪称炉食中一绝。鲜食酥沙，松软；干食酥脆、甘香；常食健胃壮身。曾被山西省商业系统评为最佳食品，声誉远达太原、大同、河北、内蒙古等地。1981年被列为山西省名特产品。
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const xinzhouFoodsList = [
  // 灯影牛肉
  {
    province: '山西省', // 省
    city: '忻州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jinCuisine', // 菜系编码
    cuisineCategoryName: '晋菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '山西省', // 省
    city: '忻州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jinCuisine', // 菜系编码
    cuisineCategoryName: '晋菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
