/**
 * 广东省-佛山市-特产美食
佛山扎蹄、佛山公芝麻饼、大良野鸡卷、大良磞砂、大良姜汁撞奶、炸牛奶、双皮奶、小凤饼、南海鱼生、大福饼、九江煎堆、三水狗仔鸭、水晶饺、甘笋蒸饼、西樵大饼、佛山九层糕、石湾鱼脯、佛山柱侯酱、蚕蛹、白糖棉花糕、应记云吞面、金源酒家甘笋蒸饼、汾宁白糖棉花糕、大可以状元及第粥、盲公饼、高明濑粉
 佛山盲公饼、大良蹦砂、扎蹄、大良野鸡卷、炸牛奶、蹦沙、南海鱼生、大福饼、九江煎堆
 石湾鱼腐、
佛山九层糕、
汾宁白糖棉花糕、
平洲福肉饼、
凤城酿节瓜、
均安煎鱼饼、
乐从鱼腐、
伦教糕、
酝扎猪蹄、
柱候鸡、
大良野鸡卷、
顶骨大鳝、
炒水鱼丝、
西樵大饼、
均安鱼饼、
凤巢三丝、
高明濑粉、
双皮奶、
大良膏煎、
大良磞砂、
大良炒鲜奶、
盐步秋茄、
均安蒸猪

 
 
 * 
佛山市有许多小吃，如佛山扎蹄、佛山公芝麻饼、大良野鸡卷、大良磞砂、大良姜汁撞奶、炸牛奶、双皮奶、小凤饼、南海鱼生、大福饼、九江煎堆、三水狗仔鸭、水晶饺、甘笋蒸饼、西樵大饼、佛山九层糕、石湾鱼脯、佛山柱侯酱、蚕蛹、白糖棉花糕、应记云吞面、金源酒家甘笋蒸饼、汾宁白糖棉花糕、大可以状元及第粥、盲公饼、高明濑粉
佛山的许多小吃，如佛山盲公饼、大良蹦砂、扎蹄、大良野鸡卷、炸牛奶、蹦沙、南海鱼生、大福饼、九江煎堆等皆名闻遐迩。
石湾鱼腐
// 鱼腐是广东佛山市石湾的地方传统名菜。石湾历史上隶属南海县，又与顺德县紧邻，是一个鱼米之乡的小集镇，这里传统鱼类食谱名目繁多，鱼腐便是其中的一种。鱼腐是以鲮鱼肉、鲜蛋做原料，经过油炸而成。既可扒菜，亦可放汤，鱼腐入口干香，滑嫩爽口，风味独特，老少皆宜。本品以菜心垫底，亦名碧绿鱼腐，颜色艳丽，黄白相间，有荤有素，清淡素雅，乃石湾民间传统佳肴，在岭南各地广泛流传。
佛山九层糕
// 佛山九层糕是一种广泛流行在广东省佛山、南海一带的地方特色甜米糕小吃，做工讲究。当地民间喜庆节日，尤其春节，家家必做九层糕，用白米浸透，用石磨磨成水粉，搅拌成浆，加入糖水，用铜盘放一层薄水粉，加热蒸熟，然后逐层加粉至九层。
汾宁白糖棉花糕
// 汾宁白糖棉花糕，是广东省佛山市的一道传统特色糕点小吃，是汾宁美食街根据该店解放前“广记”松糕的做法，加以创新发掘起来的。
平洲福肉饼
平洲福肉饼是广东省佛山市著名的特色小吃，属于粤菜系。相信佛山很少人知道有这个特产。其实它出现的时间比盲公饼要早，一直是家庭和小作坊式制作，与中山的杏仁饼相似。此小吃捏在手里，软绵绵的；放到嘴里，甜而不腻，柔韧而不粘牙；嚼之散发出淡淡的玫瑰花香，和着丝丝陈皮的特殊香气。
凤城酿节瓜
凤城酿节瓜是一道广东顺德的传统名菜，属于粤菜系。鲮鱼肉、瘦猪肉分别剁茸，把肥猪肉用酒腌过，切成米粒状，三者和匀，加入精盐挞至起胶，放入蛋清、生粉、湿菇粒、虾米粒、鱿鱼粒拌匀再挞，加入葱粒拌匀作馅。 将节瓜去蒂，用竹片轻刮去外皮，保留少许皮青，横切成约5厘米厚的件，挖去瓜瓤，用沸水滚至五成熟，以洁净布吸干水分，在空洞内壁涂上干生汾，将馅料酿入。 烧镬下油，把酿好的节瓜拉油，取起。下姜花爆香，注入二汤，入下酿节瓜炆至仅熟（以筷子插入为度），捞起，排放碟上。将原汁加入少许色油调色，用湿生粉勾芡，淋上瓜面，放上芫荽叶设色。
均安煎鱼饼
均安煎鱼饼是广东顺德传统的地方名点，当地群众早就善于将鲮鱼起肉剁烂来做鱼青，或蒸或打边炉，味道鲜美。欧阳礼志加以改进，将鲮鱼青压成薄饼形，用慢火煎至金黄，使之成为佐酒下饭妙品。
乐从鱼腐
鱼腐是广东顺德地方传统名食之一，属于粤菜系。素以乐从镇制作技艺最为精湛，故称“乐从鱼腐”。它以色泽金黄，味道鲜美，幼滑甘香，诱人食欲而享有盛誉。在乐从摆酒设宴必有鱼腐，据说没有则会降低酒宴的价值。省港澳一带的肉菜市场均有鱼腐供应。芥菜仔即小芥菜，其气味辛温，有清肝解暑、发汗退热的作用。芥菜仔滚鱼腐软滑而腍，能清热解暑，开胃消食。
伦教糕
伦教糕，广东省佛山市顺德区伦教镇特产，中国国家地理标志产品。伦教糕由籼米粉、西谷米等原料制成，是岭南地方糕点，始创于伦教镇，流行于珠三角地区，与一般用大米和白糖制作的松糕、马拉糕不同，以晶莹洁白而著称。2021年5月24日，国家知识产权局批准对“伦教糕”实施地理标志保护。
酝扎猪蹄
酝扎猪蹄又叫佛山扎蹄，是广东省佛山地区传统名菜。有两种形式，一是用整只猪手酝制而成；一是用猪脚开皮，抽去脚筋和骨，再用猪肥肉夹着猪精瘦肉包扎在猪脚皮内酝制。所得酝，就是用慢火煮浸。前者制作工序较少，后者制作工序较多，但两者都为佛山人所喜食。由于后者是用水草扎着来酝制，所以名叫“扎蹄”。
柱候鸡
柱候鸡的主要调料是柱候酱，因此大家也就称这道菜为柱候鸡；柱候酱是由中国广东佛山梁柱候发明的一种酱料，用黄豆、盐、糖、芝麻和生抽等制成的。因为用此酱烧出来的菜特别美味，柱候酱用来烧制肉类，禽类都很好吃。
大良野鸡卷
大良野鸡卷又称大良肉卷，是一道传统的名点，属于粤菜系。以肥肉片制成，特点是甘脆酥化，焦香味美，肥而不腻，宜酒宜茶。
顶骨大鳝
顶骨大鳝是广东顺德的传统名菜，属于粤菜系。把鳝鱼宰好洗净，用60℃热水烫过，去除粘液，横切成4厘米长的段，将火腿切成与鳝段等长的粗条，火腩切件，蒜子去头尾。把柚皮烧去皮青，用水洗清涩味，再用上汤、猪油滚煨，如老抽调色。烧镬下油，把蒜子炸过，捞起。下姜米、蒜茸爆香，注入二汤，下鳝段、火腩、冬菇、陈皮丝，溅酒，调味，用老抽调色，把鳝段滚至仅熟捞起，用拇指把鳝脊骨去除，将火腿条插入空腔处，然后逐一放在扣碗竖排整齐，以蒜子伴边，中央放大冬菇1只，入笼扣熟。食前把柚皮回热放在鳝段上，扣在碟上，把原汁倒在镬中，加入湿生粉勾芡，淋在鳝上，撒上胡椒粉，放上芫荽叶设色。
炒水鱼丝
炒水鱼丝是广东顺德传统的地方名菜，属于粤菜系。鲜香甘爽，清甜肉滑。把甲鱼宰好，把腿肉起出切丝，另将甲鱼裙用水滚熟后切丝。把笋丝加适量盐，用水滚过滤干。猛火烧镬下油．把米粉丝炸过，捞起候用。将甲鱼丝拌上蛋清，上湿生粉，与甲鱼裙丝分别拉油至熟，倒入放在油盆上的笊篱中滤油后，下料头、笋丝先炒，再下蒜心、菇丝、水鱼丝、裙丝等，注入上汤，溅酒调味，加入老抽、蚝油，撒上胡椒粉，用湿生粉勾芡，加包尾油炒匀上碟，将炸好的米粉丝分伴四边即成。
西樵大饼
西樵大饼是广东省佛山市南海区传统小吃之一，用西樵山清泉制成此饼，所以被称为西樵大饼。制作原料有富强粉，白砂糖，清水，猪油，食粉，鲜酵母。西樵大饼颜色白中微黄，不起焦，入口松软，清香甜滑，食后不觉干燥，可与鸡蛋糕比美。
均安鱼饼
均安鱼饼是广东顺德均安镇传统的地方名点，当地群众早就善于将鲮鱼起肉剁烂来做鱼青，或蒸或打边炉，味道鲜美。欧阳礼志加以改进，将鲮鱼青压成薄饼形，用慢火煎至金黄，使之成为佐酒下饭妙品。
凤巢三丝
凤巢三丝是广东顺德传统的地方名菜，由鸡蛋、鸡丝等食材制成，属于粤菜系。
高明濑粉
高明濑粉源于广东省佛山市高明区，是一道以晒干的粘米粉为原料，辅以葱、姜、蒜、花生、头菜丝、鸡蛋丝，再配以肉丝或煎香的鱼饼丝为配料制成的民间小吃。一碗上好的濑粉，面条长，入口软、韧、爽、滑。配上用猪肝、瘦肉、骨头等慢火细熬的清汤，洒上一把花生米，少许蒜蓉、葱姜花，色香味俱全，吃下令人齿颊留香，回味无穷。
双皮奶
双皮奶，是一种粤式甜品。清朝时起源自广东顺德，用水牛奶做原料。现遍布于广东、澳门、香港等地。
大良膏煎
大良膏煎，一道小吃。主要材料为面粉、花生油等生活中常见的材料。色泽金黄，状若牛鼻，外层光滑松脆，内层呈蜂窝状，酥脆味香甜。
大良磞砂
大良磞砂是由面粉拌和猪油、南乳、白糖等配料油炸而成的食品，始制于清乾隆年间县城东门外的成记老铺，品种有蚝油、虾蓉、榄仁、南乳等有相当高的知名度。
大良炒鲜奶
大良炒鲜奶是一道广东地区特色传统名菜，最早始于广东顺德县大良镇，距今已有上百年的历史。主要由鲜奶、鸡蛋清和淀粉等精致而成，口味独特。此菜因其口味清淡，奶香浓郁，一直深受食客青睐。
盐步秋茄
盐步秋茄是一道广东省的特色传统名菜，属于粤菜系。近年常登上穗禅饮食店的大雅之堂，其实早已盛名，在粤菜材料介绍上有专门说明。在产地南海盐步，当地人称之为观音手指，有青皮、粗不及中指、长6至8寸、钩尾、柔软、头尾弯接不折等特征。据传，仅在盐步永平村一块两亩大小、叫做“黄皮园”的农地所产为之佳品。
均安蒸猪
均安蒸猪是广东省传统的地方名菜，属于粤菜系。均安蒸猪的食材是一头重约50公斤重的整猪，光腌制就要花上6个小时，造价相对昂贵，只有在均安当地红白喜事宴席上，才有机会吃到这道名菜。
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const foshanFoodsList = [
  // 灯影牛肉
  {
    province: '广东省', // 省
    city: '佛山市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '广东省', // 省
    city: '佛山市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
