/**
 * 广东省-梅州市-特产美食
 * 梅州市是客家菜之乡，有梅州腌面、客都草鱼、兴宁鸽、客家鱼生、客家盆菜、盐焗鸡、盐焗鸡爪、盐焗烤鸭、盐焗鸭腿、酿豆腐、酿香菇、酿苦瓜、酿茄子、酿婆参、酿蚝豉、酿春卷、酿辣椒、酿青瓜、酿豆角、酿豆干、酿芋头、腐皮卷、客家酿青椒、客家辣椒酿、鱼肉酿豆腐、西红柿酿蛋、客家酿蛋、梅菜扣肉、香芋扣肉、梅菜蒸猪肉、梅菜蒸排骨、梅菜炆猪肉、梅菜炆五花肉、梅州菜干蒸肉、梅干菜蒸鸭、梅干菜烧豆干、梅干菜干煸豆角、发粄燜花肉、蜜汁焗排骨、泥焗鸡、梅菜鸡、香菇鸡、白斩鸡、蒸滑鸡、板栗鸡、客家牛肉丸、客家艾叶丸、客家捶丸、客家娘酒鸡、客家葱油鸡、艾草煲鸡、姜酒鸡、黄酒鸡、羊肉酒、三及第汤、客家三杯鸡、浮水大鲩丸、客家鲩丸、客家汆鱼丸、手工鱼丸、姜芽嫩鸭、姜芽炒鸭片、银芽炒鸡丝、卤鸭脚、白卤鸭掌、红焖猪肉、红烧猪手、板栗烧牛肉、爆炒鱿鱼筒、南乳烤肉、鸡雄鹅掌、茹如豆腐、咕噜肉、五香干卤鸭、五香酱鸭、八宝窝鸭、开锅肉丸、焖狗肉、红烧狗肉、狗肉煲、羊肉煲、全猪煲、田螺煲、豆腐煲、杂菌煲、苦笋煲、客家蛋角煲、客家薯丝煲、客家芥菜煲、芥菜芋头煲、萝卜牛腩煲、清汤双丸、美味上汤鸡、八宝糯米酥鸡、姜糟焖狗爪豆、大极素菜、会响铃、叉烧肉、米粉肉、水晶肉、扣鸭、栗子酿鸡翅、西利柴把鸭、乱箭射绵羊、姜丝炒大肠、姜葱炒鸡球、芋艿炒鸡球、荔枝炒鸡球、豉椒凉瓜炒鸡球、银杏炒鸡球、酸子姜炒鸡球、豆豉香焗黄鳝、姜葱炒河鲈鱼片、油酥河鱼干、椒丝河鱼干、河鱼干炒韭菜、香菇肉碎酿青椒、客家咸菜炒猪肠、客家盐水番鸭、萝卜炒牛肉、炒牛百叶、梅菜蒸鱼、杞子炖甲鱼、清蒸鱼、酒糟鱼、醋溜鱼、松子鱼、炒墨鱼、炒虾仁、炒猪红、炸芋丸、松子鱼、凤投胎、烧乳猪、黄皮豆干、炸豆腐、猪肠灌、青菜丸子、米粉丸子、萝卜丸、番鸭丸、艾挥丸、炒三丝、七宝羹、虾仁烧卖、炸鱼卷、红烧鱼、炒鱼片、炒鸡酒、炒田螺、黄鳝炒苦脉、泥鳅钻豆腐、土青椒炒牛肉、猪胆干、腊猪肝、牛肠肺、鱼散粉、粉陈鸭、白菜卷、金针菜、河鱼干、杂锦拼盘、墨鱼煲腐竹、菠萝咕噜肉、豆腐干、腌蒜头、酸芋荷、福菜、酱瓜、咸冬瓜、糯米鸡、药根鸡、生炒鸡球、参须炖鸡、五叶神炖猪瘦肉、五指毛桃煲鸡汤、五指毛桃猪骨汤、五指毛桃龙骨汤、五叶神煲排骨汤、虫草花乌鸡汤、金针菇炖鸡汤、金针焖鸭汤、黄花菜炖鸭块、黄花菜炖鸭汤、合水鳙头汤、蜂蜜炖鸡、红菇鸡汤、福菜肉片汤、药根鸡汤、全猪汤、羊雌汤、羊醋汤、双丸汤、草菇汤、紫菜汤、客家炒面、手工面、煲仔饭、八宝糯米饭、八珍饭、鱼生粥、菩米粥、陈年客家萝卜条、红菌豆腐头、红菌豆腐渣、腌切牛肉干、发粄燜花肉、咸菜焖狗肉、五华三黄鸡、五华横陂小炒、五华熟米粥、银新金针菜、丰顺旗斗排骨、丰顺太极芋泥、丰顺豆干韭菜儿、丰顺金针菇、梅州客家米粉、梅江白宫苦瓜、布骆包子豆腐、大埔算盘子、大埔豆腐干、大埔牛肉干、百侯牛肉干、金山牛杂、南口黄皮豆干、松源五香豆干、广福豆干、丙村开锅肉丸、石扇咸菜、石扇鱼血焖饭、荷泗拱桥肉、砣子豆腐、白渡牛肉干、埔寨牛肉、汤坑牛肉丸、牛肉粄汤、仙洞米粉、汤南面线、汤南菜脯、油炸豆腐、乐仙腐竹、五华鱼生、横陂小炒、新桥腐竹等众多美食（详见：客家菜、客家小吃、梅州美食等）
 *
 * 仙人粄、酿粄、笋粄、薯粄、黄粄、粟粄、甜粄、发粄、艾粄、豆粄、叶子粄、鸡血粄、勺菜粄、芋丝粄、丁子粄、酢叶粄、薯粉粄、糊塘粄、菜丝粄、两熟粄、绿豆粄、煎荞粄、溜锅板、鸡颈粄、萝卜粄、芋头粄、苎叶粄、味酵粄、簸箕粄、忆子粄、珍珠粄、灰水粄、豆子粄、抹茶红豆粄
 * 黄金粄条、汤坑炒粄、三圳酿粄、西河老鼠粄、楼江甜粄、百侯薄饼、大埔凉粉糕、大埔客家薄饼、大埔豆子羹、蕉岭锅笃粄、丰顺云片糕、兴宁炸扎粽、
 * 
珍珠粄
珍珠粄原名老鼠粄，著名作家杜埃认为此名不雅，故改名为“珍珠粄”。是一种广东梅州著名的地方小吃，客家人民千百年来的传统美食，主要在梅州市梅县区、梅江区、丰顺、大埔等地，在惠州的惠东、博罗等地也有人做。现在吃老鼠粄也是一种怀旧，在以前，老鼠粄只有在节日的时候才能吃到。现在人民生活改善，经常能在一些美食街吃到老鼠粄。
仙人粄
仙人粄又名草粄，是广东、福建、江西一带著名的传统小吃，是一种清凉饮料，还可以临时充饥。它是用仙人草熬成的。是客家凉茶的另一种形式。由仙人草制成膏状，形状、色泽、口感似龟苓膏。农历入伏吃仙人粄是客家人的习俗，据说这天吃了“仙人粄”，整个盛夏都不会长痱子。仙人粄有降温解暑之功，且无受冷患寒之弊，在“仙人粄”中调入蜂蜜，再洒上点香蕉露，食之清甜爽口，沁人心脾。梅县区南口镇车陂村的仙人粄制作技艺，被列为梅州市级非物质文化遗产。
人丁粄
人丁粄是广东梅州的地方传统小吃，属于粤菜系。主要以粘米与糯米混合粉，加上过滤后的红糖水或开水搅拌，洒上少许食用红色素，揉搓至软韧粘结后，捏成小团，用手掌滚成圆柱条，长约15公分左右，放在蒸笼中猛火蒸透即可。大埔农村老百姓在年节或迎神会期间，大都做此人丁粄作为供品，其谐意家庭幸福，人丁兴旺。
五华酿豆腐
五华酿豆腐是一道以嫩豆腐和瘦肉为主要原料的菜品。2014年，五华酿豆腐传统技艺被列入梅州市市级非物质文化遗产代表性项目保护名录。
梅干菜
浙江绍兴、宁波、金华、丽水，江西抚州等地称梅干菜，浙江台州称菜干，广东梅州称梅菜干。有芥菜干、油菜干、白菜干、冬菜干、雪里蕻干之别，多是居家自制。做法是菜叶晾干堆黄，加盐腌制，晒干装坛。菜干油光黄黑，香味扑鼻，解暑热，洁脏腑，消积食，治咳嗽，生津开胃。故绍兴地区居民每至炎夏必以干菜烧汤，受用无穷。梅干菜切肉更为绍兴特色菜肴，已入《中国菜谱》。《麦田派》梅干菜，可作梅菜扣肉、梅菜干蒸排骨、梅菜干煲例汤及其他肉类佐料之用
大埔忆子粄
大埔忆子粄是广东大埔地方传统名点，属于粤菜系客家菜。
两熟粄
在客家农村，还有做两熟粄的习惯。 顾名思义两熟粄，在制作过程中是两次熟透而成的。首先取用纯净的粘米作原料，原料干、湿均可，放在磨里磨成粉状，越碎越好。如果还有针头大的颗粒，则要用筛子筛过，然后用冷水拌开，放在锅里（锅里先用油作底，起到减少黏锅的作用），匀火搅熟捞起（不能太鲜，以免做不成球状）。把它做成一个个球状后，又放回锅里，并撒上事先准备好的姜末，用慢火煎好（待全部球状或半数以上的球状有红斑迹象为佳）。最后放些开水继续用慢火煮10分钟即可。放糖、放盐则按各人口味而定。 两熟粄，不但有可口、消食的特点，而且还有温补健胃的功效，特别是对有寒凉底的胃痛患者有一定的疗效作用。
薯粄
薯粄，客家美食，在亲戚朋友聚会上少不了这道美食。薯粄的做法：先把一只大薯（分紫色和白色），去皮干净后用工具磨碎，接着在磨碎的大薯里加入鸡蛋、盐、酱油、葱花等调料搅拌均匀，待油热时用调羹拨出一小团的大薯，放到锅里煎，煎制的过程中要注意翻面，煎至表面呈金黄色即可。
水板
水板是广东梅州一带的特色传统小吃，属于粤菜系客家菜。在广东其他一些地方也有见。惠州别于外地，是将之主要用作“六月六太阳诞”的专祭食品，惠州民间歌谣有唱：“六月六，晒衣服，蒸水粄，驳(点)蜡烛”。那天人们早早将屋内冬衣和被帐拿出户外暴晒，而后蒸好七层水粄，点燃红蜡烛，祭拜太阳。
客家腌面
这是广东梅州地区最普及的一道早餐品种。几乎每一个离开家乡的人想起家乡的同时就会想吃一份腌面。在梅州，清晨，腌面无处不在。可要吃到地道的腌面，也不是非常容易的！加了炸蒜蓉后，无论是看相还是口感、营养，都好极了！
碗粄
碗粄（碗子粄，发粄）是一种客家地区的特色传统小吃，属于客家菜。在丰顺等客家地区是一种作为馈赠亲友的礼物，因它是甜质，且水分较少，送人的碗粄一般一份以四、六、八、十、十二的偶数为吉祥数字。碗粄由米浆盛入小碗中蒸制而成。蒸制良好的碗子粄外形精致，底部光滑完整，顶部膨胀开裂像一朵盛开的花朵，这就是人们常说的、也是最希望的“笑”了，“笑”是碗子粄的核心精髓内容，一锅 “笑”裂几瓣的碗子粄让人看了心情愉悦，吃了心里更是甜丝丝的，最重要的是它的“笑”预兆着来年合家过上平安顺利、生意大发、笑口常开的美好日子，它作为一种吉祥物，历来倍受人们的喜爱。
菊花糕
菊花糕是广东梅州传统名糕点之一，菊花糕在梅州已有一百多年的历史。有“糜饭食会饱，菊花糕孬巧”的俗语。2011年04月30日，畲江菊花糕被梅州市人民政府列入梅州市第三批市级非物质文化遗产名录。
客家酿豆腐
客家酿豆腐也称为肉末酿豆腐、东江酿豆腐，是客家名菜之一，是东江传统风味名菜，也是客家饮食文化中极具代表性的一道传统菜品。通常将油炸豆腐或白豆腐切成小块，在每小块豆腐中间用筷子分开，用香菇、碎肉、葱蒜等佐料填补进去，然后用油锅煎或砂锅小火长时间煮，食时再配味精、胡椒等调料即可。“客家酿豆腐”之所以独具特色，与它严格的制作工艺分不开。“酿”是一个客家话动词，表示“植入馅料”的意思，“酿豆腐”即“有肉馅的豆腐”之意。客家酿豆腐味道鲜美，在白嫩的豆腐中酿入肉馅渊鱼肉、虾米等，增加了口感，更有嚼头。客家酿豆腐成菜后，鲜嫩滑香，营养丰富。2015年，客家酿豆腐烹饪技艺被列入惠州市第六批市级非物质文化遗产名录。2015年11月10日，客家酿豆腐烹饪技艺入选广东省第六批省级非物质文化遗产名录，遗产编号：Ⅷ—84。2021年8月30日，酿豆腐入选广东省首批粤菜（客家菜）“湾区标准”。
客家盐焗鸡爪
客家盐焗鸡爪是源于中原地区和粤东山区都属内陆腹地传统的特色小吃，最先从客家盐焗鸡慢慢演变而来。
百侯薄饼
百侯薄饼，是广东大埔县百侯区传统小吃。用精面粉，瘦猪肉、香菇虾米，豆腐干，猪脚汤、蒜白等烘制而成。2014年8月19日，百侯薄饼被梅州市人民政府列入梅州市第六批市级非物质文化遗产名录。
大田柿花
大田柿花，广东省梅州市五华县特产，中国国家地理标志产品。据传大田柿花明代已为贡品；大田柿花具有三大特点：一是果大、核小且少；二是肉厚质软，色泽橙红，味似蜂蜜，久藏不硬化；三是营养丰富，含有转化糖及游离酸，甘露醇及维生素C等，有润肺、健胃、降血压等药用功效。2017年12月29日，原国家质检总局批准对“大田柿花”实施地理标志产品保护。2022年2月，国家知识产权局发布证明商标注册公告，“大田柿花””正式获批注册。
桂岭蜂蜜
桂岭蜂蜜，广东省梅州市蕉岭县特产，中国国家地理标志产品。桂岭蜂蜜是一种天然保健品，富含葡萄糖、蛋白质、果糖、有机酸、矿物质及多种维生素等营养成分。2016年12月28日，原国家质检总局批准对“桂岭蜂蜜”实施地理标志产品保护。
汤坑牛肉丸
汤坑牛肉丸简介：汤坑牛肉丸是丰顺有名的地方小食之一，外形与荔枝果大小的圆球状，“圆”与“缘”同音，送“肉圆”有结缘之意，成为汤坑今天的地方习俗。2013年，汤坑牛肉丸传统技艺被列入梅州市市级非物质文化遗产代表性项目保护名录。
盆菜
盆菜是一种混合了十几种食材的客家大菜，源于香港新界元朗客家围村的传统菜式，深圳和香港新界的饮食习俗。“大盆菜”旧时称“百鸟归巢”，后来传到整个香港、深圳，成为广府菜的一种。盆菜是每年部分广府年夜饭的“重头戏”，传说源于南宋末年，宋帝赵昺为逃离金兵追赶，落难到如今的香港元朗，当时的村民得悉皇帝驾临，村民把食物贡献出来而成，成为客家传统文化中一场别开生面的饕餮盛宴。盆菜是一道色香味俱全的汉族名肴，属于粤菜系客家菜，距今已有700多年历史的客家本地菜式，是四川仪陇、广东梅州、惠州、河源、韶关、深圳客家地区家人团聚时、庆祝重大事件时的传统菜肴，也被认为是客家年菜的巅峰。是深圳本土具有代表性的客家饮食文化的一部分。盆菜据传起源于南宋末年，已有数百年的历史，是一种杂烩菜式。传统的盆菜用木盆或锑盆盛载。每逢喜庆节日，例如新居入伙、祠堂开光或新年点灯，新界的乡村均会举行盆菜宴。盆菜，这种源于元朗围村的传统菜式，一盆菜里可荟萃有百菜百味，共冶一炉，基本原则是“和味”。过去，农村里有喜庆事，便在空旷的地方，配以木台木凳，以木炭加热，大家围着热烘烘的盆菜，一边品尝，一边庆祝。人们喜欢逢年过节时吃盆菜，盆菜就有了喜庆团聚的意义。
簸箕粄
簸箕粄是著名客家小吃，属于粄的一种，又名“笼床粄”，是客家人的传统食品。发源于闽西客家地区长汀县、武平、上杭一带。因旧时用米浆均匀摊在簸箕中蒸熟后包馅而得名。存在于闽西、粤西、赣南一带，尤其是闽西的西南一带特为流行。样子有些像广州肠粉或梅州捆粄，因此许多人将其混为一谈，其实其工艺和用料上并不相同。
云片糕
云片糕又名雪片糕，是江苏、广东梅州、潮州等地的传统糕类美食。其名称是由片薄、色白的特点而来的。其特点质地滋润细软，犹如凝脂，能久藏不硬，在制作上很为讲究，如炒糯米粉，一般要贮藏半年左右，以去其燥性；对绵白糖的选择也较严格；至于糕的切片要求也很高，每条糕块（长22厘米）一般要切140片左右。2015年，留隍云片糕被列入梅州市市级非物质文化遗产保护名录。
捆粄
捆粄是广东省梅州市丰顺县、汕尾市陆河县，福建闽西的汉族特色小吃，属于客家菜，是客家小吃。捆粄据说是丰顺客家人祖先自北南迁后，因当地不种小麦，无面粉可制春卷，而用大米磨粉制皮代替春卷的一大创造，北风南味，别具特色。
红菌豆腐头
红菌豆腐头是平远县仁居镇的特产。它色红肉白味美，质地甜、韧、嫩，是一种鲜美的佐餐食品，在梅州客家地区及海内外久负盛名。2009年03月12日，平远红菌豆腐头被梅州市人民政府列入梅州市第二批市级非物质文化遗产名录。
笋粄
笋粄（sǔn bǎn）是发源于广东梅州大埔传统的客家小吃。笋粄、豆粄其制作包括粄皮和肉馅两部分。是大埔小吃中最典型的，带有浓厚中原饮食文化印记的一道客家小吃。2016年，大埔笋粄制作技艺被列入梅州市县级非物质文化遗产代表性项目保护名录。
汤坑咸菜
汤坑咸菜，是以芥菜，食用盐为原材料的一道菜品。
薯粉豆干
薯粉豆干是广东潮汕地区较为常见的一种小吃，普遍的吃法是油炸薯粉豆干。
猪肚包鸡
猪肚包鸡，是一道广东省传统的地方名菜，属于客家菜系，又名猪肚煲鸡、凤凰投胎，流行于广东的深圳、惠州、河源、梅州等粤东一带，是广东客家地区酒席必备的餐前用汤，汤里浓中带清，有浓郁的药材味和胡椒香气。最早是客家女人坐月子时吃的一道菜肴。猪肚包鸡制作技艺是佛山市三水区第九批区级非物质文化遗产代表性项目。
韧香黄粄
韧香黄粄是一道以糯米、柴草、杨梅叶为原料制成的小吃。
汤南面线
在丰顺县汤南镇，每逢嫁娶、生日、弥月、乔迁等喜庆宴会，都少不了一道菜——炒面线。这种古老的特色面食小吃，便是当地的特产——汤南手工面线。长期以来，汤南手工面线以精湛的制作工艺、独特的口味和深长的寓意，深为当地及周边地区群众所喜爱。2012年07月10日，汤南面线被梅州市人民政府列入梅州市第四批市级非物质文化遗产名录。
大埔老鼠粄
老鼠粄源于广东梅州大埔一带（应该是大埔漳溪圩），因为两端尖，形似老鼠，客家人惯称粉为“粄”，因此称为老鼠粄。后来传至台湾，当地客家人称为米筛目，是指制造时把粉团经过筛子般的擦板，从洞眼（目）中搓出粉条由于于“筛”的闽南语近似“苔”，所以俗写为米苔目。后来于马来西亚又有人写成米台目。
苎叶粄
苎叶粄，又称为粗叶粄，是广东梅州、深圳、惠州，福建龙岩一带的地方传统小吃，属于客家菜。粗叶粄顾名思义也就要使用粗叶为原料捣出汁，和着糯米粉再辅之黄糖清蒸而成。粗叶粄有其独特的甜味使其在


*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const meizhouFoodsList = [
  // 灯影牛肉
  {
    province: '广东省', // 省
    city: '梅州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '广东省', // 省
    city: '梅州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
