/**
 * 广东省-汕头市-特产美食
* 老妈宫粽球,东里猪脚饭,油泡鱼册,生炒鱼面,酥皮蟹盒,福合埕牛肉丸,酥炸虾饼,达濠鱼丸,潮汕蚝烙,鸳鸯膏蟹,汕头牛肉丸,薄壳米,橄榄菜,鲎粿,腌咸菜,酸菜白鳝,两英番薯粥,五果汤,酸梅乌鱼,樟林鼠曲粿,
 * 
老妈宫粽球
粽球是中华民族的传统小食，历史悠久，各地制法有所不同，如泉州的肉粽，饶平的栀粽，珠三角的甜粽，风味各异。而老妈宫粽球是广东潮汕地区久负盛名的传统名小食，节日食俗。它以糯米为主料，外形为
东里猪脚饭
东里猪脚饭是广东汕头澄海区传统的小吃，属于潮菜系。入口软烂无渣、肥而不腻、香气四溢、胶绵而不沾牙。选料方面，猪脚的卤制过程是在陈年老卤汤的基础上，酌量加入上好的酱油、冰糖、八角、豆寇、丁香、香菇、大蒜头等原料，猛火煮开后放入猪脚，半个小时后改为小火熬煮，约3个多小时整个猪脚香汁渗透、皮肉软烂，即可熄火。待卤汤凉却后捞去上层凝结之猪油，然后装入沙锅，一般每一个沙锅装4只猪脚，再用保鲜膜覆盖沙锅口后置于冰柜冷藏结冻即成。
油泡鱼册
油泡鱼册是一道以鱼肉、火腿为主要原料的菜品。

生炒鱼面
生炒鱼面是一道色香味俱全的传统名点，属于粤菜系。是广东汕头的特色美食。将鱼肉用刀刮下剁成鱼肉茸，去净筋，盛在盆内，加入味精、精盐、使力揉和，搓成团。薯粉用布包扎，然后将鱼肉压扁，扑上薯粉，放在按板上，用木棍碾成大薄片，放进开水锅里泡一下捞起，用清水漂净晾干水分后，用刀切成丝，拉开成面条样。
酥皮蟹盒
酥皮蟹盒是广东汕头一带的传统名点，属于粤菜系。色泽金黄，馅香皮脆。把猪肉、蟹肉、虾肉、香菇、荸荠肉均切细粒，用淀粉水拌过，下鼎炒香，加入精盐、味精、胡椒粉、芝麻油和湿淀粉（少许）调成馅料。取面粉160克，加入猪油80克拌和，搓成酥心，又把面粉240克，加入猪油80克和清水90克拌成面皮。将酥心、面皮各分成24件。用面皮包上酥心，用棍子擀薄摊开，卷起再擀，再卷起，用刀一切为二，逐件擀成薄圆形。先取1张皮子，放入馅料，再取1张皮子覆盖在上面，四周捏紧，再卷成花纹边，制毕后，下六成热油鼎，用文火炸至金黄色取出，沥去油便成。
福合埕牛肉丸
福合埕牛肉丸是广东潮汕地区的传统名小吃之一，属于粤菜系。一个历经多年的潮汕老字号，以其鲜嫩美味的牛肉，酥脆可口的牛肉丸，精心制作的调料享誉潮汕。

酥炸虾饼
酥炸虾饼是广东汕头著名的传统名点，属于粤菜系。系用特制的模具灌浆烘烤制作，香甜松软，可谓色、香、味、形俱佳。潮汕美食中小吃纷繁，这款用河虾制作的小食，是将面粉、虾、葱这几样简单的食材结合，然后通过油炸的作用，达到入口酥脆、味道甘香的效果。
达濠鱼丸
达濠鱼丸，广东省汕头市濠江区特产，中国国家地理标志产品。达濠鱼丸色泽呈白色或灰白色，形态呈圆球状，形态完整、均匀，组织结构紧密，富有弹性，滋味、气味鱼香浓郁、味道鲜美。2018年3月，达濠
潮汕蚝烙
蚝烙是广东潮汕地区的传统小吃，“蚝烙”是潮州久负盛名的传统民间小食，属于粤菜系。鲜美酥香，酥而不硬，脆而不软。采用优质雪粉，甚至连猪油都要用本地猪的鬃头肉煎出来的猪油，制作的每一步骤十分考究。现身《舌尖上的中国》的潮汕“蚝烙”掀起汕头市新的“蚝烙热”。已有数百年历史的潮汕美食“蚝烙”再度受到海内外食客热捧。
鸳鸯膏蟹
鸳鸯膏蟹，是一道广东汕头的传统名菜，属于粤菜系。此菜味极鲜美，造型美观，一只呈清红色，一只呈精青色，相对成对，故名“鸳鸯膏蟹”，为席上佳肴。
汕头牛肉丸
汕头牛肉丸又称手捶牛肉丸，是广东省潮汕地区最著名的传统小食之一，起源于潮菜，在汕头已有近百年历史，它以柔、润、鲜、爽而驰名。其制作技艺源自2000多年的官廷菜肴“捣珍”，这种制作技艺在潮汕地区流传也有近百年历史。手捶牛肉丸是潮汕地区最为普遍及大众化的民间小食，它既可作为点心小食，又可作为一道汤菜上筵席。潮汕人用两根特制的铁棒，每根3斤重，呈方形或三角形，用双手轮流捶打，把牛肉打成肉浆。并且用牛肉、牛骨熬汤来煮牛肉丸，从而使牛肉丸更具有浓郁的牛肉味，同时还增加用沙茶酱作酱碟吃，被评为潮汕名小食。2019年1月8日，汕头牛肉丸被汕头人民政府列入汕头市第六批非物质文化遗产。
薄壳米
薄壳米是潮州菜的特色名菜。广东澄海盐灶薄壳米的美食方法殊多，食家如有机会光临盐灶，可将刚捞起未加盐水的薄壳米拌入熟猪朥（猪油脂）和白砂糖，再拌添点芝麻油和青芫荽，入口美味无比。也可用薄壳
橄榄菜
橄榄菜（kale borecole）是广东潮汕地区风味小菜，属粤菜系中的潮州菜。取橄榄甘醇之味，芥菜丰腴之叶煎制而成。橄榄菜食之开胃消食，帮助消化，增进食欲。橄榄菜制作工艺可追溯至宋明时代，经加工制作后具“清、鲜、爽、嫩、滑”等特点。富含橄榄油珍贵营养成份和多种维生素及人体必需的钙、碘，还含有铁、锌、镁等多种微量元素。橄榄菜还是潮汕地区咸菜延伸的特色品种，是潮汕美食文化的重要组成部分，潮汕橄榄菜制作技艺在汕头市龙湖区、澄海区及周边村镇的历史悠久、流传广泛。清嘉庆《澄海县志》记载：“芥菜，也名大菜，本县秋收后田野种植甚多，收获后用盐渍，味道甚美，澄海手巧艺精的妇女利用本地物产橄榄与盐渍芥菜精工煮制成乌橄榄菜，食之开胃消食，助消化。”清代中期，澄海县外砂乡有“乾亨菜廊”、“天盛菜廊”和“顺昌泰菜廊”等作坊，可见橄榄菜制作之盛行。
鲎粿
鲎粿，是广东省汕头市潮阳区棉城、海门特有的传统小食。鲎粿(潮音hao7 guê8)(普通音hòu guǒ)。最传统的做法是取鲎肉与米浆混合，加入猪肉末香菇鹧鸪蛋等食材一同炊制，最后再经油浸高温烹制而成，极具潮阳乡土味。现鲎已为保护动物，鲎肉由其他代替制成改良后的鲎粿。有些回乡探亲的华侨、港澳同胞和在外工作的人一到潮阳，总想尝尝鲎粿的滋味。
腌咸菜
腌咸菜是一道美味的菜肴。腌制就是让食盐大量渗入食品组织内来达到保藏食品的目的，这些经过腌制加工的食品称为腌制品。盐腌制品有腌咸菜、腌肉、腌禽蛋、腌制小黄瓜、腌萝卜干等。
酸菜白鳝
酸菜白鳝是广东汕头一带的传统名菜，属于粤菜系。此菜汤清味鲜、肉嫩软滑。酸菜入汤，清爽俐口，别具风味。
两英番薯粥
两英番薯粥是广东潮汕地区一道传统小吃，在潮阳县（今汕头市潮南区）两英镇的大小餐馆里，经营的食谱比别处奇特，除有参鸡鱼翅外，还卖番薯粥。上馆子吃番薯粥者甚多，有的人虽然就餐佳肴，满席之时却也非品尝一碗番薯粥不可。
五果汤
五果汤（甜汤）是广东地区（潮州、汕头、汕尾、揭阳） 传统小吃之一，人们最爱的传统宵夜之一。同时也是民间的传统保健食品。潮俗以桂圆、白果、莲子、薏米、百合、绿豆、银耳等为健脾食物，合煮为甜汤，入秋后多吃，称为五果汤。
酸梅乌鱼
酸梅乌鱼是一道广东汕头的特色传统名菜，属于粤菜系潮州菜。此菜汤清鲜带酸，肉鲜嫩带香。先将乌鱼开腹洗净，抹上少许精盐，腌制约20分钟，然后放入蒸笼，蒸熟待用。先将酸咸菜切片，酸梅脱核，然后

樟林鼠曲粿
樟林鼠曲粿是一道经典的传统小吃，属于传统节日食品。从春节至元宵期间，广东澄海人家家户户都要制作各种粿品。其中最有名的要数鼠曲粿。澄海的鼠曲粿以樟林所产最为有名。吃时可再蒸热或油煎，入口有软




*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const shantouFoodsList = [
  // 灯影牛肉
  {
    province: '广东省', // 省
    city: '汕头市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '广东省', // 省
    city: '汕头市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
