/**
 * 广东省-汕尾市-特产美食
汕尾菜果
在汕尾，每近中午时分，各种风味小食，纷纷上市。街巷处处香气扑鼻．初到汕尾的人闻所未闻、见所未见，诸如：猪肠果、重糕果、莱头果、薯粉果、油炸果、鼎溜果、升煽果、鸭蓝果、铜盘卷、发果、菜包果、碗仔果，还有各式各样的准条汤、糯米丸、尖米丸等，这些菜果或以米粉为皮，花生米、虾米、瘦肉丝、鳅鱼丝以及香料蔬菜为馅，蒸熟后放着，吃时再用油煎，加调味料；或直接由米浆和虾仁、肉丁、蔬菜等拌在一起，蒸一层，加一层，重叠再蒸，叫做重（叠）糕果，吃时切成一块块，佐以生抽配料；油炸果、菜头丸一类，则以萝卜丝、葱头或蒜头、虾仁、红丝，用米浆拌和油炸。 [74]
猪油糖
猪油糖，广东省汕尾市海丰县土特产，流行在粤东潮汕地区的一种零食，是海丰人把猪油与面粉、食糖制成的 一种糖果。 [6] [77]
韭菜馃
韭菜馃，民间小食。选用韭菜为主要馅料（韭菜花、韭黄均可代之），制作时将新鲜韭菜洗净切粒，加入香菇粒、虾米粒，并和入适量味精、精盐、胡椒粉、芝麻油，拌匀成馅料。馃皮通常用番薯淀粉制成。取馃皮压薄成圆形状，包裹馅料后，捏成面上突皱的球形，放进蒸笼蒸15分钟至熟，然后在平底铁锅上用油煎至呈金黄色。味道香浓，外白内翠。街巷流动小食担贩卖的，多取经济型的，馅料纯用韭菜，不加冬菇等细料。 [69]
坑螺
坑螺，是有名的潮汕特产之一， [5]陆河县山区有名的土特产。其形体稍长，尾尖、壳硬、暗褐色，活像一个园椎体。其嘴亦为腹，腹足异常发达，生活在深山小溪之中，昼伏夜出，喜爱水源洁净之处。平时吸附在水中的石缝或石块上，以石头上的微生物和小型藻类等水生植物为食料。一般个体略比手尾指大小，便可捡而煮食，大者有如拇指。 [32]坑螺是有名的粤东特产之一。坑螺是汕尾特有的一种风味菜种，因为其生活在淡水河中因此也被称作为“坑”螺，是有效区分海螺的方式。坑螺形体稍长，尾尖、壳硬、暗褐色，活像一个园椎体。 [5]
陆河年糕
在一年一度的新春佳节里，年糕是陆河人家必备的过年食品（礼品）。其样式多种多样，含意丰富，历史悠久。陆河年糕大致可分为大床甜板、大床松板、 团子发米反（又称假喜子），喜板、印花板（也称桃板），艾茸板、煎堆板……五花八门，都是用糯米粉和红糖、芝麻、花生等原料制成。而这些年糕均在年前做好。如，大床甜板，一般人家农历十二月初或中旬则要动手加工。因其须大柴大火，且蒸的时间较长。诸如其它年糕可以在入“年价”（农历十二月二十五日）后加工制作。如“喜米反”，用预先准备好的干粘米粉同早已溶化过滤好的红糖水和合加入“米反种”或发酵粉至适中，用碗盛好端入锅中隔水蒸，一锅大约有十来个。如果“喜米反”每个都张开笑口，主人非常高兴，其意为“来年大发”。 [70]
潮汕赤蟹
此蟹即潮汕膏蟹，学名叫锯缘青蟹，为广东潮汕的著名海产。膏蟹就是卵巢最丰满的雌蟹；已受精但卵巢不太饱满的雌蟹称“母”：略微饱满的叫“花蟹”；而雄蟹只供炒用，与未受精的母蟹统称“肉蟹”。捕自海中的雌蟹，卵巢饱满的不多，要进行人工育肥，使之成为“膏蟹”。养殖好的膏蟹，腿粗肉满，膏满脂丰，清蒸之后，鲜美异常，营养价值甚高。 [71]
小米
小米市汕尾市海丰县最有名的小吃，选用上等的蕃薯粉、精选的五花肉、大地鱼粉、盐、糖、等配料，经传统的工艺制作而成的饺子，海丰方言叫“饺子”。 [72]
牛肉饼
牛肉饼选用新鲜的牛腿肉（注：必须新鲜且无注水的牛肉），加上适量的配料，经传统的手工制作而成。海丰牛肉饼不同于牛肉丸，不是圆的是扁扁的。海丰的牛肉饼吸引人的关键就在于它的汤，其诱惑人的全部功夫就在于它的一碗汤。牛肉饼汤，手打牛肉Q弹很香，汤里放胡椒面。 [72]
菜粿（菜包粿）
菜粿（菜包粿）是汕尾市海丰县特色小吃，那就是菜粿（菜包粿），选用粘米、凉薯、五花肉、橄榄菜、并添加少量的大地鱼粉、盐、糖等配料经传统的手工工艺精制而成。 [72]
客家娘酒
客家酒酿则是当地的土造家酿。“客家人待客少不了酒。那纯真的家酿米酒，呈乳白色，浓的用筷子一粘，可以拉出丝来，喝上一口，甜滋滋的，直透心头。 [62]
客家米食
早期客家人的主食是稻米和蕃薯，在农家多半吃蕃薯，城镇才有米饭可吃。糯米通常作粄和酒的原料，而米的成饭，方法不外捞饭、闷饭和蒸饭三种，其中较流行的为捞饭，因为米汤可喂猪和浆洗衣服 ，颇具经济上的意义。粄是客家米食中的特色，即闽南人所说的粿。 [75]
汕尾市饮食习惯与闽南接近，海鲜、汤类和甜菜的烹饪最具特色，主要有烧雁鹅、护国莱、清汤蟹丸、油泡螺球、绉纱甜肉、太极芋泥等名菜。汕尾市的小吃有最有地方特色菜粿、糯米丸、尖米丸
*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const shanweiFoodsList = [
  // 灯影牛肉
  {
    province: '广东省', // 省
    city: '汕尾市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '广东省', // 省
    city: '汕尾市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
