/**
 * 广东省-湛江市-特产美食
 * 湛江菜代表菜式：湛江白切鸡、白灼海虾、清蒸花蟹、干煎鲳鱼、蒜蓉蒸鲍鱼、蒜蓉蒸龙虾、蒜蓉蒸沙虫等。
特色小吃主要有：炭烧生蚝、烂锅炒粉、沙虫沙螺粥、炸虾饼、肠粉、蛤蒌饭、田艾米籺等。
英利烧猪
白切狗
梅菉鱼丸
牛杂串
簸箕炊
吴川月饼
番薯丝干粥
杂鱼汤
白切鸭
白斩鸡
爆脆海蜇皮
徐闻凉拌粉
炭烧生蚝
安铺鸡饭
“羊三味”其实就是在徐闻到处可见的羊粥、羊羹和羊骨汤。
著名全羊宴，白切羊肉，羊杂，红烧羊肉
吴川裹粽
徐闻八宝饭
廉江裹蒸粽
廉江裹蒸粽广东省湛江廉江市的地方传统小吃，属于端午节食品。向以香滑可口、软硬适度著称。冬春季节热吃，夏秋季节凉吃。成品金黄软韧，蘸上峰蜜或赤砂糖吃，甜蜜带视香，别有风味。
吴川粉皮
吴川“及第粥”
吴川八宝饭
雷州狗肉煲

 * 
湛江菜代表菜式：湛江白切鸡、白灼海虾、清蒸花蟹、干煎鲳鱼、蒜蓉蒸鲍鱼、蒜蓉蒸龙虾、蒜蓉蒸沙虫等。
特色小吃主要有：炭烧生蚝、烂锅炒粉、沙虫沙螺粥、炸虾饼、肠粉、蛤蒌饭、田艾米籺等。
英利烧猪
英利烧猪是广东省雷州市（旧称海康县）英利镇的传统名菜，地处雷州半岛南端，属于粤菜系。皮色光滑，又香又脆，肉质细腻，又嫩又滑，香润可口，是餐桌上一道美味。几百年来，它以“纯天然，无污染，是绿色食品”为卖点，引得不少外地游客慕名前来品尝。
白切狗
白切狗，是一道以狗肉为主要食材制作的一道粤菜，用蒜茸香菜食醋白糖胡椒粉等配制食用。
梅菉鱼丸
梅菉鱼丸是一道美食，制作原料主要有鱼丸。
牛杂串
牛杂串是广东湛江著名的传统小吃，属于粤菜系。最关键的是那煲滚烫浓香的酱汁，里面除了面酱之外，八角、茴香、花椒、陈皮等各种香料是必不可少的。牛杂串是孩子们最喜爱的小食之一。当北方寒潮南下，
簸箕炊
簸箕炊是广东省粤西地区的一种传统小吃，属于籺的一种。在茂名市的电白、高州、信宜、化州以及湛江市的遂溪县、廉江市、吴川市、雷州市、徐闻县一带非常盛行。因其采用竹篾编制而成的簸箕为盛具而著称。遂溪西边沿海的港门镇、北坡镇、草潭镇、杨柑镇等称之为“白籺”，湛江市区及廉江市和化州市称其为簸箕炊。以廉江簸箕炊最为出名。制法为放磨成浆的米粉于簸箕当中上锅蒸煮，待一层熟透后再逐渐添加，一般都有三层以上。待米粉全熟后，用小刀将其剐成格状，其表面放上香油、芝麻与蒜蓉浆（即蒜鸡油）。部分地区还会加入橄榄菜调味。入口细腻富有弹性，软滑而不黏牙，再加上秘制的酱料，香浓而又不腻，那种味道绝对令人难以忘怀。
吴川月饼
吴川月饼，广东省吴川市特产，中国国家地理标志产品。吴川制作的大月饼，从1千克至7.5千克不等，其用料考究、制作严谨、工艺精细，皮薄馅厚，香酥爽口，甜度适中，风味纯正，而且造型美观、色泽金黄、图案精致、花纹玲珑浮凸、饼皮柔软、色香味俱全。有伍仁、豆沙、莲蓉、冰皮月饼、水果月饼、海味月饼、无糖月饼等40个品种。2013年06月26日，原国家质检总局批准对“吴川月饼”实施地理标志产品保护。2020年9月16日，吴川月饼入选近日签署的《中华人民共和国政府与欧洲联盟地理标志保护与合作协定》首批保护名录。
番薯丝干粥
番薯丝干粥是广东省湛江市徐闻县的传统小吃。广东其他很多地方都有用番薯丝来煲粥，但湛江市的徐闻县的番薯丝干粥却与其他地方的番薯丝粥不同。
杂鱼汤
杂鱼汤是一道广东湛江的传统名菜，属于粤菜系。广东湛江的杂鱼汤是平常百姓的家常菜，但味道非常鲜美，做汤的鱼是渔民在浅海区拉网捕捞的小海鱼，品种很杂，故名“杂鱼汤”汤水不放其他佐料，只放少许的油和适量的盐，保持了鱼的鲜味，先喝汤后吃鱼。我认为到湛江一定不能错过这富有广东特色的鲜美杂鱼汤。
白切鸭
白切鸭是广东省湛江市的一道特色名菜，属于粤菜系；此菜是粤菜鸭肴中最普通的一种，其肉质细嫩，润滑清甜，无膻味，补中养胃、化痰止咳、滋阴润肺，在湛江除了海鲜、白切鸡、白切狗，白切鸭也“香”名远扬。
白斩鸡
白斩鸡又叫白切鸡、三黄油鸡，是一道中华民族特色菜肴，起源于广东，是一道经典的粤菜，在南方菜系中普遍存在，如广府菜、上海菜、客家菜中都有、始于清代的民间酒店，因烹鸡时不加调味白煮而成，食用时随吃随斩，故称“白斩鸡”。白斩鸡形状美观，皮黄肉白，肥嫩鲜美，滋味异常鲜美，十分可口，肉色洁白皮带黄油，具有葱油香味，葱段打花镶边，食时佐以姜蓉、蒜泥、酱油，保持了鸡肉的鲜美、原汁原味，食之别有风味。2018年9月，被评为“中国菜”之上海十大经典名菜，小绍兴白斩鸡、振鼎鸡白斩鸡、泰煌鸡白斩鸡在上海都是家喻户晓的品牌佳肴。
爆脆海蜇皮
爆脆海蜇是广东湛江一带的传统名菜，属于粤菜系。皮嫩黄滑亮，形态美观，质地清鲜脆爽，味道甘洌香郁，炙热而食尤美。
徐闻凉拌粉
徐闻凉拌粉是广东雷州地区传统小吃之一，属于粤菜系。
炭烧生蚝
炭烧生蚝是用生蚝制作的一道沿海地区的特色小吃，其味道鲜美，深受大众喜欢。生蚝含磷很丰富，由于钙被体内吸收时需要磷的帮助，所以有利于钙的吸收。安铺鸡饭
安铺鸡饭是广东省安铺地区一道传统名菜。用花生油涂抹鸡身，使鸡皮光滑油润。佐料为豉抽回以本地名产小磨芝麻油、沙姜、芫荽、葱白。鸡饭，即是以鸡汤加猪油煮的饭。
羊三味
由于品种优良和风格独特，徐闻山羊在全国都出名的，徐闻羊肉有着滋阴补肾的功效，还由于其胆固醇、脂肪含量低，被利用开发出了很多保健食品。另外徐闻羊肉味道可口，可当早餐、宵夜。因此，在徐闻，贵至达官显富，下至贫下中农，羊肉人人皆爱。在湛江徐闻，除了有著名全羊宴，白切羊肉，羊杂，红烧羊肉外，还有一款极负盛名的小吃——“羊三味”。顾名思义，“羊三味”其实就是在徐闻到处可见的羊粥、羊羹和羊骨汤。
吴川裹粽
广东吴川裹粽向以香滑可口、软硬适度著称，裹蒸粽做法，以精白糯米浸洗后晾干，再以生炸新鲜猪油稍炒后，加上叉烧瘦肉或五花炸扣肉，夹大红虾肉或蟹肉为馅。蒸炊火候适度。
徐闻八宝饭
八宝饭是广东省湛江市徐闻县婚嫁喜宴必备的传统的腊八节的节令名点，属于粤菜系。此小吃历史悠久，八宝饭不仅图其名吉利，还因其美味可口。做法也颇复杂，味道也很香美。宴席上，菜盘中所摆的八宝饭，一般是一碗甜一碗咸，既意为“好事成双”，也供不同口味选吃。其主要原料为糯米、红枣、薏米、莲子、豆沙、冬瓜糖 、咸鸭蛋、白糖等8 种，故名“八宝”饭。
廉江裹蒸粽
廉江裹蒸粽广东省湛江廉江市的地方传统小吃，属于端午节食品。向以香滑可口、软硬适度著称。冬春季节热吃，夏秋季节凉吃。成品金黄软韧，蘸上峰蜜或赤砂糖吃，甜蜜带视香，别有风味。
吴川粉皮
吴川粉皮是粤西地区特有的一种小吃，原料为米浆，通常为蒸制，类似肠粉。
吴川“及第粥”
吴川“及第粥”是一道美食，主要原料是猪肉丸。
吴川八宝饭
“吴川八宝饭”于1922年在吴川梅录镇创制的，是腊八节的节令菜肴。参照宫廷八宝饭，根据吴川的物产条件，结合当地群众的口味习惯，舍去南方难以购到的樱桃，糖桂花等原料，加入百合，是柿饼，白果，红白玫瑰糖浆、冰肉、红枣等原料制成的甜饭，纯甜，软滑，气味芬芳。另有一种是选用优质叉烧、腊肠、冬菇、莲子等制成的咸香八宝饭。
雷州狗肉煲
雷州狗肉煲是广东省雷州地区特色传统名菜，“狗肉滚三滚，神仙站不稳”，象狗肉这种“上不了席面”的菜肴你可以在雷州半岛的湛江品尝到。在这里的狗肉煲，用广东话来说就是打边炉，一年四季都有。


 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const zhanjiangFoodsList = [
  // 灯影牛肉
  {
    province: '广东省', // 省
    city: '湛江市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '广东省', // 省
    city: '湛江市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
