/**
 * 广东省-中山市-特产美食
* 石岐乳鸽,杏仁饼,中山粉果金吒,芦兜粽,小榄菊花肉,沙溪扣肉,蕉蕾粥,粉果金吒,咀香园杏仁饼,三乡濑粉,中山杏仁饼,沙溪走地鸡,黄圃腊味,钵仔禾虫,
 * 
石岐乳鸽
鲜、嫩，用生长21－28天的乳鸽腌渍之后，经烤箱烘烤而成。鸽子外脆内嫩，中间有一泡汤汁。此汤汁鲜纯，却不油，感觉清爽而鲜美。 鸽子性味比较平和，体质热、寒的人都可以吃 [71]。
杏仁饼
在中山的土特产中，以咀香园杏仁饼最为有名，入口杏仁香味浓郁、酥化甘香，深受食客欢迎。制饼工艺经过改革，杏仁饼不但保持了传统的香纯浓郁，入口酥甘溶化特色，而且饼质更加细腻，装璜更符合现代化要求 [72]。
中山粉果金吒
它是以猪腮肉（肉质不腻）配以南乳、花椒、八角等调料。金吒的吃法可要讲究：从尖端食起，到肉馅时，先吮一口油香，然后咬肉食。不然，冒失一口咬下去，那油沫便四溅 [74]。
芦兜粽
中山芦兜粽是圆筒状，两头交错一字平口，一般直径12厘米，长30厘米，酿入洗净的糯米（有微量精盐、生油、拌匀），夹以烧腩肉、咸蛋黄（洗净蛋白胶为宜），用圆水草绑扎。武火煲至水滚放入芦兜粽，文火煮4个小时，间中加些开水，收火留浸于汤内4小时。味香腻，食之韧滑 [75]。
小榄菊花肉
小榄菊花肉是广东中山一带的传统名菜，属于粤菜系。看来虽肥，但吃起来爽脆不腻、清香可口，特别是菊瓣液香凝喉，芬芳扑鼻，是中山的传统送礼佳品。 当地的大多数老人都会使用其来舒缓胃痛,认为其有一定的养胃效果。榄地区盛产菊花。充分利用菊花作食品便应运而生，其中最负盛名是菊花肉。菊花肉是选用猪的背部肥肉、切成透明状薄片用糖腌制， 外面拌一层半鲜半干的糖渍菊花瓣而成。
小榄菊花肉是选用猪的背部肥肉、切成透明状薄片用糖腌制，外面拌一层半鲜半干的糖渍菊花瓣而成。这种菊花肉看来虽肥，但吃起来爽脆不腻、清香可口，特别是菊瓣液香凝喉，芬芳扑鼻，是中山的传统送礼佳品 [79]。
沙溪扣肉
沙溪扣肉首先讲究选料，所选猪肉既不太肥也不太瘦，以偏肥的"五花腩"为首选。制作时最花工花时间是漂油，即原大块肉清水煮熟后，用特制的“钉板”把有猪皮的一面拍打再浸水使肥油漂出，然后加配料腌制再红烧，直至肉面变黄而皮色和瘦肉部份变红，然后切件，每件夹一块已熟的粉葛（称葛扣）或香芋（称芋扣）或用青菜或梅莱垫底（称菜扣），排好上钵隔水炖约一小时 [81]。
蕉蕾粥
蕉蕾粥是一道以蕉蕾为主要原料制成的粥品。
粉果金吒
中山粉果是广东中山地方传统名点之一，历史悠久，其中以金吒为代表。此外还有角仔、叶仔、红枣饼等。粉果以澄面、生粉、水、猪油、精盐拌匀搓皮，以叉烧、瘦肉、冬菇、笋、鲜虾配以生抽、白糖、味粉、蚝油等调味品为馅料，经精心包制而成。其特点是清香、肉鲜皮脆、味道鲜美。粉果的包制，要求满而不实，形似榄核，摇有响声，而馅料就要细。由于制作精细，风味独特，故深受食家的喜爱。
咀香园杏仁饼
咀香园杏仁饼是一道美味可口的传统名点，属于粤菜系。咀香园杏仁饼创始于一九一八年，产于广东中山市。因其外形似杏仁，故称杏仁饼。已有近百年历史，原属家庭自作自食；以后创制成为产品，外形改为圆形小饼。先选取一级绿豆，经传统工艺精选制成绿豆粉；配以杏仁磨成粉，在饼中夹肉精制而成。饼身松脆，饼心香甜，入口松化，风味独特。中山杏仁饼，以咀香园生产为正宗，规模最大，质量最佳，又称咀香园饼。
三乡濑粉
三乡濑粉是广东中山三乡镇的传统名吃。粉条按特殊工艺制成，粉质韧滑爽口，类似桂林米粉。配以上汤肉料，可煮成美味可口的汤粉。由加工厂批量生产的中山三乡濑粉，是广东省出口五大皇牌米粉之一。
中山杏仁饼
中山杏仁饼是广东省中山市的传统糕点小吃之一，本为易味庐饼家创制于本世纪初，两三年后，又有咀香园饼家异军突起。所制之杏仁饼与易味庐齐名，二十年代至三十年代初为鼎盛期，产品远销至美洲和东南亚各国。入口杏仁香味浓郁、酥化甘香，深受食客欢迎。
沙溪走地鸡
沙溪走地鸡肉质鲜美，加上烹饪的手法较为独特，做出的白切鸡响誉中山，被成为沙溪的三道菜之一。
黄圃腊味
黄圃腊味，广东省中山市黄圃镇特产，中国国家地理标志产品。黄圃腊味起源于清光绪年间，由黄圃民间小食作坊的主人王联盛利用当地原料，加上独特的手工技艺制作而成。经过一路发展，黄圃腊味利用本地的原材料，经过多种传统手工技艺制作而成，色、香、味俱佳，是广式腊味的典型代表。2009年，黄圃腊味传统制作工艺被纳入广东省级非遗名录。截至2013年，黄圃镇有腊味食品企业约80家，是中国最大的“广式腊味”生产基地，也是中国首个“中国食品工业示范基地”、“中国腊味食品名镇”和“全国农产品加工创业基地”。“黄圃”腊味商标被评为广东省著名商标，黄圃腊味被认定为国家地理标志保护产品。2006年09月25日，原国家质检总局批准对“黄圃腊味”实施地理标志产品保护。
钵仔禾虫
钵仔禾虫是广东省中山地区一道传统名菜，禾虫的民间烹调方法甚多，或煎、炖、煲鲜禾虫，或哂禾虫干，腌制禾虫酱，后者甚至是农家常年的备用菜。
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const zhongshanFoodsList = [
  // 灯影牛肉
  {
    province: '广东省', // 省
    city: '中山市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '广东省', // 省
    city: '中山市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'cantoneseCuisine', // 菜系编码
    cuisineCategoryName: '粤菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
