/**
 * 上海-上海市-特产美食
 * 
 * 
 响油鳝糊,油爆河虾,油酱毛蟹,锅烧河鳗,红烧圈子,佛手肚膛,红烧回鱼,黄焖栗子鸡,腌笃鲜,上海葱油拌面,上海菜饭,炸藕合,南翔小笼,上海春卷,八宝辣酱,上海生煎包,蟹壳黄,炸糍粑,上海罗宋汤,城隍庙梨膏糖,排骨年糕,葱烤大排,上海炸猪排,上海阳春面,上海茶叶蛋,上海泡饭,城隍庙五香豆,上海白斩鸡,高桥松饼,小绍兴鸡粥,素菜包,上海冷面,九斤黄鸡,油煎八宝饭,上海家常炒酱,上海小笼汤包,枣泥酥饼,上海炒年糕,上海炒饭,香糟鱼汤,上海菜肉大馄饨,生煎包,红烧滑水,桂花糖粥,上海开洋葱油拌面,葱油饼,猪油百果松糕,桂花赤豆汤,上海红烧狮子头,上海蜜汁糖蹄,猪肉烧卖,开洋葱油面,进京乳腐,水桃酥,擂沙圆,油氽馒头,糟田螺,咸鸭蛋粢饭团,乔家栅粽子,油豆腐线粉汤,高桥松糕,上海咸煎饼,上海三鲜小馄饨,上海卤鸭,老上海盐水棒冰,虾仁两面黄,香油酥饼,上海馄饨汤,一捏酥,上海猪肉灌肠,绿波廊船点,猪头方肉,蒸拌冷面,翡翠虾滑醸竹笋,鸡肉生煎馒头,春风松月楼素菜包,上海油鸡,鲜肉猫耳朵,上海熟白肉,上海素火腿,桂花白糖甜菜条,锦江烤鸭,毛豆子炒酱瓜,油氽排骨年糕,条头糕薄荷糕,熏拉丝,五味鸡腿,八宝鸡,卤糟猪脚,双包鸭片,口蘑锅巴汤,四鲜白菜墩,大饼,松江钙鱼,枫泾丁蹄,桂花肉,椒盐蹄胖,油条,流黄蟹斗,炒毛蟹,生煸草头,粢饭,糟钵头,红烧秃肺和红烧鮰鱼,红烧蛔鱼,翡翠虾蟹,肉丝黄豆汤,芙蓉蟹粉,草头圈子,虾子大乌参,蜜枣扒山药,豆腐浆,阳澄蟹卷,青鱼下巴甩水,鸡圈肉,鸡骨酱

 * 
 * 
 * 
 * 
 * 
 * 
 * 
上海人称的本帮菜指的是上海本地风味的菜肴，特色可有用浓油赤酱（油多味浓、糖重、色艳）概括。常用的烹调方法以红烧、煨、糖为主，品味咸中带甜，油而不腻。
本帮炒菜中，荤菜中特色菜有响油鳝糊、油爆河虾、油酱毛蟹、锅烧河鳗、红烧圈子、佛手肚膛、红烧回鱼、黄焖栗子鸡等，真正体现本帮菜浓油赤酱的特点。上海蔬菜按季节不同有各种时令菜。马兰头、荠菜、鸡毛菜、上海小油菜等都非常清爽。市民早点：大饼、油条、粢饭、豆腐浆。
 腌笃鲜
腌笃鲜是起源于江南的传统名菜。此菜口味咸鲜，汤白汁浓，肉质酥肥，笋清香脆嫩，鲜味浓厚，各地根据地方文化和口味做法有不同的差别，食材上各有增减，但基本包含春笋、猪肉（包含各种部位）、腊肉、火腿、百叶结、莴笋等食材。主要是笋和鲜、咸五花肉片一起煮的汤。 “腌”，就是指腌制过的咸肉；“鲜”，就是新鲜的肉类（鸡、蹄髈、小排骨等）；“笃”，就是用小火焖的意思。
上海葱油拌面
葱油拌面是中国上海一带的一道色香味俱全的传统小吃，属于上海菜。将适量香葱去根洗干净，剪成2CM的葱段，用吸油纸吸干香葱上的水分，以防止熬油时候外溅，油锅中倒入油大火烧热，热后将香葱放入油锅里，小火慢慢的熬，待香葱变成金黄色时放生抽，虾皮和糖继续熬，糖融化时就可以关火，葱油就熬好了，准备一个锅，锅中水烧沸腾后放入面条煮熟，煮熟的面条捞出控干水分拌入葱油，和一些新鲜葱末即可。
上海菜饭
上海菜饭，是上海市的一种地方小吃。它的原料一般是：大米，4棵油菜，鸡腿2个，盐2小匙，料酒一小匙，黑胡椒碎适量，白糖少许。上海菜饭简单易做，品味适中，深受上海市民喜爱。
炸藕合
炸藕合是山东和上海地区传统特色小吃，味道香酥嫩爽，适于家庭烹饪，没有固定风格。所用材料包括洗净莲藕、肉馅、蛋白、湿淀粉、生油。将藕去皮切片，每两片不完全切开而成一藕夹，中 夹葱姜肉馅，两片藕合在一起而称藕合。而后挂一些面粉糊，过油之后即成
南翔小笼
南翔小笼原名“南翔大肉馒头”、“南翔大馒头”、“古猗园小笼”，也称为“南翔小笼包”、“南翔小笼馒头”，是上海市嘉定区南翔镇的传统名产，以皮薄、肉嫩、汁多、味鲜、形美著称。南翔小笼的馅心是夹心腿肉做成肉酱，仅撒少许姜末和肉皮冻、盐、酱油、糖和水调制而成；皮是用不发酵的精面粉制作而成的。2014年8月，原国家文化部第四批国家级非物质文化遗产代表性项目名录推荐项目名单公示结束，南翔小笼制作技艺成功入选全国传统面食制作技艺。（概述图来自：）
上海春卷
上海春卷是中国上海的一道传统小吃，属于沪菜系；春卷，又称春饼、薄饼。是传统民间节日传统食品。流行于中国各地，江南等地尤盛。民间除供自己家食用外，常用于待客。每逢农历元旦和立春日，合家团聚，饮春茶，吃春饼，贺新年。沪滨食俗，人们过年要吃韭黄肉丝春卷，是吃五辛菜，吃春饼古俗的传承。沪郊还有早春季节吃荠菜春卷的习俗。这种油炸食品具有外皮酥脆、馅心软嫩、颜色金黄、鲜香美味等特点。上海开埠后，春卷在一些小吃点心店里已常年供应，馅心花色亦有增加，以城隍庙绿波廊制作的韭芽肉丝春卷，最为食客称道
八宝辣酱
八宝辣酱是上海地区传统名菜，色泽艳丽光亮，鲜辣辛香。它是由炒辣酱改良而来的。“八宝辣酱”味道辣鲜而略甜，十分入味，大受食客的欢迎。后来，上海一些菜馆纷纷效仿，“八宝辣酱”就广为流传了。
上海生煎包
生煎包又称生煎馒头（拼音：shēngjiān mántóu；沪语发音：ssanji mhoedhou）是流行于上海的一种地方传统小吃，简称为生煎。上海生煎包可以说是土生土长的上海点心，据说已有上百年的历史。其特点为由于上海人习惯称“包子”为“馒头”，因此在上海生煎包一般被称为生煎馒头。原为茶楼、老虎灶（开水店）兼营品种。馅心以鲜猪肉加皮冻为主，20世纪30年代后，上海饮食业有了生煎馒头的专业店，馅心花色也增加了鸡肉、虾仁等多种品种。
蟹壳黄
蟹壳黄，俗称小麻糕，是中国江浙沪一带的特色小吃之一，其馅心有荠菜、葱油、白糖、明油豆沙等4种，特点是形似蟹壳，色呈金黄，油多不腻，香脆酥松，糖馅甜醇，咸馅味鲜。蟹壳黄做法主要由三种，海派的作法有甜有咸。甜的主要以白糖猪油做馅，也有放玫瑰、枣泥、豆沙；咸的以猪肉丁为主，考究的则要加进蟹粉、虾仁一类食材。
炸糍粑
炸糍粑，传统小吃，属于年节食品，柔软细腻，香甜可口，食用方便，是招待客人、馈赠亲友的上等佳品。制作原材料 ：糍粑、油、白糖。
上海罗宋汤
上海罗宋汤，是洋葱，胡萝卜和牛肉等食材做成的一道汤品，这道汤的做法比较耗时，食材也很多，需要耐心。
城隍庙梨膏糖
城隍庙梨膏糖是上海地区特色风味名小吃，相传已有1300多年历史。100多年前上海城隍庙开设了果膏糖店，由于业主善于经营，使城隍庙梨膏糖扬名中外。此糖分疗效梨膏糖和花色梨膏糖两类。疗效梨膏糖有止咳平喘、生津开胃之效用。
排骨年糕
排骨年糕是上海地区一种经济实惠、独具风味的传统小吃，已有50多年历史。大排佐以小而薄的年糕，经油氽、烧煮而成，既有排骨的浓香，又有年糕的软糯酥脆，十分可口。排骨色泽金黄，表面酥脆，肉质鲜嫩。入口糯中发香，略有甜辣味，鲜嫩适口。
葱烤大排
葱烤大排是大排若干块、香葱、淀粉、蛋清、姜、料酒一汤勺、生抽一点五汤勺、老抽零点五汤勺、糖两茶匙、高汤半碗、可以用水和鸡汁兑、黑胡椒、盐。
上海炸猪排
上海炸猪排是一道由猪肉等食材制成的美食。主料为猪大排3块，辅料为油适量，盐2g，鸡蛋1只，黑胡椒末2g，椒盐粉2g，黄酒10ml，干淀粉适量，面包糠适量。
上海阳春面
上海阳春面是以高汤、猪油、面为主料制作的主食。
上海茶叶蛋
上海茶叶蛋，是上海人喜爱的一种经济实惠的食品。
上海泡饭
上海泡饭是一道美味可口的名点，属于上海菜。辅料先改切成丝装，锅里放水200g，等水开放入米饭、主料、辅料及适量调料，等锅开之后即可装盘完工
城隍庙五香豆
城隍庙五香豆是上海市的一种传统小吃，产地是中国上海城隍庙，用料讲究，火候适当。所用原料是专门选自浙江省余姚县出产的蚕豆。“不尝老城隍庙五香豆，不算到过大上海！”这是凡到城隍庙中外游客众口一致的评语。城隍庙五香豆皮薄肉松，盐霜均匀，咬嚼柔糯。吃到嘴里香喷喷、甜滋滋，别有风味。
上海白斩鸡
白斩鸡是上海地区传统名菜。“说起白斩鸡，要数小绍兴”，这已成为了许多上海人的口头禅。由于“小绍兴”是精选上海浦东一带所产著名的“三黄鸡”，质量好、味道鲜美，而赢得了广大顾客的喜爱。“小绍兴”也成了上海久负盛名的名店，白斩鸡是上海地区的名菜。形状美观，皮黄肉白，肥嫩鲜美，滋味异常鲜美，十分可口。
高桥松饼
高桥松饼为上海市浦东新区高桥镇四大名点之一，因其入口酥松而得名。又因酥皮层次分明，每层薄如纸，别称千层饼。通常用精白粉（面粉）、熟猪油、绵白糖、赤豆、桂花为原料，经擦酥、包酥、开酥、插皮子、包馅成型、烘烤、冷却、检验、装盒等工序制作而成。成品后，表面呈黄色，戳记清楚，四周呈乳白色。切开层次分明，皮薄馅多，不偏皮，无杂质，底部无僵硬感。入口松酥，甜糯。（概述图来源自：）
小绍兴鸡粥
小绍兴鸡粥是上海市的一道特色小吃，属于本帮菜；该菜品是由三黄鸡、上白粳米辅以各种佐料制成，鸡肉白嫩滑韧鲜美，粥中带绿，颜色鲜亮，营养丰富，是一道滋补佳品。
素菜包
素菜包是上海地区特色传统小吃之一，以面粉为制作主料，素菜包的烹饪技巧以蒸菜为主，口味属于咸鲜。素菜包的特色：皮质松软，馅心清香爽口，是夏令佳点。
上海冷面
上海冷面是以面条（最好是蒸面）、鸡肉或里脊肉、青椒为主要材料制成的一道菜品。冷面吃来爽口，配以不同蔬菜的浇头，就会给人以不同的美味体验。被包裹了花生酱的浓郁酱汁，并且在醋和辣油的精心调味后，使得面条的口感更加丰富和有层次。黄瓜、鸡蛋、鸡丝等可增添面条的营养成分和更多的口感享受。
九斤黄鸡
“九斤黄鸡”：鸡的一个品种，是我国有名的土鸡品种，多为棕黄色，背部宽，胸部肥厚，臀部发达，雄鸡体重可达九斤，雌鸡可达七八斤，公鸡阉割后，最高可达14斤，通称“九斤黄”，俗称“九千岁”。
油煎八宝饭
油煎八宝饭是一道以糯米为主要食材和其他作料为辅而制作的美食。
上海家常炒酱
上海家常炒酱是用去皮花生米80克、香干3块切丁、竹笋丁150克、猪肉丁150克、葱姜末少许、鼎丰鲜甜面酱100克、豆豉1大勺、料酒1小勺、干淀粉1茶勺、白糖1小勺等制作而成的家常菜。
上海小笼汤包
汤锅内注入清水，煮沸后下入猪皮。氽至猪皮打卷时捞起滤干。切成小丁。重新注一锅清水，煮沸后下入皮丁。 加入料酒和盐，搅拌均匀。
枣泥酥饼
枣泥酥饼，上海地区传统小吃，是用油酥面作皮，黑枣泥为馅，经油炸成熟的面食。其色泽金黄，小巧玲珑，外皮酥松，馅香甜可口，深受港澳同胞及日本旅游者欢迎。1988年第二届全国烹饪比赛获银牌奖。
上海炒年糕
上海炒年糕是一款由年糕、香菇、白菜、里脊肉等原料制成的菜品。
上海炒饭
上海炒饭是一道以大米、青菜、火腿等为主要原料制作的菜品。
香糟鱼汤
香糟鱼汤是上海的特色菜肴，这道鱼汤不用一滴油，利用糟油特有的香味增香吊鲜，汤水清澈醇香，清淡味美。
上海菜肉大馄饨
菜肉大馄饨是上海市的一道特色小吃，属于本帮菜；其皮薄馅大，汁多鲜嫩，馄饨发展，更成为名号繁多，制作各异，鲜香味美的一道美食。
生煎包
生煎包是流行于上海、浙江、江苏及广东的中国特色传统小吃，简称为生煎，由于苏州人习惯称“包子”为“馒头”（古时包子本称“馒头”，清代方由馒头分出），因此在苏州生煎包称生煎馒头。
上海水蜜桃
上海水蜜桃肉质柔软，皮薄色艳，汁多味甜，香气浓郁，入口易溶。如把熟透的桃子拨破一小片皮层，用嘴吮饮，就能把果实中的浆质吸尽，是桃品种中难得的佳品。南汇水蜜桃是上海第一个获得国家原产地域产品保护的农产品。
红烧滑水
上海地区特色传统名菜之一，属于沪菜系。以新鲜河鱼尾，熟猪油50克酱油，绍酒，鸡汤等为原料制成。
桂花糖粥
桂花糖粥是江南地区特色传统名点。糖粥稠而不糊，红枣白粥，色泽诱人，桂花飘香，甜香可口，很适合市民特别是老年人的口味。
上海开洋葱油拌面
上海开洋葱油拌面是一道以细面、葱、 开洋、虾仁、油、麻油、酱油、糖、醋为主要食材制作的美食。
葱油饼
葱油饼（英文名：Shallot pancake）是北方地区特色小吃的一种，属闽菜或鲁菜菜系。主要用料为面粉和葱花，口味香咸。中国福建，山东威海、东北地区、河北等地都有该小吃分布，是街头、夜市的常见食品。
猪油百果松糕
松糕，是上海节日小吃之一。据上海《嘉定县绿志》记载：“松糕，以粳糯米磨粉，和以赤白糖汤，徐徐入瓶，松腻得中，则易熟而不滞。果品如松仁、胡桃。枣肉、检厂、幅红，芳香如玫瑰、木樨、薄荷及干菜、猪脂，皆可加入。岁杪馈遗，比户为之，新正常以享客，重九亦然。盖谐声于高，以为颂祷……”如今，每逢旧历岁暮新春，上海地区盛行的馈赠松糕之风，故由此而来。是用糯米粉掺粳米粉制成圆形糕状，上缀干果蒸制而成。
桂花赤豆汤
桂花赤豆汤，是一道著名甜点，属于上海菜。注意食用时赤小豆与鲤鱼，两者均能利水消肿，在用于治疗肾炎水肿的时候效果很好；但是正是因为利水功能太强，正常人不可同煮服用。
上海红烧狮子头
上海红烧狮子头是以猪腿肉250克为主料，鸡蛋1个藕1节淀粉1汤匙水淀粉1汤匙油菜心8棵为辅料的食品。
上海蜜汁糖蹄
蜜汁糖蹄是上海特色传统名菜。猪蹄膀，白砂糖，桂皮，茴香等为原料
猪肉烧卖
猪肉烧卖是上海特色名小吃，具有成型别致、香甜酥烂、入口消融、甜而不腻、四季适宜等特点。
开洋葱油面
开洋葱油面是上海市著名传统小吃。也是城隍庙的著名小吃之一。
进京乳腐
进京乳腐也称为南桥进京乳腐，是上海市特产之一，以黄豆、糯米为原料，做成豆腐后使其发酵而成。主要分为红乳腐、白乳腐和花色乳腐三种。进京乳腐以鼎丰乳腐为代表，兴盛于清末同治年间。2007年，鼎丰乳腐酿造工艺被列入首批上海非物质文化遗产名录（Ⅷ-7）。（概述图来自：）
水桃酥
水桃酥是上海地区特色传统小吃中的代表，其味道鲜美，是其他地域小吃所不具备的。表面呈淡黄色，不生不焦，香甜可口。
擂沙圆
擂沙圆是上海市乔家栅点心店的特色传统名点之一，已有70多年的历史。清朝末年，上海城里三牌楼附近的雷妪以设摊卖汤团为生。为多做些生意，想方设法弥补汤团存放和携带不便的缺陷。开始，把汤团表面滚了一层糯米干粉，后又试制了各类干粉，结果采用赤豆粉效果甚佳。在煮熟的各式汤团上滚一层擂制的干豆沙粉而成。既有汤团美味，又有赤豆芳香，因无汤水，便于携带，冷热皆宜，别具特色。有色有香、热吃有浓郁的赤豆香味，而且软糯爽口，携带方便，一直深受游客的欢迎。
油氽馒头
油氽馒头是上海市百年老店枣沈大成点心店制作的特色传统小吃。馒头形状小巧玲珑，皮呈金黄，色泽美观，入口松脆，肉馅鲜嫩，一咬汤汁四溢，肥而不腻。吃后齿颊留香，满口生津，若趁热食用，更会余味无穷。
糟田螺
这种小吃是用个大肥美、肉头厚实的安徽屯溪产的龙眼田螺为原料，进店后先用清水养两天，使其吐净泥沙，然后再放入锅内，加上茴香、桂皮等煮较长时间。最后将烧好的田螺放上陈年香糟，糟制而成。这种糟田螺呈褐灰色，肉质鲜嫩，汁卤醇厚，入口鲜美，十分受人欢迎。此美食是上海五味斋点心店和鲜得来点心店的著名小吃。
咸鸭蛋粢饭团
咸鸭蛋粢饭团是一道上海传统小吃，主要食材有黑米、糯米、咸鸭蛋、油条等。
乔家栅粽子
乔家栅粽子是上海地区传统特色名小吃，端午节食俗。
油豆腐线粉汤
油豆腐线粉汤是上海地区特色传统小吃。干点配湿点，这是平常上海人习惯的饮食方法。而湿点中油豆腐线粉汤则是保留节目。虽然它看上去有点清汤寡水，但配生煎等油腻的点心，则是绝配。而且看它的烧制过程也是一个享受：锅内汤汁翻滚，煮着铁丝网勺里的线粉，闻一闻，香气四溢。
高桥松糕
将笼屉内侧刷一层麻油，把拌好的糕粉铺在上面。先铺满笼屉高度的2/5，取预制的干豆沙分成10块，将其中5块均匀地放在糕的四周，另5块均匀地放在糕的中部。然后将笼屉空出部分铺满糕粉，刮平，再在糕面上薄薄铺一层糕粉，并将各种果料与玫瑰花、糖板油丁摆成各种图案。
上海咸煎饼
上海咸煎饼咬一口嘎啦松脆，是上海一道传统小吃，做法不难，先发面再调味，芝麻可以加多一些香味更浓。
上海三鲜小馄饨
好像上海人对馄饨的大小分的特别清楚。上海的三鲜馄饨也有别于无锡的三鲜馄饨。馄饨馅并不是鲜肉、开洋、榨菜制成的馅心，而是纯肉的。所谓三鲜名堂皆在汤里，蛋丝、虾皮、紫菜此三鲜调出薄皮包裹着的鲜肉，口感咸香爽滑。
上海卤鸭
上海卤鸭是上海地区特色传统名菜之一，补虚养身调理 健脾开胃调理 营养不良调理。
老上海盐水棒冰
老上海盐水冰棒是以淀粉、蜂蜜、柠檬汁为主要食材，利用冰棍模具制作而成的一款降暑小吃。
虾仁两面黄
两面黄是上海一种比较古老的小吃，传统的两面黄有两种口味，一种是虾仁口味的浇头，还有一种是素浇头。
香油酥饼
香油酥饼是上海市城隍庙湖滨点心店的特色传统小吃之一。深受群众欢迎。以饴糖， 猪油，芝麻等为原料。入口即化，现做现吃更佳。
上海馄饨汤
上海馄饨汤是一道美味可口的小吃，属于沪菜系。将馄饨薄皮包馅。煮成熟后，装在鲜美汤汁碗中半沉半浮隐约可见肉馅，汤料由虾皮，冬菜，紫菜及香菜配成。带汤食用极佳。
一捏酥
一捏酥是上海市高桥地区三种著名的特色传统小吃之一。原为粉状，用汤匙抄吃，作冬令进补的小食品。后为便于出售，乃制成一捏之形，故称一捏酥。产品外型如一手所捏，指纹清晰，完整，不松散，入口松如雪絮，酥如霜花，油而不腻，甜而适口，营养丰富，特别适宜儿童及老年人食用。
上海猪肉灌肠
上海猪肉灌肠是上海肉类食品厂在50年代生产的鲜干肠(亦称格拉布斯)时结合市场需要创制的。鲜干肠是属欧式灌肠，肉馅中牛肉占40%，辅料中用大蒜，不合上海消费者口味，于是根据市场需要的实际情况，全部采用猪肉原料，辅助中不用大蒜而改用中式口味的香料，经过试制销售后，深为消费者欢迎，以后又经改进提高后试销香港，又得到好评。1981年被评为商业部优质产品、国家优质产品，荣获银质奖。
绿波廊船点
绿波廊船点是上海地区传统小吃之一，集各类特色点心于一处，配套点心有圆子、粽子、春卷、眉毛酥、素菜包、小笼包、鸡血汤、酒酿百果圆子等
猪头方肉
猪头方肉始产于上海，亦称“五香猪头方肉”，有近30年历史，系仿照西式火腿的原理，并利用西式火腿的模型而创造的一个新品种，所不同的是以猪头肉为原料，成品每只重约3.5千克，价廉物美，改变了猪头肉的形状和口味，深受广大消费者的欢迎，猪头方肉分“红”、“白”两个品种，前者在辅料中多加红酱油，成品呈深红色，后者则增加盐的用量，酌量使用白酱油，成品色泽较淡。食用时切成片状，具有西式产品形状和风味，又便于携带和保管，是大有发展前途的大众化肉制品。
蒸拌冷面
蒸拌冷面是将面条先蒸后煮，再用冷风吹凉，加调味拌食的面食。上海饮食市场上，冷面一向是夏季旺销品种。1937年前后，制法都是将面条煮熟后，用冷水冲凉而成。1949年后，卫生部门因冷面用生水冲凉而予以禁售。1952年，采取将面条先蒸后煮，再 用冷风吹凉的办法加工冷面，获得成功。不仅符合卫生要求，且加工后的面条硬韧滑爽。
翡翠虾滑醸竹笋
翡翠虾滑醸竹笋是一道上海小吃，这道菜不仅营养丰富，味道鲜美，而且还很养眼。
鸡肉生煎馒头
鸡肉生煎馒头是上海地区特色传统小吃之一。这种小吃是以发酵后的精白面粉作皮，用熟鸡脯肉丁、猪夹心肉末和肉皮冻加香油等多种调料作成馅心。包捏好的馒头尖上还要蘸上葱花和芝麻，表层刷上素油，放入油锅中煎熟。该品形态饱满，上半部有黄澄澄的芝麻和碧绿的葱花，松软适口。下半部则酥脆可口，馅重汁多，越吃约香。此小吃以上海市王家沙点心店制作的最佳。
春风松月楼素菜包
春风松月楼素菜包是上海市城隍庙春风松月楼素菜馆的著名特色小吃，已有70多年的历史。 它是融京帮风味、苏帮风味、扬帮风味于一体的，又有上海本地风味的素菜馆。该店的素什锦、炒冬菇、罗汉斋、口蘑锅巴汤、炒蟹粉、面筋面等菜肴在上海颇负盛名，尤其是该店制作的素菜包更是名闻遐迩，十分受人欢迎。
上海油鸡
上海油鸡亦称白鸡、白斩鸡，上海地区特色传统名菜，油鸡鸡皮黄亮，肉白净，以吃口鲜嫩著称，为常年生产产品，深受消费者欢迎。假如说北京烤鸭是京城的招牌菜，那么沪上则推白斩鸡无疑。白斩鸡的渊源可溯自战国时代楚国的宫廷名菜露鸡。据郭沫若考证：露鸡即卤鸡，选用嫩母鸡投入五味调和的卤汁中煮熟而成，经历代相传而成为宫廷及民间的一款佳肴；在演化过程中又花开两枝：制法分成红白两种，红者为烧鸡，白者即白斩鸡。
鲜肉猫耳朵
鲜肉猫耳朵是一道以面粉为主要食材制作的风味小吃。
上海熟白肉
熟白肉是上海地区特色传统名菜，外表洁白，略带鲜红，皮肉酥烂，肥而不腻。
上海素火腿
上海素火腿是一道美食，主要原料有黄豆芽汤或笋汤、酱油、白糖等。
桂花白糖甜菜条
桂花白糖甜菜条是上海地区特色传统小吃，甜菜条，色黄亮鲜艳，条形均匀，酱香浓郁，脆嫩鲜甜，咸度适口，带桂花香味。产品质量稳定，很受欢迎。
锦江烤鸭
锦江烤鸭是上海锦江饭店在北京烤鸭的基础上，经过多年的潜心研究，摸索精制而成。历史虽然不久，但由于对传统做法进行了大胆改革，同时重新研制了佐料甜面酱的配方，使得吃起来风味更为佳美，受到了各界的赞扬。
毛豆子炒酱瓜
毛豆子炒酱瓜是以酱瓜为主要原料制作的菜品。
油氽排骨年糕
油氽排骨年糕是一种上海地区传统小吃。猪大排佐以小而薄的年糕，经油氽、烧煮而成。排骨肥嫩香鲜，味浓厚，年糕鲜润不腻，经排骨油氽制，具有排骨香味。鲜得来排骨年糕总店制作的此品，1997年被认定为《中华名小吃》。
条头糕薄荷糕
条头糕薄荷糕是传统糕类美食，甜、凉爽口，夏季吃颇为下火。条头糕，又软又凝，甜度适中。
熏拉丝
熏拉丝是上海市传统的地方小吃，这种名为熏拉丝的熟食，色泽金黄、肉质细嫩、口感独特、味道鲜美。熏拉丝也是郊区方言的个词汇，指把一种动物熏干腌渍后的熟食。在上海金山枫泾、青浦练塘、朱家角等郊



*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const shangHaiFoodsList = [
  // 灯影牛肉
  {
    province: '上海市', // 省
    city: '上海市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shanghaiCuisine', // 菜系编码
    cuisineCategoryName: '上海菜、沪菜、本帮菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '上海市', // 省
    city: '上海市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shanghaiCuisine', // 菜系编码
    cuisineCategoryName: '上海菜、沪菜、本帮菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
