/**
 * 湖南-长沙市-特产美食
 * 
 * 长沙美食小吃
长沙臭豆腐,口味虾,糖油粑粑,葱油粑粑,辣椒炒肉,长沙米粉,剁椒鱼头,麻仁香酥鸭,猪油拌粉,德园包子,麻辣子鸡,长沙汤面,绉纱馄饨,刮凉粉,冰糖湘莲,金柑桔饼,双味素翅,豆豉剁辣椒,金鱼戏莲,长沙米粉,德园包子,菁华铺土鸡,酸辣凤翅,嗍螺,宁乡口味蛇,焦盐肘子,排冬菜,长沙臭豆腐,小炒黑山羊,发丝百叶,浏阳蒸菜,糖油粑粑,火宫殿臭豆腐,浏阳豆豉,砂仁糕,乘火麒麟,干窝带皮蛇,靖港香干,杨裕兴面条,麻辣子鸡,茴饼,绉纱馄饨,口味虾,玉米青豆羹,开屏柴把桂鱼,椒盐馓子,长沙糕点,和记米粉,牛中三杰,湘江鱼头王,湘宾春卷,湘都酱板鸭,笋丝百叶,糖熘土豆丸,花菇无黄蛋,


 * 
 * 
 * 
长沙美食小吃
长沙臭豆腐
口味虾
糖油粑粑
葱油粑粑
辣椒炒肉
长沙米粉
剁椒鱼头
麻仁香酥鸭
猪油拌粉
德园包子
麻辣子鸡
长沙汤面
绉纱馄饨
刮凉粉
冰糖湘莲
金柑桔饼
金钱桔饼又名金桔花，属蜜饯类，是湖南浏阳的当地传统名点之一。略呈桔子本色，糖液呈白色。饼质滋润，质酥化渣，具有固有的金桔芳香。无异味。金钱桔饼气味芬芳可口，基本上保持了鲜金桔的原有成分。是一种药用价值较高的保健食品，行销全国和港澳市场。
双味素翅
双味素翅是一道湖南长沙市的传统名菜，属于湘菜系。小菜苞洗净。葱切段。姜切片。将水发金针每10根捆成一把，共40把，用木梳逐把梳成细丝。玉兰片先片成片，再在离片左端1．5厘米处下刀切成细丝，共40片。小菜苞下锅煸炒入味。炒锅放入花生油，烧至三成热时，放入金针过油，取出，再放入垫有竹箅的蒸锅，加入鸡清汤、精盐、味精、胡椒粉上笼蒸约15分钟，取出，摆在盘子一端，勾薄芡盖在上面。将玉翅用鸡清汤、葱段、姜片、精盐、味精焊水入味后捞出，投入五成热的油锅过油，倒入漏勺沥油。锅内加辣椒油、蒜汁、鸡清汤、精盐、味精，稍焖一下，再勾薄英，淋香油，出锅，装放在盘子的另一端。最后将菜苞摆放在玉翅、金针中间即成。
豆豉剁辣椒
豆豉剁辣椒是湖南浏阳传统的地方名菜，属于湘菜系。采用本地小红辣椒与优质豆豉为主要原料，制作而成，在湖南省内素负盛名。 原料配方：红剁辣椒94公斤豆豉5公斤味精300克麻油500克棕檬酸300克糖精10克 制作方法：将15度盐水倒入豆豉内，搅拌均匀，待盐水全部被豆豉吸收后放置备用。再按比例将辅助料全部放入剁辣内搅拌均匀，装坛，密封即成。 注意事项：用后应及时盖好，及防霉变，存放久了，由于豆豉液的渗透，色泽有所变化，但对质量与滋味没有影响。
金鱼戏莲
金鱼戏莲，是湖南长沙特色传统名菜，属于湘菜系。
长沙米粉
长沙米粉是湖南省长沙市的一种传统美食，属于湘菜系；该菜品是长沙市民最爱的食品之一 。该菜品以米粉，肉丝，盐，味精，酱油，猪骨汤，葱花，熟猪油等制作而成。
德园包子
德园包子是湖南长沙地区的传统小吃之一。选料精细，糖馅香甜爽口，肉馅则选用猪前夹缝肉或好瘦肉，拌以香菇、笋干、葱姜、冻油等调料，油而不腻。德园的掌案师傅历来都是技术高超的老师傅，老面发酵，绝不添加使用“泡打粉”，所制包点皮薄馅大、面香浓郁、颜色白净、质地松软、面呈海绵状富有回弹性，口感特有嚼劲。德园以外形4个小孔的“四眼大包”为代表独具特色，德园包点中的“银丝卷”亦是湘点中的代表之作。
菁华铺土鸡
菁华铺土鸡是湖南宁乡特色传统名菜，属于湘菜系。此菜鸡肉酥烂、酸辣味美。以土鸡，食用油，木耳，小米椒，姜，大葱等制作而成。湖南宁乡特产，菁华铺土鸡。
酸辣凤翅
酸辣凤翅是一道湖南长沙市的传统名菜，属于湘菜系。先将鸡翅过水，之后放鸡翅、醋、盐、酱油等调料于瓦钵中，大火煮滚后改小火煨。准备鲜红椒、香菇、酸泡菜等切成米粒状，后加入酱油、盐煸炒，再加入鸡翅和原汤，最后用生粉勾芡，淋如香油后即可出锅。
嗍螺
嗍螺，顾名思义，就是用来嗍着吃的田螺，是一道独具特色的传统风味美食。流行于湖南、江西、广东、福建、广西等地。作为一种独特美食，嗍螺近年来有向全国流传趋势，越来越多的人喜欢上这道考验技巧与肺活量的美食。嗍螺的“嗍”字，本作欶，或作嗽。被民间多误写为“嗦”，即被写成嗦螺。
宁乡口味蛇
宁乡口味蛇是一道以菜花蛇肉为主要食材制作的地方特色湘菜。
焦盐肘子
焦盐肘子是一道湖南长沙市的传统名菜，属于湘菜系。酒席上传统大菜，制做十分讲究。其程序是先用卤锅烹制，将锅中的卤汁淋在肘子上如笼蒸熟后切成肉块，再行挂糊和焦炸，最后撒上葱花淋入芝麻油即成。
排冬菜
排冬菜是用鲜排菜（又名芥菜、鲜雪里蕻）在冬季采收加工而得名。随着湖南人民爱食汤菜的历史习惯，未被破坏叶绿素、呈青绿红、味道新鲜的排冬菜亦应运而生。它可作早餐的豆腐脑汤，馄饨店不可缺少的佐料，也有用作蒸肉的辅料，还由于它具人体特需的营养成分，超过脱水叶类菜，因而长年缺少蔬菜的山地矿区，亦把它视为珍品。该品种是湖南长沙地方传统名菜。
长沙臭豆腐
长沙臭豆腐是湖南省长沙市的一道传统特色小吃，属于湘菜。长沙臭豆腐以臭豆腐等食材用料烹制，其色墨黑，外焦里嫩，鲜而香辣， 焦脆而不糊、细嫩而不腻、初闻臭气扑鼻，细嗅浓香诱人。2021年6月，火宫殿臭豆腐制作技艺入选国家级非遗名录。
小炒黑山羊
小炒黑山羊是湖南长沙传统的特色名菜，属于湘菜系。将羊肉切成薄片，放盐、味精、料酒、嫩肉粉、水淀粉上浆，入味后下入八成热油锅至熟，倒入漏勺沥净油。 锅内留少许底油，下入姜米、蒜蓉、红尖椒圈拌炒，放盐、味精、辣酱、辣酱、用生抽炒匀，然后下入羊肉一起合炒，入味后勾水淀粉，淋红油、香油，出锅装入垫有香菜的盘中。
发丝百叶
发丝百叶又名发丝牛百叶，始创于19世纪20年代，是一道湖南名菜。发丝百叶以牛百叶切丝急火爆炒而成。成菜后，色泽白净，形如发丝，质地脆嫩，集咸、鲜、辣、酸于一体。发丝牛百叶是湖南的传统名菜，色泽白净，形如发丝，质地脆嫩，综合了咸、鲜、辣、酸各种味道，口感极为丰富。2018年9月10日，“中国菜”正式发布，“发丝牛百叶“被评为“中国菜”湖南十大经典名菜。
浏阳蒸菜
浏阳蒸菜是一道湖南的传统名吃，属于湘菜。相传起源于明朝，历经500多年发展。浏阳蒸菜诞生于明朝，由迁徒至浏阳河发源地大围山的客家人始创，是一种极具地域特色的风味菜系，荣获“中国地理标志集体商标”。
糖油粑粑
糖油粑粑，是湖南省长沙市的一道传统名吃，属于湘菜，其成本便宜，主要原料是糯米粉和糖，但其制造工艺精细讲究，有特殊的制造过程，虽不能登大雅之堂，更不能与山珍海味、鱼翅熊掌相媲美，但正是因其廉价的身份，能出入平常百姓家，受到民众的厚爱，成为民间常吃不厌的小吃。在长沙，不管人的俊美丑恶、身份地位，也不管男女老少，凡是热爱生活、懂得享受吃的乐趣之人，都有吃糖油粑粑的美妙感受，都对那三毛钱一个的糖油粑粑有特殊感情。早上三个糖油粑粑下肚，可饱一天精神，充沛体力，下午三个糖油粑粑打牙祭，提神饱肚，精神旺盛，糖油粑粑的滋味和作用在长沙人眼里都是奇妙无穷的。
火宫殿臭豆腐
火宫殿臭豆腐是湖南省长沙市的一道传统名小吃，该菜品属于湘菜系；此菜用黄豆为原料的水豆腐，经过专用卤水浸泡半月，再以茶油经文火炸焦，佐以麻油，辣酱。它具有"黑如墨，香如醇，嫩如酥，软如绒"的特点，奇在以臭命名，不同于其它食卤以香自翊。闻起来臭，吃起来香，外焦微脆，内软味鲜。这是因为卤水中放有鲜冬笋、浏阳豆豉、香菇、上等白酒等多种上乘原料，故味道特别鲜香。
浏阳豆豉
浏阳豆豉生产历史悠久。是浏阳县的地方土特产。浏阳豆豉以泥豆和小黑豆为原料，经精加工而成。成品豆豉呈黑褐色或酱红色，皮皱肉干，质地柔软，颗粒饱满。加水泡胀后，汁浓味鲜，是烹饪菜肴的调味佳品。豆豉还具有一定的药用功能，可疏风解表。
砂仁糕
砂仁糕是宁乡县的传统糕类美食，以其酥砂香甜，柔软松口而得名，为湖南四大名糕（包括灯芯糕、麻香糕、烘糕）之一，在省内外享有盛名。据传已有200多年的生产历史。民国时期，宁乡城关有义沅、隆和、杨同春、德兴斋等20多家南货食品作坊生产经营砂仁糕，产品色、香、味俱佳，远销全国10多个省市，倍受各界人士推崇。砂仁糕主要选用优质籼稻米，将其洗净、滤干、炒熟成金黄色，粉解成细粉，装布袋贮存6个月以上待用。将白砂糖碾成粉，与炒米粉混合，加进适量茶油、清水搅匀，进炉烘烤，包装即成。成品的砂仁糕呈长方形，四角周正，厚薄一致。底面呈谷黄色，有独特的黄米粉芳香，滋味酥松香甜，回味悠长。
乘火麒麟
乘火麒麟是湖南长沙传统的名菜，属于湘菜系。由传统湘菜糖醋脆皮鱼发展创新而成，它以3斤左右的鳜鱼或鲤鱼为原料，加工成糖醋脆皮鱼，在加工时注意体形，使之象麒麟，置之盆中，浇以烧酒，上席时点燃，鱼周发出蓝色火焰，宛如麒麟喷火，四座皆惊，象征吉祥如意。此菜构思精巧，造型奇特，而且昧鲜色美，酸辣甜脆，常为接待贵宾的压席菜。
干窝带皮蛇
干窝带皮蛇是一道以辣酱、大料、香叶、青红尖椒、蛇等为主要食材制作的湘菜。
靖港香干
靖港香干是一道湖南省的地方传统小吃。
杨裕兴面条
杨裕兴面条是湖南长沙一带的地方传统名小吃，属于湘菜系。“杨裕兴”的金字招牌手工鸡蛋面做法：每袋面（22．5公斤）用鸡蛋2．5公斤、纯碱200克至250克（热增冷减）、水3公斤（冷增热减）拌和均匀，揉成大砣，竹杠压平，每压一次，遍撒菇粉，折叠复压，反复十来次，最后压成布匹状，滚筒切丝即成。 此面有口皆碑，常喻为“神仙难吃刀下面”。
麻辣子鸡
麻辣子鸡始创于清朝同治年间，是具有浓厚地方风味的湘菜名肴之一。
茴饼
茴饼是湖南省浏阳地区著名的汉族小吃，松脆酥香，表面起酥、内馅丰满有茴香独特风味，相传已有三千年的产销历史，久负盛名。它与浏阳花炮、夏布、菊花石、豆豉一起构成浏阳五大土特产。
绉纱馄饨
皱纱馄饨，出自湖南省长沙市南门口的"双燕"馄饨店。它采用富强粉为原料，精工擀成的皮，薄如纸，软如缎，吃有韧劲。馅心选用新鲜猪腿瘦肉，配以适量肥肉，绞成肉泥，再加一定比例的清水、食盐、味精等，使劲搅拌肉至泥，吃透水份。这样制作的馅心酥而不烂，嫩而泡松。包好的馄饨，一经煮熟，外皮起皱，紧裹馅心。因皮薄似轻纱，故有皱纱馄饨之称。其汤选用高汤，配以排冬菜，味道鲜美。
口味虾
口味虾，又名麻辣小龙虾、长沙口味虾、香辣小龙虾等，是湖南省的一道传统名菜，属于湘菜系，该菜品以小龙虾制成，口味麻辣鲜香，色泽红亮，质地滑嫩，滋味香辣。20世纪末开始传遍全国，成为人们夏夜街边啤酒摊的经典小吃。主料所用龙虾原产自北美洲，1918年由美国引入日本，1929年再由日本引入中国，生长在中国南方的河湖池沼中。
玉米青豆羹
玉米青豆羹是湖南长沙一带的传统名点，属于湘菜系。家常又营养的玉米青豆羮对治疗食欲不振、水肿、尿道感染、糖尿病、胆结石等症有一定的作用。也是一道老少皆宜的美味。
开屏柴把桂鱼
开屏柴把桂鱼是一道湖南长沙市的特色传统名菜，属于湘菜系。由传统菜“柴把鸡”、“柴把鸭”演化而来。看上去似孔雀开屏冷盘，实际上是热菜，整个形状完全突破了热菜不能拼摆的局限，采用象形拼盘制法，以各种不同性质、不同制法、不同形状的成品拼成，造型逼真，栩栩如生。开屏柴把桂鱼颜色多样、花而不乱。有鱼肉的鲜嫩，火腿的咸香，鹑蛋的清嫩，香菇的清香，冬笋的脆嫩，味感丰富，鲜嫩适口。此菜系长沙市百年老店玉楼东酒家特一级烹调师许菊云的创新菜，曾在第二届全国烹饪技术比赛中荣获金牌奖。
椒盐馓子
椒盐馓子，流行于中国湖南省长沙市，是一道传统小吃，其丝条粗细均匀、质地焦脆酥化、口味有甜有咸，老少皆宜，其造型新颖别致，既可当点心，亦可菜食。
长沙糕点
长沙糕点是湖南长沙地区的传统名点，主要有长沙年糕，长沙奶糕等多种糕点。长沙生产糕点的历史悠久，有文字记载的就有几百年，而且品种繁多，“湘”味殊浓，现略举一二如下。
和记米粉
和记米粉是湖南长沙一带的传统小吃，属于湘菜系。手工制成，洁白柔软，粗细均匀，盖码选料严格，充分煨后，肉质鲜美，汤汁浓郁，尤以牛肉米粉，滋味最佳。创始于20年代初。李氏兄弟制作汤粉方法独特，以质取胜。其兄李益和专管进货，其弟李福生专门操持制粉、煨码。煮粉时保持水宽火旺，粉条既洁白柔软，又有拉力，色香俱佳，令食者赞不绝口，一些达官贵人，小姐阔太，也成了这里的常客。
牛中三杰
长沙市三兴街的“李合盛餐馆”主厨黄维安按照清真的特点，用湘菜的技法，取牛三种不同部位的原材料，分别采取炒、烧、烩烹调方法，首创名菜发丝牛百叶、红烧牛蹄筋、烩牛脑髓，被誉为“牛中三杰”，使李合盛的清真菜独树一帜，食客如潮。发丝牛百叶以牛肚内壁黑色皱裂部分为料，去黑为白，切细如发丝，加玉兰片丝、红椒丝、米醋一炒，酸辣咸鲜脆。红烧牛蹄筋以牛蹄筋为料，置于垫有竹篾折的大瓦钵中，加姜、葱、桂皮、绍酒、清水，大火烧开，小火慢煨至蹄筋软烂，再下锅煸炒调味，软糯鲜香。烩牛脑髓取牛脑髓清洗后去表膜切片，入沸水中一焯，待变白色捞出沥去水，下入煸香的姜、香菇中，加黄醋、牛清汤一烩，收汁，撒胡椒粉、葱花，淋入芝麻油即成，鲜嫩清香。
湘江鱼头王
湘江鱼头王是湖南长沙一带的传统名菜，属于湘菜系。湖南把剁椒鱼头叫做鱼头王，鱼头滋味浓香扑鼻，极其诱人。将鱼头一劈为二，但又不劈断，是藕断丝连的那种。鱼头蒸熟了，卧在盆底，浇上各种佐料，成份最多的自然是剁碎了的辣椒。红的是碎椒，绿的是葱末，白的是鱼肉，从色与形上已是相当的诱人了。味当然以辣为主，肉质以嫩至恰到好处为最佳。
湘宾春卷
湘宾春卷，是湖南长沙地区特色传统小吃。其特点是香脆、绵软、多汁、鲜嫩。馅料可根据食客的口味更换。
湘都酱板鸭
湘都酱板鸭就是酱香酱板鸭，是湖南省湘都食品有限公司在传承清朝御厨秘方的基础上，吸收板鸭、烤鸭、酱鸭的制作工艺之精华，经烤、卤、酱等制作而成；湘都酱香酱板鸭最先面市，堪称酱板鸭的鼻祖，其后市场上陆续推出了香辣酱板鸭、麻辣酱板鸭、常德酱板鸭等多个产品和系列。在2012年11月19日湖南省质监局公布的质量抽检结果中，湘都酱板鸭中的致癌物质无机砷超标3.5倍。产品仍在市场出售，消费者对于无机砷超标事件并不知情。
笋丝百叶
是湖南长沙一带的传统名菜，属于湘菜系。将牛百叶放入清水中煮滚，捞出滤干水，切丝。冬笋切成细丝。韭黄切成3厘米长段。红辣椒切细丝，烧热锅，下油，烧至六成熟时，放入冬笋和牛百叶煸炒出香味，加入料酒，放入红椒丝、盐、味精和韭黄炒匀，再加上汤，用生粉水勾芡，下醋、香油翻炒片刻即可。
糖熘土豆丸
糖熘土豆丸是一道湖南长沙市的传统名菜，属于湘菜系。将土豆洗净，入笼蒸熟取出，去粗皮放在砧板上用刀压成茸，将鸡蛋加面粉和豆茸一起揉匀，搓成2厘米直径的丸子。将红枣煮烂(或蒸烂)，去皮、去核，加白糖25克、玫瑰糖少许，用适量油下锅炒成枣泥，用手将土豆丸捏成圆形的窝，逐个灌入枣泥，再搓成圆形备用。烧热锅，下油，烧至六成熟，将土豆丸入锅炸至呈金黄色倒入漏勺滤干油，再将所剩的白糖、玫瑰糖及适量冷水入锅炒成糖汁，倒入土豆丸炒匀即可。
花菇无黄蛋
花菇无黄蛋，是湖南长沙特色传统名菜，属于湘菜系。30年代曲园酒家以擅作此菜闻名，当时的《长沙指南》在介绍的几道名菜中，就有花菇无黄蛋。此菜早在本世纪30年代即闻名遐迩。把生鸡蛋的下端敲
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const changshaFoodsList = [
  // 灯影牛肉
  {
    province: '湖南省', // 省
    city: '长沙市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'hunanCuisine', // 菜系编码
    cuisineCategoryName: '湘菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '湖南省', // 省
    city: '长沙市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'hunanCuisine', // 菜系编码
    cuisineCategoryName: '湘菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
