/**
 * 四川-绵阳市-特产美食-灯影牛肉-自媒体脚本
 */
// 	拍摄手法				画面表达			后期剪辑				备注
// 序号	拍摄角度	景别	运镜	镜头	拍摄场景	画面内容	台词/文案	字幕	音乐	音效	时长
// 1	平拍	全景			厨房	人走向镜头，打开冰箱，看看还有什么食材	周末啦，今天好好犒劳一下自己，想吃部队火锅了	部队火锅	欢快		5s	景别有5种：远景、全景、近景、中景、特写
// 2	俯拍	中景			卧室	拖鞋出门	先去超市买点食材	食材准备			6s	拍摄角度有4种：平拍、俯拍、仰拍、侧拍
// 3	平拍	全景			超市	展现超市货架上的东西，一次根据自己喜欢的食材和固定时长进行选购，放入购物车	提前列好清单	韩式辣酱			7s	一个镜头时长在3~10s，视频时长在2~6分
// 4	俯拍	特写				拿着一袋年糕	我喜欢吃年糕多买点	自己做就是食材自由			8s	运镜：推、拉、摇、移、跟
// 5	平拍	中景			客厅	开门回家，手上满满一大袋食材	满载而归	9:30			9s	拍摄角度：平面角度（正面、侧面、背面）、垂直角度（俯拍、平拍、仰拍）
// 6	俯拍	近景			厨房	把菜清洗干净	先把食材准备好	食材准备中			10s	镜头：变焦24-70、70-200；定焦：35、55、85
// 7	俯拍	近景				把锅端过来	开始铺食材啦	美食制作中			11s
// 8	俯拍	近景				依次按照顺序进行把食材摆放好	我认为做美食是一件让人幸福的事情	很享受这个过程			12s
// 9	平拍	特写				摆好以后就打开电源开关	接下来就是等待啦	等待~			13s
// 10	平拍	中景			客厅	从热水机处冲一杯咖啡	可能有人觉得过于麻烦	期待			14s
// 11	俯拍	特写				细细品味	但是美食给人带来的惊喜	让心情安静
// 12	平拍	全景			厨房	展示远处桌子上的锅	感觉香味溢出来了	咕噜咕噜
// 13	俯拍	特写				打开盖子，拍摄美食画面	好香	好看
// 14	平拍	近景			饭桌	把制作好的火锅和饮品摆在桌面上	方法超级简单快乐	新手好操作
// 15	俯拍	特写				围绕着美食转圈	大家速速get起来吧	速速学习
export const lampshadedBeefScriptsList = [
  {
    shootingAngle: '平拍', // 拍摄角度
    scenery: '全景', // 景别
    camera: '', // 运镜
    shots: '', // 镜头
    shootingScene: '厨房', //  拍摄场景
    content: '人走向镜头，打开冰箱，看看还有什么食材', // 画面内容
    linesOrText: '周末啦，今天好好犒劳一下自己，想吃部队火锅了', // 台词/文案
    subtitles: '部队火锅', // 字幕
    music: '欢快', // 音乐
    soundEffects: '', // 音效
    duration: '5S', // 时长
  },
];
