/**
 * 甘肃-天水市-特产美食
肉夹馍
肉夹馍是中国传统特色食物之一。名字意为“肉馅的夹馍”。陕西地区有使用白吉馍的“腊汁肉夹馍”、宝鸡西府的肉臊子夹馍（肉臊子中放食醋）、潼关的潼关肉夹馍（与白吉馍不同，其馍外观焦黄，条纹清晰，内部呈层状，饼体发胀，皮酥里嫩，火功到家，食用时温度以烫手为佳，且老潼关肉夹馍是热馍夹凉肉，馍酥肉香，爽而不腻）。
秦安麻腐馍
以五香粉为主料制作的菜品
天水浆水面
天水浆水面又称酸菜饭，是甘肃天水的一种传统面食小吃，在天水广大地区，特别是农村一带的家常饭。它是用发酵的酸菜炝炒做卤而制成的面条。一般上好的酸菜用一种叫“苦苣”的野菜淹制，味酸，能生津止渴，清热祛暑。
天水呱呱
天水呱呱是一种甘肃天水的传统风味小吃，被誉为“秦州第一美食”。最早产生于西汉时期，是用当地特产的一种被称作荞麦的淀粉制作的。以香、辣、绵、软着称。
天水麻食
麻食是一种面制品，先用大拇指把面搓卷成核形中间空心的面卷，再和炒菜一块制做而成。它的主辅料相融，筋韧爽滑，乡土气息浓郁。制作麻食十分简便，对配料没有严 格要求，可精可粗，可荤可素，普通家庭常以此调剂饮食花样。
秦安甜醅
秦安甜醅是一种美味香甜、酒味甘醇的传统小吃，属于甜食。是将优质冰糖色白小麦在石碾上舂皮后，淘净煮熟、晾干，在不同的季节，掌握一定的温度，用名酒曲配合发酵约36小时后即可食用。发酵工艺以曲子为主，关键在于掌握温度，发酵时所反应生成的甜醅酒，可谓稀罕之物，不仅味道特美，而且营养价值极高。在炎热夏季，农村的群众习惯于将发酵好的甜醅加水烧开，再放入中草药，如甘草，置阴凉处降温，每当收割、扶犁归来喝上一大碗清凉香甜的甜醅汤，不仅可以消除疲劳，还有活血健胃、止渴解暑之功效。
天水酿皮
酿皮是天水市著名的地方风味小吃，天水各县区的每条街巷都有卖酿皮子的小馆、小摊，还有推车挑担、串户叫卖的。这种凉吃的食品，在夏秋炎热天里，最受人们欢迎，食用者非常普遍。
天水杂烩
天水杂烩是，属于一道特色菜。把鸡蛋清和蛋黄搅匀，摊成薄饼。取鲜五花肉剁碎，放入盐、粉面、花椒后拌匀，加在两层薄蛋饼中间压平，上笼蒸熟，切成条形，便做成夹板肉。以夹板肉为主，配以响皮条、丸子
甘谷酥圈圈
酥圈圈是甘肃甘谷县的一道传统小吃。以精细白面为主料，用上等胡麻油配以各味香料，精工制作而成。其制作方法是将面粉发酵，添加碱水去酸，和以胡麻油，配上鸡蛋，椒末，姜末，桂皮，精盐等佐料，经过精揉细搓后，掐成剂子，并拉条，再揉成大小粗细均匀的环状，形如微缩的救生圈，故又名“曲连”。然后将姜黄、麻油等配置好的糊状物抹在面圈上，置于上下都有炭火的鏊中双面烘烤而成，具有耐存耐放之长处，即使在炎夏，存放月余也是光干不馊，常被人们购捎给省内外的亲朋好友。酥圈圈烤成出锅时，香气扑鼻，诱人垂涎，往往不待热气散尽，就被抢购一空。据传酥圈圈是满清时由甘谷城关蒋家独庄一姓李的厨师创制成的。如今第五代传人正在继承先祖遗业，服务于民众。
秦安油糕
秦安油糕是一道菜品，主料是小麦面粉等，配料是芝麻等。
清真碎面
《清真碎面》是一道中国民间传统家庭美食，由碎面烹饪而成。
甘谷浆水面
浆水面是一道非常古老的传统面食小吃。在甘谷也叫酸饭。
天水面皮
天水面皮具有面皮普遍的特点而又自成风格，与宝鸡、西安等地的面皮稍有不同。 天水面皮是天水市著名的地方风味小吃，天水各县区的每条街巷都有卖酿皮子的小馆、小摊，还有推车挑担、串户叫卖的。这种凉吃的食品，在夏秋炎热天里，最受人们欢迎，食用者非常普遍。
天水凉粉
天水凉粉，是甘肃省天水市的传统特色小吃，其品种繁多，风味各异，制作考究，佐料独特。用荞麦制成的凉粉柔软滑爽，用豌豆制作的凉粉晶莹透亮，还有用扁豆、粉面等制作的凉粉。

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const tianshuiFoodsList = [
  // 灯影牛肉
  {
    province: '甘肃省', // 省
    city: '天水市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'northwesternCuisine', // 菜系编码
    cuisineCategoryName: '西北菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '甘肃省', // 省
    city: '天水市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'northwesternCuisine', // 菜系编码
    cuisineCategoryName: '西北菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
