/**
 * 江西-抚州市-特产美食
 * 
 * 
粉皮,红烧牛肚皮,临川藕丝,葵花莲子,汝水养生飞天凤,焦头笋,南丰鱼丝,建昌香蒸肉,崇香焖鸡,龙须豆腐,抚州泡粉,临赣菜梗,麻姑米粉,浒湾油面,资溪酒卤鸡,灌芯糖,藕丝糖,冻米肉丸,红妹子豆腐乳,黎川芋糍,金溪油面,临川牛杂,汤翁锅贴饺,霉豆腐饼,盐煨华绿宝贝蛋,南丰水粉,资溪面包,羹团子,晏殊饼,乐安驴肉,金溪藕丝糖,金溪米粉,红妹子豆腐乳,南丰鱼丝,麻姑米粉,荷花广莲,资溪面包,炒麦鸡,浒湾油面,南丰腌菜,临川藕丝,芋糍,乐安霉鱼,资溪酒卤鸡,冻米肉丸,黎川米

 * 
 * 

乐安驴肉
一种乐安特色菜肴，以纯真健壮的毛驴，采用百年老汤新水，配以芳香天然佐料20余种卤制而成，食之具有壮心、补脑、健胃、强身壮骨之效，可增进智力，延缓衰老，素有“百肴之长”之称。
金溪藕丝糖
藕丝糖是江西金溪县传统名点之一。它的外形好似一团洁白无瑕的藕丝，素以甜、脆、香酥而称著。但甜而不腻，脆而不碎，外形美观、落口消融。民间流传着一首歌谣说：“浒湾油面进汴梁，方河米粉去湖广，黄通冬笋满省跑，四海闻名藕丝糖。”金溪四大特产而以藕丝糖名列前茅，可以看出它在人们心目中的位置。
金溪米粉
金溪米粉是江西省抚州市金溪县传统的名吃。
红妹子豆腐乳
红妹子豆腐乳是江西省抚州市特产之一，属于抚州豆腐乳特产里面品牌名称。 红遍大江南北“红妹子”豆腐乳产于山川秀丽的江西省抚州市宜黄县黄陂古镇，这是一种虽然名不见经传，植根于红色故土，却情系革命历史的家常小菜，以其“鲜、辣、香、嫩、红……品位与众不同”的特色，享誉省内外，取得了很好的社会、经济、生态效益。
南丰鱼丝
南丰鱼丝，质地嫩滑，清鲜爽口，是抚州南丰传统的名菜。最早是我县毗邻广昌县的菠萝乡一带家用菜肴，传入南丰县城已有几百年的历史。
麻姑米粉
麻姑米粉产于道教名山-江西麻姑山下的南城，相传麻姑仙女修炼成仙后，用麻姑米制成晶莹透亮的银丝米粉赠送给王母娘娘的拜寿贺礼，由此麻姑米粉天下闻名，历代皆为贡品·。
荷花广莲
荷花广莲是江西抚州广昌县流传八百多年的传统名菜。
资溪面包
资溪面包起源于80年代后期，1987年冬由2个退伍军人 张协旺和洪涛率先在鹰潭开办了资溪人的第一家面包店。
炒麦鸡
炒麦鸡是一道是江西临川市名菜。此菜制法独特，麦鸡酥香，豆腐鲜嫩，冷热适中，别具风味。
浒湾油面
浒湾油面为江西省金溪县传统名牌产品，又称龙须贡面、挂面、须面、龙凤见喜、福禄喜面、寿面等。它具有爽滑、细腻、烹调不糊、口感不粘，易于消化等特点，并具有键脾胃、降血压、祛风寒、催母乳等功效，是老、弱、病人、孕妇、婴儿的理想食品。2010年，江西省政府正式公布了全省第三批省级非物质文化遗产名录，金溪浒湾油面制作技艺成功入选。
南丰腌菜
南丰腌菜又称“傩菜”，系卷心芥菜经传统工艺腌制加工而成。是南丰农家栽种、加工历史较长的又一地方特色农产品。
临川藕丝
临川藕丝，赣菜特色菜，主要食材有上好塘藕、银鱼等。临川藕丝是抚州的地方特色名菜，近来尤受市民的青睐，其刀工精细，制作特殊，藕质粘滑，入口香脆。
芋糍
芋糍是江西省抚州市黎川县的特色小吃之一。
乐安霉鱼
乐安霉鱼，又称“状元鱼”，相传是南宋高宗赐名，属乐安本土的传统风味名吃。用碗装霉鱼块，加上葱或蒜花和味精，并可加入少许香油，煎或蒸熟即可食用。
资溪酒卤鸡
酒卤鸡是江西资溪县具有浓厚地方特色的风味小吃。它不用五香调料或其它中药香料，而是采用几种江西名酒为卤汁，用高压锅高温卤制，再经热油炸酥，切配装盘后，浇、蘸上特制的复合型味汁，烹制时，很远就能嗅到浓郁的混合酒香味。成品鸡皮呈金红色，皮脆、肉香、骨酥，食时蘸上味汁，满口生香，回味悠长，这种卤鸡的保鲜期也较五香卤鸡长。
冻米肉丸
冻米肉丸，是江西临川县的传统名菜，既是小吃又是佐餐下酒的佳肴。为粉蒸食品，冻米松软。肉丸鲜嫩，沾白间红，十分美观。有调理贫血、补虚养身和调理滋阴之功效。
黎川米糖
黎川米糖是江西省的传统名点。素以银白如雪，皮薄如纸，香甜酥脆，落口消融而著称。
十大名菜
甲鱼粉皮、红烧牛肚皮、临川藕丝、葵花莲子、汝水养生飞天凤、焦头笋、南丰鱼丝、建昌香蒸肉、崇香焖鸡、龙须豆腐
地方小吃
抚州泡粉、临赣菜梗、麻姑米粉、浒湾油面、资溪酒卤鸡、灌芯糖、藕丝糖、冻米肉丸、红妹子豆腐乳
“十大名小吃”：黎川芋糍、金溪油面、临川牛杂、汤翁锅贴饺、霉豆腐饼、盐煨华绿宝贝蛋、南丰水粉、资溪面包、羹团子、晏殊饼
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const fuzhouFoodsList = [
  // 灯影牛肉
  {
    province: '江西省', // 省
    city: '抚州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangxiCuisine', // 菜系编码
    cuisineCategoryName: '赣菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '江西省', // 省
    city: '抚州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangxiCuisine', // 菜系编码
    cuisineCategoryName: '赣菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
