/**
 * 江西-景德镇市-特产美食
 * 
 * 
 * 苦槠豆腐
清明粑
炒米粉
冷粉
煎饼
碱水粑
乐平黄豆豉
瓷泥煨鸡
冷粉
塔前糊汤
桃酥
饺子粑
乐平白切狗肉
桂花鲜姜酱菜

 * 
 * 
 * 
 * 
苦槠豆腐
是瑶里高山上苦槠子为原料制作，另外有苦槠粉丝、苦槠粉皮、橡子豆腐、橡子粉丝、橡子粉皮、葛粉条等。
清明粑
清明节的时候，景德镇的人们也会做这种粑，这时候人们称它为清明粑，是清明节的必吃的东西之一。将青艾、草汁揉入糯米粉中，做成呈碧绿色的团子，馅甜咸均可。咸的是包猪肉末、榨菜末、鲜笋末，甜的一般包芝麻。
炒米粉
景德镇人会把粉拿来炒，和凉拌的粉不同，它是排粉。吃的时候要细嚼慢咽，因为米粉韧性很高，久炒不碎、韧而不硬。
冷粉
冷粉又叫凉拌的粉，制作时将米粉放在锅里煮开，捞起加以葱姜蒜辣椒等调料拌匀，还有香料、芝麻油等。
煎饼
景德镇的煎饼不同于山东煎饼。它的形状跟荆州的水煎包差不多，皮更薄。里面的料有三种，韭菜豆干馅，辣椒包菜馅和虾仁萝卜丝馅。跟饺子粑的料很像。
碱水粑
碱水粑，是景德镇特有的地方小吃，制法简单，可久储不坏。它以大米磨浆，掺以碱水，用特制粑筛猛火蒸熟，厚约10厘米。食用时切成薄片，以本地烟薰腊肉、大蒜等炒食。
乐平黄豆豉
乐平黄豆豉，采用民间古老配方和传统工艺精制而成。不含任何人工色素、添加剂和防腐剂，为天然绿色食品。味道鲜美、香辣开胃；是餐桌、酒席上不可缺少的冷菜佳肴，也是走亲访友最受欢迎的礼物。
瓷泥煨鸡
瓷泥煨鸡是江西省景德镇市的一道经典地方小吃，属于赣菜系；该菜品鸡身完整，鸡肉鲜嫩，酥烂离骨，浓香扑鼻，食不嵌齿。相传清代时，景德镇的瓷工喜将嫩鸡去毛、破腹后，在鸡腹内填满猪肉末及生姜、葱花、麻油、食盐之类的佐料，用荷叶包扎好，然后将绍兴老酒淋入瓷泥中，拌匀后，用含酒的瓷泥将嫩鸡及荷叶团团裹住，再将鸡埋入刚开窑的热窑内的塾渣中，煨烤十个钟头左右，便 可取出。剥去瓷泥与荷 叶，即可食用。
冷粉
冷粉是江西省景德镇市的一种传统特色小吃。冷粉虽然很多地方都有，但是景德镇用的冷粉不一样。粉条比较粗，大概直径有0.5厘米左右（相当于普通筷子的粗细）。其制作简单，风味独特，物美价廉，备受当地人的喜爱。出趟远门，或者在外工作，亦或在外求学的本地人，返景以后，大多会一尝以饱口福。
塔前糊汤
塔前糊汤是以猪肝、瘦肉、冻米、香菇丁、豆芽沫、笋沫、生粉、猪油渣及香葱为原材料制作的一道小吃，具有开胃、消食、醒酒的功效。
桃酥
桃酥起源于江西。是一种南北皆宜的汉族传统特色小吃，以其干、酥、脆、甜的特点闻名全国，主要成分是面粉、鸡蛋、油酥等。相传在唐元时期，江西景德镇周边县乐平、贵溪、鹰潭等地农民纷纷前往做陶工，由于当时工作繁忙，当时有一位乐平农民将自家带来的面粉搅拌后直接放在窑炉表面烘焙，由于其常年咳嗽，平日常有食桃仁止咳习惯，故在烘焙时候会加入桃仁碎末。其他瓷工见此法做的干粮便于日常保存和长途运送瓷器时候食用，便纷纷仿效，因并取名“陶酥"。后谐音为桃酥。
饺子粑
饺子粑，江西景德镇至安徽东至一带传统的地方小吃。一般本地人都把它当早餐和夜宵吃，或者家里有喜事时也做着吃。薄薄的皮包上各种各样的馅再放到蒸笼里面一蒸，香！透过皮都可以隐隐约约地看到里面的馅。也可以蒸完了以后再用油小炸一下，风味又有不同。饺子粑分为辣的和不辣的两种。辣的一般是用萝卜切成丝做馅，不辣的用韭菜和豆干做馅，此外还有豆芽馅、腌菜馅等种类。如果是你是第一次吃饺子粑并且又不太会吃辣的话就一定要记清楚。
乐平白切狗肉
乐平白切狗肉一道以土狗为主要食材制作的赣菜。乐平狗肉制作独特，鲜美爽口。乐平狗肉是用蒸、煮相结合的方法烹制作冷盘食用的风味食品。因系用文火不加盐煮熟，具有肉味鲜嫩、软硬适宜、鲜美爽口、营养丰富等特点。
桂花鲜姜酱菜
桂花鲜姜酱菜具有十分美味的口感，它是江西景德镇一道独特的菜肴特产品，它以色泽金黄，块形整齐美观而著称，具有酱美的浓郁香味，咸辣适口而闻名。
*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const jingdezhenFoodsList = [
  // 灯影牛肉
  {
    province: '江西省', // 省
    city: '景德镇市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangxiCuisine', // 菜系编码
    cuisineCategoryName: '赣菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '江西省', // 省
    city: '景德镇市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangxiCuisine', // 菜系编码
    cuisineCategoryName: '赣菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
