/**
 * 江西-九江市-特产美食
庐山石鸡
庐山石鸡，是一道菜肴。制作时使用的食材庐山石鸡是蛙的一种，叫石蛙，是著名的庐山“三石”之一。庐山三石：石耳、石鸡、石鱼。庐山石鸡是江西省九江市庐山区的一道特色名菜，属赣菜系浔阳菜一支。庐山石鸡选用阴涧岩壁洞穴中的蛙加辣椒等佐料精致而成。庐山石鸡具有“色泽深黄，肉质细嫩，香味浓郁，口味甚醇”的特点，深受民众喜爱。
九江茶饼
九江茶饼,又名庐山茶饼,起源于唐代浔阳楼江边一带。繁荣于明清时期。九江、星子皆盛产。亦为贡品。九江是一座历史悠久的长江沿岸港口城市，地处赣、皖、鄂三省相接之处，依江偎湖，物产丰富，又兼有长江、鄱阳湖、庐山等自然名胜，因此在这里也汇聚了全国各地的美食文化。其中九江茶饼，是江西省九江地区特色名小吃。九江茶饼起源于唐代，是“中国十大传统名饼”、“江西四大糕点之一”，采用传统工艺和现代技术研制而成。”其色泽金黄，具有小而精，素以薄而脆，酥而甜，香而美的特点。由于散发着茶油的清香，丹桂的芳香及纯碱、苏打的奇香，故被人们称为“四香合一”的茶食精点。其营养丰富，易消化，老少皆宜，久食易色，已成为旅游市场中最佳食品之一。
萝卜饼
萝卜饼以面粉，老面主料制作的煎炸类食物。萝卜饼是江西省九江市的一种特色传统小吃，该小吃以发面、酥面为皮，包入萝卜丝馅，煎制而成；成品大多数是江西九江当地人的特色早餐，就着清汤、水子冲蛋一并食用，别有一番风味。
脆皮石鱼卷
脆皮石鱼卷是江西省特色名菜，庐山历代名厨用石鱼制成各式各样的菜肴，脆皮石鱼卷就是其中之一，这款菜肴鲜味浓厚，颜色金黄，外脆里嫩，是佐酒佳肴。
修水哨子
修水哨子，是江西省九江市修水县一种特色地方传统名点。以境内高山特产山芋、西乡红薯粉为原料，馅以地方特色小料，依传统工艺精制而成，纯系天然，清香绵柔，营养丰富，入口即化。
湖口酒糟鱼
湖口酒糟鱼，是江西省九江市湖口县传统名吃。据史学家考证，传统糟鱼起源于原始社会晚期的鄱阳湖与长江交汇地区，故称“湖口糟鱼”。
南峰豆参
地方传统特产。南峰豆参精选优质大豆，精炼植物油，进口配料，经过传统工艺的加工，味鲜独特，且营养及其丰富，含人体所必需的13种氨基酸，被评为2000年中国九江首届农副产品精品奖！由于豆参保持了大豆中的蛋白质、脂肪、无机盐和多种维生素，且熟食绵软 ，还是老幼咸宜的佳品。
熟烩虾仁
熟烩虾仁是由虾等为主要食材做成的一道菜品，是江西九江传统名肴，属于赣菜。虾仁鲜嫩、爽脆，清淡爽口，汤菜兼用。
都昌豆参
都昌豆参，江西省都昌县特产，中国国家地理标志产品。都昌豆参，外形长约三寸，体型溜圆，内芯蓬松，气孔均匀。色泽金黄，光泽度好。口感酥脆，软而不腻，具有菜油香味。质地不易碎，比较轻。2018年3月14日，原国家质检总局批准对“都昌豆参”实施地理标志产品保护。
九江桂花酥糖
九江桂花酥糖也叫九江酥糖，是九江的传统名点。它选用富强粉，白麻仁，白砂糖，饴糖及糖桂花为原料，精制而成。其色乳白，质地细嫩，具有骨脆、麻香、油润、甜爽、香醇等特点；并且有润肺、健胃、止咳的功效。是一种深受游客，尤其为妇孺老幼所喜欢的风味食品。唐宋文人曾称赞其为：“茶罢一块糖，咽而即消爽，细嚼丹桂美，甜酥留麻香”。
石鱼炒蛋
石鱼炒蛋是江西庐山传统名菜，属于赣菜。将石鱼用温水加黄酒浸泡沥干水分，加打散的鸡蛋拌匀，佐以香葱、盐、味精，用热油快炒，滴黄酒，装盘即可。此菜特点：色泽鲜黄，味鲜嫩，柔润爽口。
马尾水黄精鸡
马尾水黄精鸡是一道菜品，制作材料有黄精、土母鸡等。
红米碱水粑
碱水粑（原名寒婆粑）是江西特色小吃，江西省九江市武宁县民间在春节期间必备食品，制法简单，价廉物美，可久储不坏。它以大米磨浆，掺以碱水（乡人多用早稻杆烧灰滤水代碱，其味比市场出售之冰碱泡水更具香味），用特制粑筛猛火蒸熟，厚约10厘米。食用时切成薄片，以本地烟薰腊肉、大蒜等炒食，既能饱腹，又是下酒佳肴。亦可用小白菜或菠菜、包心白加肉汤煮食，鲜美无比。
板栗炖鸡汤
板栗炖鸡汤是江西九江的一道特色名肴。秋天栗子开始成熟，中医认为，板栗“补脾健胃、补肾强筋、活血止血”。鸡肉的性味甘温，主治功用十分广泛，不但温中益气、补精添髓、强筋健骨、活血调经，对虚劳、消瘦、水肿、病后虚弱、久病体虚、健康调理、产妇补养等，效益都很显著。秋天喝板栗炖鸡汤，正合秋季补肾的道理。
湖口豆豉
湖口豆豉，江西省湖口县特产，中国国家地理标志产品。湖口豆豉，色泽乌黑油润有光泽，豉肉松化，豉味浓香醇厚，味道鲜美可口，余味绵长。（1）干豆豉：颗粒完整，松散，呈黑褐色，酱香明显，咸淡适口，有独特的香、酥、醇、鲜之原汁原味，无异味。（2）湿豆豉：颗粒状明显，柔软，呈黑褐色，酱香突出，咸淡适口，有独特的醇香、鲜美味，具有湿豆豉特有的香气。（3）淡豆豉：颗粒完整，松散，呈黑褐色，豉香明显，无咸味，有独特的醇、清、酯香和美味。（4）风味豆豉：呈粘稠适度半流体，瓶口内顶部表层有油保护膜，无霉花，呈黑褐色，并可见各种固形配（调）料，酱香浓郁，咸淡适口，回味醇厚，具有该品种固有的混合鲜美味，无异味。2018年7月30日，国家知识产权局批准湖口豆豉为地理标志保护产品并实施保护。
斋味豆猪肝
斋味豆猪肝这是一道流传在修水县渣津、大桥及白岭一带的一道风味独特的下酒菜。现在县城许多餐馆都有这道菜，作为修水的地方传统佳肴招待来宾。
共青城板鸭
共青城板鸭以传统工艺为基础，对毛鸭选种育肥、腌制、加工、晾晒等技术进行了科学合理的改进，形成了共青城板鸭独特的生产工艺。
如意石耳
如意石耳是一道江西省的传统名菜，属于赣菜。利用庐山特产石耳制作而成，此菜形似如意，整齐美观，黑白分明，鲜嫩清爽。富含蛋白质、脂肪、维生素、无机盐等，有清热凉血、滋阴补血之功效。咯血、衄血、病后体虚者宜用，曾得到烹调老前辈及中外来宾一致好评。
江州水浒肉
将猪脊肉切成小块，撒上细盐，沾上生粉，拖过蛋清，入油锅稍炸后扣碗上笼蒸片刻，浇上料汁即可。
吴城大板瓜子
吴城大板瓜子另一个鲜明特点是，粒大、瓣平、壳薄、肉厚、味香，含有丰富的蛋白质，维生素和脂肪。此瓜子久食不饱不腻，且可帮助消化，因此它是待客，馈赠亲友的上好礼品。
庐山鲜笋
庐山鲜笋，产自江西省庐山生态保护区的食用鲜笋，以其独特的自然环境，被公认为是无污当的保健美容食品，深受广大消费者的青睐。

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const jiujiangFoodsList = [
  // 灯影牛肉
  {
    province: '江西省', // 省
    city: '九江市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '江西省', // 省
    city: '九江市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
