// /*
//  * @Author: vigne 1186963387@qq.com
//  * @Date: 2023-10-20 16:02:54
//  * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/jiangxiProvince/name.js
//  * @Description:
//  *
//  * Copyright (c) 2023 by ${git_name_email}, All Rights Reserved.
//  */
// // ### 菜肴

// // ### 小吃
// 油炸小品,白糖糕,糖画,豫章酥鸭,李渡酒,鄱阳湖银鱼,石头街麻花,瓦罐汤和拌粉,牛舌头,金线吊葫芦,芥菜团子,酿冬瓜圈,家乡锅巴,大回饼,木瓜凉粉,伊府面,吊楼烧饼,状元糕,如意糕,麻辣烫,南昌米粉,军山湖大闸蟹,葛粉,麻辣藕片,万寿宫马打滚,万寿宫糊羹,风味烤卤,鄱阳湖狮子头,三杯脚鱼,竹筒粉蒸肠,藜蒿炒腊肉,煌上煌,
// 西施金丝缠大虾,海参眉毛丸,稻香鸭,新雅四宝,瓦罐煨猪手,酱香肘子,粉蒸肉,红酥肉,烤羊排,苦瓜酿核枣,清蒸军山湖大闸蟹,鳜鱼煮粉,鄱湖白浇鳙鱼头,金蝉戏莲,茶香和平鸽,莲子老鸭煨汤,皱纱扣肉,小炒黄牛肉,红烧牛蹄筋,炒勺子肉,珍珠肉丸,炒双冬,如意冬笋,鲍汁花菇,凤凰扣笋针,白汁玉翅,藜蒿炒腊肉,豆参炖鲶鱼,香酥刀鱼,
// 香煎白鱼,东坡肉,庐山红烧石鸡,煎虾渣,浔阳龙虾,山药炖排骨,土椒烧桂鱼,豆豉煨肉,东升沙钵豚,景德瓷土煨鸡,金镶玉,船板肉,鸭脚板炒腊肉,甲鱼烧苦株皮,志士肉,莲花血鸭,萍乡烟熏肉,萍乡小炒肉,全家福,砂钵土鸡汤,无水烧鹅,粽香骨,白玉黄蜂肉,天师八卦豆腐,天师板栗烧土鸡,黄袍拜君王,一品马蹄凤丸汤,四星望月,赣南小炒鱼,
// 三杯鸡,红军焖鸭,荷包胙,蝴蝶鱼饺,兴国粉蒸灰鹅,响铃鱼饼,赣州噘鱼嘴,赣味牛脸,黄焖铜鼓黑山羊,明月映石蛙,上汤腐竹煲,老表土鸡汤,五元龙凤,宜丰炒米蒸蛋,弋阳国道鱼,春不老黄芽头,鄱湖三色鱼,弋阳鸡,余干辣椒炒肉,婺源南瓜糊,婺源糊豆腐,清蒸荷包红鲤鱼,金龟煨山药,银鱼泡蛋,绣球干贝,甲鱼煮粉皮,南丰鱼丝,水晶肉丸,
// 双色蛋菇,临川牛杂,宜黄焦头笋,银鱼藕丝,葵花莲子,参杞乌骨鸡,酱萝卜炖老鸭,泰和烧沙鳖,莴叶炒鳝片,井岗烟笋炒肉丝,鄱湖蒸藕丸,永和豆腐
// 豫章酥鸡, 五元龙凤汤,三杯仔鸡,瓦罐汤,香质肉,冬笋干烧肉,藜蒿炒腊肉,上饶汤粉,信州腊肠,原笼船板肉,浔阳鱼片,炸石鸡,兴国豆腐,米粉牛肉,金线吊葫芦,信丰萝卜饺,樟树包面,黄元米果,米粉蒸肉,豆泡烧肉,八宝饭,井冈山烟笋,南昌狮子头,南昌炒粉,南安板鸭,贵溪捺菜,宜丰土鸡
// 鄱湖胖鱼头,四星望月,藜蒿炒腊肉,庐山石鸡,余干辣椒炒肉,萍乡烟熏肉,莲花血鸭,老表土鸡汤,永和豆腐,井冈烟笋
// 鄱湖野生桂鱼炒粉,金汤鲜银鱼,婺香荷包红鲤,临川牛肚皮,仙女之吻,临川藕丝,甲鱼煮粉皮,永新狗肉,井冈竹鼠,赣南小炒鱼,三杯鸡,八卦豆腐,明月山温泉豆腐,昌南一锅鲜,八戒戏凤,乡村小河鱼,萍乡小炒肉,高岭土煨肉,粉蒸肉
// 家乡锅巴,
// 松湖米粉肉,红酥肉,啤酒烧鸭,糊羹,烧杂素,油浸鱼,三杯鸡,卤水白鱼,糟烧蟹脚,白糖糕,安义花椒鸡,盐包鸡,酱鸭,竹筒米粉肠,瓦罐煨汤,牛肉炒粉,豫章酥鸭,和菜,白汁玉翅,扣肘盐菜,大塘东坡肉,罐煨肉,绉纱扣肉,鱼饺,空心鱼圆汤,粉蒸肉
// 赣州小炒鱼,三杯鸡,流浪鸡,炒东坡,荷包肉,月亮花生巴,南安板鸭,梅关春酒,果蔬脆片,“牡丹亭”多味花生,粉蒸肉
// 庐山三石,浔阳鱼宴,庐山素烩,白浇鱼头,小乔炖白鸭,豆豉爆肉,浔阳鱼糕,酒糟鱼,修水哨子,武宁炖钵,湖口米粑,永修东坡肉,水浒肉,浔阳鱼饺,九江鱼块,灌汤田螺
// 安福火腿,全副銮驾,永新血鸭,血鳝,永新南乡围扣肉,三杯乌鸡,万安鱼头,永丰霉鱼,油淋鸡,宸肉,粉晒肉,井冈烟笋烧肉,桔香鱼丝,遂川板鸭,红粬肉,鹅颈,万安荷花娘,井冈豆皮,酱萝卜老鸭汤
//  临川藕丝,南丰鱼丝,广昌肉丸,鸳鸯蛋菇,南丰鱼丸,南城鱼脯,宜黄漂丸,宜黄薯粉饺,临川牛杂,冻米肉丸,葵花广莲,资溪酒卤鸡,崇仁滑肉,乐安霉鱼,南丰鱼卷
//  志士肉,瓷泥煨鸡,高岭煨肉,原笼船板肉,波浪肉,臭鳜鱼,湖田夹栗肉,炙肠,八宝炖盆,塔前糊汤,山珍扣肉,碱水粑,苦槠豆腐,桑叶饺,苋菜糊,清汤泡糕,鲫鱼豆腐糕
//  萍乡风味佳肴萍乡风味佳肴有,萍乡小炒肉,莲花血鸭,大烩羊肉,三层楼,红白肚尖,萍乡薰肉,荷叶肉,花酿鸭掌,芙蓉鱿鱼,酥炸石鸡腿,五彩鱼钱,杨胡子米面,萍乡花果,苏轼蜜酒
//  雄鱼头烧豆腐,藜蒿炒腊肉广丰豌豆烧鲫鱼,信州芋头牛肉,弋阳扣肉,鄱阳三色鱼,广丰千层糕,弋阳扣肉,鄱阳三色鱼,婺源蒸菜,广丰羊肉,万年咸肉,铅山石骨,田敦牛肉,应家干煸豆豉果,应家菜煮饭团,余干辣椒炒肉,玉山临江湖豆腐,饭麸粿,麻糍粿
//  仙女之吻,月之朦胧,独占鳌头,仙女散花,七仙之约
// 播报清汤泡糕,
// 酒糟汤圆,
// 白糖糕,
// 伊府面,
// 金线吊葫芦,
// 灵芝糯团,
// 兰花根,
// 松糕,
// “修水哨子”
