/*
 * @Author: vigne 1186963387@qq.com
 * @Date: 2023-10-24 17:34:15
 * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/jiangxiProvince/others.ts
 * @Description:
 *
 * Copyright (c) 2023 by ${git_name_email}, All Rights Reserved.
 */
/**
 * 江西省-未知城市-特产美食
 * 一品马蹄凤丸汤,七仙之约,万安荷花娘,万年咸肉,三层楼,三杯乌鸡,三杯仔鸡,上汤腐竹煲,上饶汤粉,东升沙钵豚,东坡肉,临川牛肚皮,九江鱼块,乡村小河鱼,五元龙凤,五元龙凤汤,五彩鱼钱,井冈山烟笋,井冈烟笋,井冈烟笋烧肉,井冈竹鼠,井冈豆皮,井岗烟笋炒肉丝,仙女散花,余干辣椒炒肉,信丰萝卜饺,信州腊肠,信州芋头牛肉,全副銮驾,全家福,八卦豆腐,八宝炖盆,八宝饭,兰花根,兴国粉蒸灰鹅,兴国豆腐,冬笋干烧肉,凤凰扣笋针,南丰鱼丸,南丰鱼卷,南城鱼脯,南安板鸭,南昌炒粉,南昌狮子头,卤水白鱼,原笼船板肉,参杞乌骨鸡,双色蛋菇,和菜,响铃鱼饼,啤酒烧鸭,土椒烧桂鱼,大塘东坡肉,大烩羊肉,天师八卦豆腐,如意冬笋,婺源南瓜糊,婺源糊豆腐,婺源蒸菜,婺香荷包红鲤,安义花椒鸡,安福火腿,宜丰土鸡,宜丰炒米蒸蛋,宜黄漂丸,宜黄焦头笋,宜黄薯粉饺,宸肉,小乔炖白鸭,小炒黄牛肉,山珍扣肉,山药炖排骨,崇仁滑肉,广丰千层糕,广丰羊肉,广昌肉丸,庐山三石,庐山素烩,庐山红烧石鸡,应家干煸豆豉果,应家菜煮饭团,弋阳国道鱼,弋阳鸡,志士肉,扣肘盐菜,播报清汤泡糕,新雅四宝,无水烧鹅,昌南一锅鲜,明月山温泉豆腐,明月映石蛙,春不老黄芽头,景德瓷土煨鸡,月之朦胧,月亮花生巴,杨胡子米面,松湖米粉肉,松糕,果蔬脆片,桑叶饺,桔香鱼丝,梅关春酒,樟树包面,武宁炖钵,水晶肉丸,水浒肉,永丰霉鱼,永修东坡肉,永和豆腐,永新南乡围扣肉,永新狗肉,油浸鱼,油淋鸡,波浪肉,泰和烧沙鳖,流浪鸡,浔阳鱼宴,浔阳鱼片,浔阳鱼糕,浔阳鱼饺,浔阳龙虾,海参眉毛丸,清汤泡糕,清蒸军山湖大闸蟹,湖口米粑,湖田夹栗肉,灌汤田螺,灵芝糯团,炒东坡,炒勺子肉,炒双冬,炙肠,炸石鸡,烤羊排,烧杂素,煎虾渣,牛肉炒粉,牡丹亭多味花生,独占鳌头,玉山临江湖豆腐,珍珠肉丸,瓦罐汤,瓦罐煨汤,瓦罐煨猪手,田敦牛肉,甲鱼烧苦株皮,甲鱼煮粉皮,白汁玉翅,白浇鱼头,白玉黄蜂肉,皱纱扣肉,盐包鸡,砂钵土鸡汤,稻香鸭,空心鱼圆汤,竹筒米粉肠,米粉牛肉,米粉蒸肉,粉晒肉,粽香骨,糊羹,糟烧蟹脚,红军焖鸭,红烧牛蹄筋,红白肚尖,红粬肉,红酥肉,绉纱扣肉,绣球干贝,罐煨肉,臭鳜鱼,船板肉,芙蓉鱿鱼,花酿鸭掌,苋菜糊,苏轼蜜酒,苦瓜酿核枣,茶香和平鸽,荷包肉,荷叶肉,莲子老鸭煨汤,莴叶炒鳝片,萍乡小炒肉,萍乡烟熏肉,萍乡薰肉,萍乡风味佳肴萍乡风味佳肴有,葵花广莲,藜蒿炒腊肉广丰豌豆烧鲫鱼,蝴蝶鱼饺,血鳝,西施金丝缠大虾,豆参炖鲶鱼,豆泡烧肉,豆豉煨肉,豆豉爆肉,豫章酥鸡,赣味牛脸,赣州噘鱼嘴,赣州小炒鱼,遂川板鸭,鄱湖三色鱼,鄱湖白浇鳙鱼头,鄱湖胖鱼头,鄱湖蒸藕丸,鄱湖野生桂鱼炒粉,鄱阳三色鱼,酒糟汤圆,酒糟鱼,酥炸石鸡腿,酱萝卜炖老鸭,酱萝卜老鸭汤,酱香肘子,酱鸭,金汤鲜银鱼,金蝉戏莲,金镶玉,金龟煨山药,铅山石骨,银鱼泡蛋,银鱼藕丝,雄鱼头烧豆腐,饭麸粿,香煎白鱼,香质肉,香酥刀鱼,高岭土煨肉,高岭煨肉,鱼饺,鲍汁花菇,鲫鱼豆腐糕,鳜鱼煮粉,鸭脚板炒腊肉,鸳鸯蛋菇,鹅颈,麻糍粿,黄元米果,黄焖铜鼓黑山羊
 */

import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const othersFoodsList = [
  // 灯影牛肉
  {
    province: '江西省', // 省
    city: '', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'qiongCuisine', // 菜系编码
    cuisineCategoryName: '琼菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
