/**
 * 江西-上饶市-特产美食
 * 
 * 
 * 龟峰扣肉、万年贡米、饭麸果、葛源豆腐、铅山灯盏果、弋阳大米粿、肉馅烧饼、油条包麻糍果、清明果、糯米子糕、烫米粉、猪肝粉、大排粉、羊肉粉、肥肠粉、酱香鹅、清蒸荷包红鲤鱼、粉蒸肉、糊豆腐、全鱼宴、藜蒿炒腊肉、清炒白玉豆、弋阳龟峰国道鱼等。
弋阳油淋鱼
弋阳扣肉
烫粉
三清腊板鸭
龟峰扣肉
饭麸果
油淋鱼
广丰豌豆烧鲫鱼
灯盏粿
肉圆果
弋阳年糕

 * 
 * 
 * 
上饶市特色小吃有龟峰扣肉、万年贡米、饭麸果、葛源豆腐、铅山灯盏果、弋阳大米粿、肉馅烧饼、油条包麻糍果、清明果、糯米子糕、烫米粉、猪肝粉、大排粉、羊肉粉、肥肠粉、酱香鹅、清蒸荷包红鲤鱼、粉蒸肉、糊豆腐、全鱼宴、藜蒿炒腊肉、清炒白玉豆、弋阳龟峰国道鱼等。
弋阳油淋鱼
弋阳油淋鱼 选用鲜活草（鲤）鱼为主料，配以米酒、天然香料、酱、食用醋、茶油等，结合民间传统工艺精制而成，具有食而不腥，油亮澄黄、香浓可口、开胃生津、健脑护胃等功效。
弋阳扣肉
弋阳扣肉，又名“经国扣肉”，是江西弋阳传统的特色名菜。工艺系20世纪30年代蒋经国在赣南的厨师涂光明所传。以上好五花猪肉为主原料，佐以梅干菜、白糖、味精、精盐等蒸制倒扣而成。具有色泽红亮、梅香四溢、油而不腻的特点。
烫粉
烫粉是上饶（尤其是铅山县）的一种特色小吃。烫粉流行于上饶各地，其中以紫溪乡及河口镇为代表的铅山烫粉最为出名。烫粉味道鲜美，方便快捷，具有不粘不湖、清爽滑口的特点选用优质早米压榨成新鲜湿米粉。每天凌晨，榨粉作坊榨好米粉后，用篾筛把一圈圈毛线似的鲜粉送往各烫粉店。
三清腊板鸭
三清腊板鸭是江西省上饶市玉山县传统名菜。三清腊板鸭瘦肉多、干度好、营养佳、肉嫩皮薄、骨脆肉香、腊味醇和、鲜爽美口。实为“江南美味珍上品”。三清腊板鸭选用三清山脚下信江源头河溪畔农家野外放养，觅食田螺、捕虫食草的土鸭为原料，宰后经 “ 三天腌制七天露晒 ”的独特配方和工艺精制而成。
龟峰扣肉
龟峰扣肉选用上等农家鲜猪五花肉，加上梅干菜等多种配料蒸制而成，色泽红亮、油而不腻，梅香四溢，营养丰富。特别是现在通过现代真空包装等技术，开发成为了一道旅游产品，深受游客的喜爱。
饭麸果
饭麸果是江西上饶的一道地方特色小吃。籼米煮成6-7成熟的夹生饭，加入少量的红薯粉揉搓成小儿手臂粗的长条切成小段备用，用排骨或筒骨煮成高汤，放入饭麸果，并加入豆芽、竽头以及切成丁的水发香菇、黑木耳、湿水笋、墨鱼，咸肉，佐以葱、姜、蒜等，爱吃辣的人，还可以加入辣椒末，一道在锅中煮熟。饭麸果汤鲜味美，顺滑可口，是上饶人立夏之日的传统主食。
油淋鱼
油淋鱼是江西弋阳特产。选用鲜活草（鲤）鱼为主料，配以米酒、天然香料、酱、食用醋、茶油等，结合民间传统工艺精制而成，具有食而不腥，油亮澄黄、香浓可口、开胃生津、健脑护胃等功效。
广丰豌豆烧鲫鱼
广丰豌豆烧鲫鱼，是江西省上饶市广丰县的一道特色菜，属于属赣菜系饶帮菜，因其具“鲜香酥软”的优点而深受民众喜爱。制作时主要材料选用广丰当地特产的永丰豌豆，鲫鱼是选自广丰丰溪出产的鲫鱼，油为茶籽油。
灯盏粿
灯盏粿是江西省上饶市铅山县的地方特色小吃。因外形呈灯盏状而得名，外皮由大米制成，中间添馅，馅大多数有新鲜香菇，鲜猪肉，黄豆芽，鲜竹笋等（也可因个人口味不同酌情增减），最后放入竹制小蒸笼中用大火蒸半小时左右即可，色香味俱全，食后回味无穷，齿颊留香。
肉圆果
肉圆果是用上等的番薯粉和着瘦肉、芋头、荸荠、香菇、藕丁、墨鱼等配料制作而成的一种小吃。肉圆果为江西省上饶市的一种特色小吃，流行于上饶境内的信州、广丰、铅山等地。肉圆果一蒸出来就可以吃，刚出笼的肉圆果柔软嫩滑口感很好。待铺开冷却之后，可以存放较长的时间。以前，肉圆果在上饶民间算得上是比较贵重的食品，人们只在年关制作食用，用于正月接待客人（做汤、炒菜或单独蒸热吃）。早已不受时令限制，自家随时可做；菜场上也时常有卖，食用方便。 肉圆果寓意“团团圆圆”。
弋阳年糕
弋阳年糕，江西省弋阳县特产，中国国家地理标志产品。弋阳年糕，又名弋阳大禾米粿，是弋阳县传统特色食品，历史悠久，源远流长，制作始于唐代，已有1200多年的历史，它以弋阳大禾谷米为原料，采用

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const shangraoFoodsList = [
  // 灯影牛肉
  {
    province: '江西省', // 省
    city: '上饶市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangxiCuisine', // 菜系编码
    cuisineCategoryName: '赣菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '江西省', // 省
    city: '上饶市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangxiCuisine', // 菜系编码
    cuisineCategoryName: '赣菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
