/**
 * 云南-昆明市-特产美食
 * 
  * ,青头菌,云南臭豆腐,豆花米线,凉米线,罐罐臭豆腐,罐罐鸡,腌菜包,卤腐（腐乳）,宝珠梨,卤鸭子,小白鱼,海榨,宜良烤鸭,松茸,火焰土豆泥,鸡,摩登粑粑,毛肚,凉鸡米线,卤饵丝,包浆豆腐,鬼鸡,滚锅牛肉,蚝油芦笋,黑椒牛排,厚片,糊辣鱼火锅,花椒香肠,黄金饼,回饼,茴饼,火树银花,米布,米酒,牛肝菌,贡丸,木瓜牛奶,南瓜汤圆,嫩牛,柠檬蛋奶,鸡汤白菜,鸡油,见手青,酱爆茄子,金牌吊烧鸡,金沙玉,金条稀豆粉,韭菜炒葛根粉,紫米粑粑,血肠,烤鸡脚筋,干巴菌,玉米浆,干锅虾,凉拌鱼皮,米浆粑粑,糯米砣,酸辣粉,炸牛奶,炖猪脚,官渡粑粑,* 昆阳卤鸭,宜良烤鸭,寻甸牛干巴,云腿豆焖饭,火腿月饼,宜良板鸭,汽锅鸡,盐饼子,,鲜花饼,玫瑰鲜花饼,乳扇沙琪玛,饵块,石林乳饼,烤乳扇,嘉华鲜花饼,鸡丝凉面,豆花米线,竹虫,滇池麻鸭,宜良板鸭,饵丝,官渡粑粑,都督烧卖,大头菜,滇八件糕点,

 * 
 * 
小吃
、青头菌、云南臭豆腐、豆花米线、凉米线、罐罐臭豆腐、罐罐鸡、腌菜包、卤腐（腐乳）、宝珠梨、卤鸭子、小白鱼、海榨、宜良烤鸭、松茸、火焰土豆泥、鸡、摩登粑粑、毛肚、凉鸡米线、卤饵丝、包浆豆腐、鬼鸡、滚锅牛肉、蚝油芦笋、黑椒牛排、厚片、糊辣鱼火锅、花椒香肠、黄金饼、回饼、茴饼、火树银花、米布、米酒、 牛肝菌、贡丸、木瓜牛奶、南瓜汤圆、嫩牛、柠檬蛋奶、鸡汤白菜、鸡油、见手青、酱爆茄子、金牌吊烧鸡、金沙玉、金条稀豆粉、韭菜炒葛根粉、紫米粑粑、血肠、烤鸡脚筋、干巴菌、玉米浆、干锅虾、凉拌鱼皮、米浆粑粑、糯米砣、酸辣粉、炸牛奶、炖猪脚、官渡粑粑
昆阳卤鸭
昆阳卤鸭是云南省昆明市晋宁区的著名特产，因其历史悠久，口味独特，已被列入昆明市非物质文化遗产。昆阳卤鸭是伟大的航海家、晋宁人郑和汲取南京盐水鸭制作工艺而独创的特色美味，晋宁县濒临滇池南岸，曾是古滇国的首都，昆阳卤鸭原料采自当地麻鸭，配以中草药等秘方，醇厚隽永，是集各种卤肉制品之大成作。较为代表性的是昆阳的猫林卤鸭、彩琴卤鸭。
宜良烤鸭
宜良烤鸭，是云南省昆明市宜良县经典的地方传统名肴，其起源于明朝，已有600多年的历史，有着肥瘦相宜，皮酥脆，内香嫩，光亮油润，色泽红艳，清香离骨的特点，地方风味显著。
寻甸牛干巴
寻甸牛干巴，云南省寻甸回族彝族自治县特产，中国国家地理标志产品。寻甸牛干巴肌肉切片呈紫红色、脂肪呈乳白色或金黄色，具有牛干巴特有的香气，无异味，形态为紧密的片状或块状，大小、厚薄均匀一致，无肉眼可见杂质，允许有香辛配料颗粒存在。2014年12月24日，原国家质检总局批准对“寻甸牛干巴”实施地理标志产品保护。
云腿豆焖饭
云腿豆焖饭，是云民间传统风味美食，每年春夏两季，各家各户都要吃上几次豆焖饭。
火腿月饼
火腿月饼初创于民国时期的昆明合香楼，是中秋传统节日食品。主要食材有精面、火腿、猪油等。火腿月饼分酥皮、硬壳、荞面等，其中硬壳火腿月饼最具代表性。云南昆明将火腿月饼叫做“四两坨”，因其初制时每个足有老两四两重，四个合装，正好老斤一斤。
宜良板鸭
1950 年以前自产自食，零星售卖，少量销往昆明等地，后经过技术加工，选用壮鸭，成品色泽油黄，肉质鲜美、 细嫩，清香可口、咸淡适宜，是佐餐和馈赠佳品，内销全省各地，出口到中国香港地区、中国澳门地区、新加坡等国家地区。
汽锅鸡
汽锅鸡是云南省建水县的一道特色名菜，属于滇菜系；因该菜品用汽锅蒸制而得名，其主要食材是鸡肉，主要烹饪工艺是蒸，有补虚养身、补血、健脾开胃的功效。汽锅鸡因为其营养丰富深受广大群众的喜爱。2018年9月，被评为“中国菜”之云南十大经典名菜。
盐饼子
盐饼子是昆明地区的大众小吃。分甜、咸两种，以咸味的居多。具体做法是用小麦面粉加酵母和水调和成面团使其发酵，加入小苏打中和酸味。用熟猪油、花椒油、食盐、炒熟的面粉拌成椒盐面团。将酵面团摘成小剂，每个小剂中间包上五分这一椒盐面团，用擀面杖经过反复叠、压擀，呈斧头形，用平底锅上火，锅底布少量植物油，下入生坯用小火烙至两面金黄。

鲜花饼
鲜花饼（Flower cake），是以面粉、玫瑰，玉兰、菊花等为主要原料的小吃。
玫瑰鲜花饼
每年4月底5月初，是云南食用玫瑰的盛放期。云南人善于制作鲜花饼，一年四季有不同的鲜花。百合、茉莉、菊花、芋头花几十种。鲜花饼的制作缘起300多年前的清代。由上等玫瑰花制得的鲜花饼，因其特色风味历为宫廷御点，深得乾隆皇帝喜爱。在民间，这种制饼传统和技艺流传。
乳扇沙琪玛
乳扇沙琪玛是一道食品，以乳扇、白芝麻、白糖等食材制作而成。
饵块
饵块为云南贵州特有，是腾冲最著名的特色小吃之一，也是云南和贵州地区四川部分地区常见的传统食品之一。饵块系用优质大米加工制成，其制作过程是将大米淘洗、浸泡、蒸熟、冲捣、揉制成各种形状。一般分为块、丝、片三种。制作方法烧、煮、炒、卤、蒸、炸均可，风味各异，久食不厌。云南十八怪中就有一怪：米饭饼子烧饵块。
石林乳饼
石林乳饼，云南省石林县特产，全国农产品地理标志。石林乳饼是石林县传统特产，当地人把新鲜的羊奶煮沸，再加入适量酸水，使其凝固，然后压制成块，晾干后即成乳饼（属奶酪的一种）。乳饼的吃法很多，可蒸、煮、煎、炸、烩，亦可生吃，还可以做成火腿夹清蒸乳饼，青豆烩乳饼等菜肴，冬季生产的乳饼品质较好。石林乳饼味道鲜美，营养丰富，是云南省名特食品之一。乳饼乳白中带黄，质地纯净，滋润光滑，气味清香，是一种高脂肪、高蛋白的营养食品。2011年09月13日，中华人民共和国农业部批准对“石林乳饼”实施农产品地理标志登记保护。
烤乳扇
乳扇是产于大理洱源的奶制品，形制更为独特，是一种含水较少的薄片，呈乳白、乳黄之色，大致如菱角状竹扇之形，两头有抓脚。
嘉华鲜花饼、鸡丝凉面、豆花米线、竹虫、滇池麻鸭、宜良板鸭、饵丝、官渡粑粑、都督烧卖、大头菜、滇八件糕点





*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const kunmingFoodsList = [
  // 灯影牛肉
  {
    province: '云南省', // 省
    city: '昆明市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'yunnanCuisine', // 菜系编码
    cuisineCategoryName: '滇菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '云南省', // 省
    city: '昆明市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'yunnanCuisine', // 菜系编码
    cuisineCategoryName: '滇菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
