/*
 * @Author: vigne 1186963387@qq.com
 * @Date: 2023-10-20 19:04:17
 * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/yunnanProvince/name.js
 * @Description:
 *
 * Copyright (c) 2023 by ${git_name_email}, All Rights Reserved.
 */
/*
 * @Author: vigne 1186963387@qq.com
 * @Date: 2023-10-20 19:04:17
 * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/yunnanProvince/name.js
 * @Description:
 *
 * Copyright (c) 2023 by ${git_name_email},All Rights Reserved.
 */
// 三尖角粑粑,三川火腿,下村豆粉,丽江三文鱼,丽江粑粑,丽江腊排骨火锅,乌鸡白凤紫砂锅,乳扇,乳扇沙琪玛,云南十八怪,云南臭豆腐,云腿豆焖饭,会泽稀豆粉,佤山烧鸡,佤族酸肉,佤王宴,俐侎烤全羊,保山大烧,保山绿豆,傣味鸡,傣族烧鱼,傣族竹筒饭,傣族菜,八面煎鱼,冬瓜蜜饯,冰稀饭,冰粉凉宵,凉拌番木瓜,凉拌鱼皮,凉撒撇,凉米线,凉鸡米线,凤庆粑粑卷,剁生,剑川八大碗,剪刀塘,包浆豆腐,包烧猪眼睛,包烧猪脑,包烧鲜鱼,包烧鲜鱿,华宁干米线,南瓜汤圆,南秘,卤腐（腐乳）,卤饵丝,卤鸭子,卵石鲜鱼汤,卷粉,厚片,口水羹施甸豆片,吹猪肝,哀牢山三珍,啤酒鸭,喃咪,喜洲破酥粑粑,嘉华鲜花饼,回饼,土鸡米线,坛子鸡,大头菜,大头鱼,大救驾,大理酸辣鱼,天麻炖鸡,头脑锅子,嫩牛,官渡粑粑,宜良板鸭,宜良烤鸭,宝珠梨,宣威火腿,寻甸牛干巴,小白鱼,小锅米线,山林素席,巧家小碗红糖,巴撒,干巴菌,干腌菜,干锅虾,幼嫩尖叶类野菜,建水烧豆腐,开远小卷粉,弥渡卷蹄,抗浪鱼,拉祜烤牛肉,摩登粑粑,撒撇,新平腌菜,昆阳卤鸭,春甜黄酒,昭通凉粉,昭通苦荞粑粑,昭通酱,普洱豆汤米干,曲靖市还有,曲靖韭菜花,木瓜水,木瓜牛奶,松茸,柠檬蛋奶,椰仁煮鸡,此外,毛肚,毫崩,毫栋,毫糯索,永德小炒肉,永昌板鸭施甸三味,永胜油茶,江川三道菜,江川大头鱼,汽锅鸡,河口小卷粉,河水煮活鱼,油卤腐,油炸五香芭蕉花,油炸撒撇五滴水,油炸蜂蛹,油炸青苔,油鸡枞,油鸡纵,沾益辣子鸡,泡鲁达,洋芋鸡,洱海海菜,海榨,清茶舂鱼,滇八件糕点,滇池麻鸭,滚锅牛肉,火树银花,火烧猪肉,火焰土豆泥,火腿月饼,火腿木瓜鸡,火腿杂菜汤,炒苦子,炒野生菌,炒黄笋,炖猪脚,炭烧猪皮,炸牛奶,炸牛皮,烟熏鱼,烤乳扇,烤鸡脚筋,烧烤挑手鱼,烧烤牛肉丝,烧豆腐,烧饵块,热带水果,煮苦笋,牛扒呼,牛撒撇,牛肝菌,牦牛火锅,猪肉撒撇,猫哆哩酸角糕,玉溪凉米线,玉溪卤饵块,玉溪芝麻片,玉米浆,玫瑰鲜花饼,琵琶肉,瑶族粽子,生皮,百旺,盐水鱼,盐津豆花,盐饼子,知了肉圆子,石屏豆腐,石林乳饼,石烹鲜鱼汤,石花菜,碧玉酥,稀豆粉,稀豆粉米线,竹筒煮鸡汤,竹虫,竹香糯米饭,米布,米浆粑粑,米灌肠,米酒,粑粑卷,糊辣鱼火锅,糯米砣,紫米八宝饭,紫米粑粑,纳西汤谱,纳西火锅,纳西烤鱼,纳西茶谱,纳西饭谱,罐罐臭豆腐,罐罐鸡,耙肉饵丝,耿马毫崩,腊排骨,腌牛脚筋,腌菜包,腌菜膏,腌酸鱼,腌骨头参,腾冲大救驾（炒饵块）,腾冲果脯,腾冲饵丝,臭菜煎蛋,舂干巴,舂菜,芒市泡菜,芒果炒鸡,芝麻片,花山带皮羊肉,花椒香肠,苦荞粑粑,茴饼,茶三鲜,茶小炒,茶蒸罗非鱼,茶香牛排,茶香糯米鸡,茶香骨,茶香鸭舌,菜花腌菜伴蜂仔,菠萝牛肉,菠萝紫米饭,菠萝饭,蒲缥甘蔗,蒸饵丝,蕉叶包蒸牛肉,蕉叶包蒸猪肉,蕉叶包蒸鱼卵,蕉叶蒸鸡,蕉叶香草鱼,蕨菜炒腊肉,蚂蚁蛋,蚝油芦笋,蜂蛹酱,蟹肉煮圆子,血肠,见手青,豆沫糖,豆腐拌嫩茶,豆花米线,豌豆粉,贡丸,过桥米线,通海豆末糖,都督烧卖,酥油茶,酱爆茄子,酸味鱼,酸扒菜,酸笋煮干巴,酸笋煮螺蛳,酸笋煮鱼（鸡）,酸笋煮鸡,酸草鱼,酸菜红豆汤,酸菜鸡,酸蚂蚁蛋汤,酸辣粉,酸面肉,野山药火腿鸡,野生菌,金条稀豆粉,金沙玉,金牌吊烧鸡,金瓜糯香骨,铜锅鱼,银鱼,陆良板鸭,雕梅扣肉,青头菌,青椒腊鹅,韭菜炒葛根粉,饵丝,饵丝透心绿,饵块,香竹烤饭,香茅草包蒸鸡,香茅草烤鱼,香茅草烤鸡,香草鸡,鬼鸡,鲁史火腿,鲜竹笋,鲜花饼,鸡,鸡丝凉面,鸡汤白菜,鸡油,鸡炖豆腐,鸡肉烂饭,鸡肉稀饭,鸡肉米粥,鸡蛋干巴菌,鸡豆凉粉,鸡豆腐,麻衣馓子,黄蚂蚁蛋,黄豆面,黄金饼,黑椒牛排,
