/**
 * 云南-西双版纳傣族自治州-特产美食
 * 鲜竹笋,蚂蚁蛋,野生菌,热带水果,傣族竹筒饭,紫米八宝饭,* 香茅草烤鱼,香茅草包蒸鸡,酸笋煮鱼（鸡）,炸牛皮,酸笋煮鸡,菠萝紫米饭,黄蚂蚁蛋,酸笋煮螺蛳,油炸青苔,包烧猪脑,喃咪,腌牛脚筋,鸡肉稀饭,包烧鲜鱿,卵石鲜鱼汤,煮苦笋,舂菜,油炸蜂蛹,幼嫩尖叶类野菜,蕉叶包蒸牛肉,炒野生菌,包烧猪眼睛,香茅草烤鸡,剁生,毫崩,蕉叶包蒸猪肉,椰仁煮鸡,百旺,蕉叶包蒸鱼卵,臭菜煎蛋,毫栋,酸蚂蚁蛋汤,鸡肉米粥,炒黄笋,石烹鲜鱼汤,蟹肉煮圆子,油炸五香芭蕉花,毫糯索,竹筒煮鸡汤,烧烤牛肉丝,瑶族粽子,酸笋煮干巴,竹香糯米饭,菠萝饭,傣族烧鱼,炸牛皮,毫糯索,香茅草烤鱼,菠萝紫米饭,剁生,南秘,蜂蛹酱,香竹烤饭,傣族竹筒饭,毫糯索,香茅草烤鱼,



西双版纳的民族风味食品独具特色，傣族风味自成体系，基本的烹饪方法是烤、炸、蒸、剁、腌，很少炒菜；味道特点是：香、脆、酸、辣、鲜。 [31]
香茅草烤鱼
香茅草包蒸鸡
酸笋煮鱼（鸡）
炸牛皮
酸笋煮鸡
菠萝紫米饭
黄蚂蚁蛋
酸笋煮螺蛳
油炸青苔
包烧猪脑
喃咪
腌牛脚筋
鸡肉稀饭
包烧鲜鱿
卵石鲜鱼汤
煮苦笋
舂菜
油炸蜂蛹
幼嫩尖叶类野菜
蕉叶包蒸牛肉
炒野生菌
包烧猪眼睛
香茅草烤鸡
剁生
毫崩
蕉叶包蒸猪肉
椰仁煮鸡
百旺
蕉叶包蒸鱼卵
臭菜煎蛋
毫栋
酸蚂蚁蛋汤
鸡肉米粥
炒黄笋
石烹鲜鱼汤
蟹肉煮圆子
油炸五香芭蕉花
毫糯索
竹筒煮鸡汤
烧烤牛肉丝
瑶族粽子
酸笋煮干巴
竹香糯米饭
菠萝饭
傣族烧鱼
西双版纳的傣族村寨美食。 鱼打理好后，配上葱、姜、蒜、辣椒面及香茅草、槟榔青、野芫荽、盐巴果、小米辣，可煎、炸、蒸、煮、烧烤、腌、熏。尤以包烧鱼和竹筒烧鱼、烤鱼、酸鱼、鱼剁生、“臭”鱼的做法和味道最有特点。
炸牛皮
西双版纳的傣族特色佐酒佳肴，其口感泡脆，蘸番茄酱吃，辛香回甜，独具风味。
蜂蛹酱
蜂蛹酱是一道菜，制作材料有野蜂蛹、野花椒粉等。
竹筒饭
竹筒饭，用山兰稻（一种旱稻）“香米”配肉类为原料，放进新鲜的粉竹或山竹锯成的竹筒中，加适量的水，再用香蕉叶将竹筒口堵严，炭火中绿竹烤焦即可。竹筒饭的煮法颇具有野炊特点，即砍下一节竹筒 ，装进适量的山兰米和水，放在火堆中烤熟，当竹筒表层烧焦时，饭就熟了。劈开竹筒，米饭被竹膜所包，香软可口，有香竹之清香和米饭之芬芳。用餐时破开竹筒取出饭，这便是有名的“竹筒香饭”。如果把猪瘦肉混以香糯米和适量盐巴放进竹筒烤成香糯饭，异香扑鼻，是招待贵宾的珍贵美食品。
香竹烤饭
香竹烤饭，是西双版纳傣族的名品，以清香浓郁，软糯洁白，形美划一，而独具一格。西双版纳傣族囱治州，是滇南粮仓。主体民族为傣族，傣族属古代百越集团，他们临水而居，是云南种植稻谷的先进民族。自古以来，他们与稻米结下了不解之缘，主食大米，向来讲究。米碾出后，必须过筛，整粒的人吃，破碎的喂牲畜。香竹饭的烹制，反映了他们的聪明才智，又适应了他们向富裕型转变的口感要求。
傣族竹筒饭
云南傣族竹筒饭是融糥米香、青竹香于一体，是色香味俱佳、最具民族特色的风味食品。是云南民族美食中比较有代表性的特色美食，主要流行于西双版纳州、德宏州、普洱地区、临沧地区等等。

毫糯索
西双版纳傣族的毫糯索，可译为紫花糯米糕，是用石梓花粉和糯米粉做成的一种糯米粑粑。一般是在傣历新年时做吃的，相当于汉族的年糕。但云南旅游景点西双版纳当地人习惯使用西双版纳傣语称毫糯索，向客人介绍时称为西双版纳傣族的年糕。这种西双版纳食品主要以糯米为原料，配以少许饭米和西双版纳旅游景点特有的野生乔木花石梓花（石梓系马鞭草科植物）以及红糖、芝麻、花生仁、猪油制作。加工过程是将米泡软，淘洗干净后打浆，用布袋装浆滤水后，拌人预先磨细的石梓花面以及红糖、芝麻、花生仁、猪油，充分揉搓，使主料与配料掺合均匀，按一两一团分团摊在抹过油的芭蕉叶片上，包成4厘米×8厘米的长方形小包，用木甑或蒸笼蒸至熟透即可食用
香茅草烤鱼
香茅草烤鱼，是云南滇南地区的一道碳烤鲜罗飞鱼菜肴，也是地道传统的一道傣族风味菜肴。主要材料有罗非鱼，辅料有葱、姜、蒜、青辣椒、芫荽。由于做法独到、香料独特、鲜香可口，在傣味菜肴中知名度非常高，是傣家人款待贵宾不可少的一道菜。
香茅草烤鸡
香茅草烤鸡是一道简单的家常菜，主料是仔鸡 1只。
剁生
剁生，是中国西南地区彝、傣、白等民族食俗。剁生是年节食品，是以生肉为菜加工拌食。制作方法是将猪肉或牛肉剁细，与葱、姜、蒜、辣椒搅拌而食。剁生具有鲜嫩等特点。
菠萝紫米饭
菠萝紫米饭是一道主食，主要食材是紫糯米、菠萝，调料为食盐、食用油等。该菜品主要是通过将食材放入锅中蒸熟的做法而制成。
南秘
南秘是一道菜品，制作材料有青菜、、竹笋、黄鳝等。
蜂蛹酱
蜂蛹酱是一道菜，制作材料有野蜂蛹、野花椒粉等。
香竹烤饭
香竹烤饭，是西双版纳傣族的名品，以清香浓郁，软糯洁白，形美划一，而独具一格。西双版纳傣族囱治州，是滇南粮仓。主体民族为傣族，傣族属古代百越集团，他们临水而居，是云南种植稻谷的先进民族。自古以来，他们与稻米结下了不解之缘，主食大米，向来讲究。米碾出后，必须过筛，整粒的人吃，破碎的喂牲畜。香竹饭的烹制，反映了他们的聪明才智，又适应了他们向富裕型转变的口感要求。
竹筒饭
竹筒饭，用山兰稻（一种旱稻）“香米”配肉类为原料，放进新鲜的粉竹或山竹锯成的竹筒中，加适量的水，再用香蕉叶将竹筒口堵严，炭火中绿竹烤焦即可。竹筒饭的煮法颇具有野炊特点，即砍下一节竹筒 ，装进适量的山兰米和水，放在火堆中烤熟，当竹筒表层烧焦时，饭就熟了。劈开竹筒，米饭被竹膜所包，香软可口，有香竹之清香和米饭之芬芳。用餐时破开竹筒取出饭，这便是有名的“竹筒香饭”。如果把猪瘦肉混以香糯米和适量盐巴放进竹筒烤成香糯饭，异香扑鼻，是招待贵宾的珍贵美食品。
炸牛皮
西双版纳的傣族特色佐酒佳肴，其口感泡脆，蘸番茄酱吃，辛香回甜，独具风味。
傣族竹筒饭
云南傣族竹筒饭是融糥米香、青竹香于一体，是色香味俱佳、最具民族特色的风味食品。是云南民族美食中比较有代表性的特色美食，主要流行于西双版纳州、德宏州、普洱地区、临沧地区等等。
毫糯索
西双版纳傣族的毫糯索，可译为紫花糯米糕，是用石梓花粉和糯米粉做成的一种糯米粑粑。一般是在傣历新年时做吃的，相当于汉族的年糕。但云南旅游景点西双版纳当地人习惯使用西双版纳傣语称毫糯索，向客人介绍时称为西双版纳傣族的年糕。这种西双版纳食品主要以糯米为原料，配以少许饭米和西双版纳旅游景点特有的野生乔木花石梓花（石梓系马鞭草科植物）以及红糖、芝麻、花生仁、猪油制作。加工过程是将米泡软，淘洗干净后打浆，用布袋装浆滤水后，拌人预先磨细的石梓花面以及红糖、芝麻、花生仁、猪油，充分揉搓，使主料与配料掺合均匀，按一两一团分团摊在抹过油的芭蕉叶片上，包成4厘米×8厘米的长方形小包，用木甑或蒸笼蒸至熟透即可食用
香茅草烤鱼
香茅草烤鱼，是云南滇南地区的一道碳烤鲜罗飞鱼菜肴，也是地道传统的一道傣族风味菜肴。主要材料有罗非鱼，辅料有葱、姜、蒜、青辣椒、芫荽。由于做法独到、香料独特、鲜香可口，在傣味菜肴中知名度非常高，是傣家人款待贵宾不可少的一道菜。
香茅草烤鸡是一道简单的家常菜，主料是仔鸡 1只。
傣族烧鱼
西双版纳的傣族村寨美食。 鱼打理好后，配上葱、姜、蒜、辣椒面及香茅草、槟榔青、野芫荽、盐巴果、小米辣，可煎、炸、蒸、煮、烧烤、腌、熏。尤以包烧鱼和竹筒烧鱼、烤鱼、酸鱼、鱼剁生、“臭”鱼
*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const xishuangbannaFoodsList = [
  // 灯影牛肉
  {
    province: '云南省', // 省
    city: '西双版纳傣族自治州', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'yunnanCuisine', // 菜系编码
    cuisineCategoryName: '滇菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '云南省', // 省
    city: '西双版纳傣族自治州', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'yunnanCuisine', // 菜系编码
    cuisineCategoryName: '滇菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
