/**
 * 保定小吃
 * 大慈阁香油大慈阁以“市阁凌霄”之美誉位居“上谷八景”之首，故有“不到大慈阁，何曾到保定”之说。
 * 大慈阁自古为佛教圣地，现为全国重点文物保护单位。大慈阁香油始于南宋宝庆三年（公元 1227 年），原产自大慈阁禅院内的香油坊。
 * 清乾隆三十年（公元 1765 年），在乾隆皇帝途经保定时，因机缘际会，大慈阁香油被乾隆皇帝钦点为御用膳食。
 * 秉承古寺悠久历史，大慈阁香油选料上乘、做工严谨，以精选芝麻为原料，利用小石磨采用特殊工艺加工制作，保持了芝麻香油的古朴风味，其颜色呈棕红色，清澈透亮，味香持久。
 * 大慈阁香油历代薪火相传，虽岁月变迁，但其风味依旧。
 * 大慈阁香油以其厚重的历史文化底蕴和优秀的内在品质饱经岁月洗礼并传承至今，成为古城保定传统素食文化之瑰宝。
 * 大慈阁素面大慈阁素面始于南宋宝庆三年（公元 1227 年），原产自河北省保定市大慈阁禅院的斋堂，距今已有八百年历史。大慈阁素面属于佛素范畴，即寺庙里的素斋，注重清淡、善巧。
 * 大慈阁素面有养眼之面、开胃之面、印心之面之美称。
 * 养眼之面：面相好是大慈阁素面首个标准，大慈阁素面强调外观摆型、颜色搭配。
 * 面白、汤棕，配上绿菜、番茄、香菇，增进食欲。
 * 开胃之面：主要在汤料的熬制，俗话说：面在味，味在汤，汤显功。
 * 味道即王道，面汤要熬，辅以养生的枸杞、大枣、当归、姜丝等味料，经过文武火数小时的交融煮制，辅料完全释放汤中，浓醇深厚，形成大慈阁素面独具匠心之味。
 * 印心之面：好面自有好滋味，大慈阁素面之面粉取自麦心而成，根根劲道爽滑，加之配以大慈阁自产的大慈阁香油、大慈阁麻酱做调味品其回味无穷。
 * 大慈阁酱菜大慈阁酱菜是保定久负盛名的特色小吃，有着悠久的历史。大慈阁酱菜始于南宋宝庆三年（公元 1227 年）。
 * 清乾隆三十年（公元 1765 年），大慈阁酱菜被乾隆皇帝品尝后大加赞赏，遂钦点大慈阁酱菜为御用膳食。大慈阁酱菜为传统工艺酱制，做工精细、用料考究。
 * 大慈阁酱菜购进原料，务求精良，不惜重价。如收购小红萝卜，论个给价，但必须保持嫩脆。收购韭菜花，则要鲜嫩的纯花，不带花籽、花铃。
 * 但收购价格往往要高于普通韭菜花的一倍。这样的原料制成的成品，质优则无柴，食之无渣滓。
 * 大慈阁酱菜为保证口味纯正，其售卖环节要求严格，酱菜要存放在酱缸内，售卖多少出缸多少，从出缸到顾客手中都在很短的时间内完成。
 * 大慈阁酱菜营养丰富、品种众多，有大慈阁酱包瓜、大慈阁酱八宝菜、大慈阁酱黄瓜、大慈阁酱子萝、大慈阁酱地露、大慈阁酱五香疙瘩头、大慈阁酱花生仁等三十个品种。
 * 数百年来大慈阁酱菜既保留了自己北方风味的优良传统，又逐步吸收南方酱菜特长，形成自己独有的生产工艺，始终保持着甜、咸、嫩、脆，酱香浓郁的老辈子口味。
 * 大慈阁糕点大慈阁糕点始于南宋宝庆三年（公元 1227 年），创始人是元朝蔡国公张柔麾下的部将何伯策。
 * 大慈阁糕点虽历史久远、世代相传、味美色佳、独具风味，但在历史上最初只有皇帝、大臣、大慈阁僧众等少数人才能享用。
 * 大慈阁糕点有外用糕点、内用糕点两大类，讲究现吃现烤，味美色佳、独具风味。外用糕点主要用于进贡、馈赠、恩赏等。
 * 内用糕点分为应时糕点、常年糕点、到门糕点、宴席糕点、节用糕点五类，各类皆独具特色。
 * 应时糕点是根据花卉开放季节而制作，有春季的藤花饼、百合饼；夏季的薄荷饼、绿豆饼；秋季的菊花饼、桂花饼；
 * 冬季的萝卜饼、豆沙饼等。常年糕点有大酥合、菊花酥、百合酥等。
 * 到门糕点是专作宾客上门款待用，如一口盅、棉花糖。宴席糕点是根据宴席的性质而做，如寿宴用“寿”字饼、“如意”饼等。节日糕点有元宵、月饼等。
 * 大慈阁糕点是历代劳动人民智慧的结晶，是中华传统饮食文化中的瑰宝。
 * 漕河驴肉火烧漕河驴肉是华北名吃，其特点是大块成形，呈典型肉红色，香味浓郁，表里如一，酥软适口，别具风味。
 * 据传，宋时漕河码头存在漕帮盐帮两个帮会。漕帮以运粮为业，盐帮以运盐为业。双方为称霸码头，时常大动干戈，终以漕帮大胜收局。
 * 漕帮俘获盐帮驮货毛驴无法处理，便宰杀炖煮，设庆功宴，夹以当地驴肉火烧，饶有滋味。自此，漕河驴肉兴起，稀世名吃由此诞生。
 * 当地形成吃驴肉火烧的习惯。更探索出一套精湛的驴肉加工密技。漕河驴肉就是这样产生的，并在徐水流行开了。
 * 康熙下江南途径徐水，饱尝漕河驴肉火烧赞不绝口，遂即引入宫中。经年累月，漕河驴肉声名远扬，客人来徐不吃漕河驴肉等于虚此一行。
 * 漕河驴肉的主要吃法是漕河驴肉火烧。
 * 漕河驴肉火烧制作技艺：
 * （一）打火烧：火烧所用的面为死面，揉好面后，取适量揉成小馒头一样的面团，然后用擀面杖擀成圆形，放到平底锅里烙，温度不能太高。
 * 等火烧基本熟透后，把它放到火烧叉上放进平底锅下的炉灶中，炉灶是特制的，火烧可以接触更高的温度，却不接触明火。不多久，火烧外面就会有一层酥脆的外皮，咬到嘴里十分的香脆。（
 * 二）夹火烧：选用大块成形的漕河驴肉。接着在专门的菜墩上切碎，这种菜墩一般为圆形，四周高，中心凹，像一个浅浅的漏斗一样。
 * 在剁肉的过程中，如果客人要求，还会将特质的青辣椒切到驴肉里，但驴肉火烧里一定不能加香菜，否则会遮了驴肉的正味。另外如果客人有要求，还会加入些驴板肠，板肠为驴的大肠，卤制后口味独特，从旁边一直小火煨着的锅里，盛出一勺驴肉汤，浇在肉上，然后麻利地划开火烧的一边，把肉、肠等塞到火烧里边。一个香喷喷的驴肉火烧便大功告成了。
 */
import { lampshadedBeefScriptsList } from './hebeiFoodScriptContent/lampshadedBeef';
export const hebeiFoodsList = [
  // 圣旨骨酥鱼-邯郸小吃
  {
    province: '河北省', // 省
    city: '邯郸市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '圣旨骨酥鱼', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 灯影牛肉
  {
    province: '海南省', // 省
    city: '三沙市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '海南省', // 省
    city: '三沙市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
