/*
 * @Author: vigne 1186963387@qq.com
 * @Date: 2024-02-04 10:24:16
 * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/config copy.ts
 * @Description: 不清楚的菜单
 *
 * Copyright (c) 2024 by ${git_name_email}, All Rights Reserved.
 */

// 四川： 凉山坨坨肉,阴酱鸡,跶跶面,木桶鱼,红烧肥肠,梓潼片粉,梓潼镶碗,梓潼酥饼,北川腊肉,虎皮羊肠,鲜溜鸡丁,葱香鲫鱼,太伏火腿,泸州葡萄仿,龙眼酥,腊肠,东坡鱼,钵钵鸡,金丝牛肉,南溪豆干,鸭儿粑,柏溪潮糕,糟蛋,宜宾燃面,麻辣烫,钵钵鸡,豆腐脑,炸串串,粉蒸牛肉,糯米蒸排骨,白宰鸡,蜂窝土豆,鱼翅芙蓉包,开花白糕,灯草糕,担担面

// 未知地方：[ "酸辣士豆丝", "香辣鸡腿堡", "提拉米苏", "牛排", "骨肉相连酸甜士豆", "椒盐水煮鱼", "秦川黄牛肚", "香酥大鲫鱼", "黄金龙骨", "火锅卤肥肠", "大片牛腱牛肉面", "真空烤卤鸭舌", "果木风味鸡腿堡", "盘龙东星斑", "血旺烤鱼", "香醋黃瓜", "牛肉船面", "牛肠锅", "松针鲜肉包", "白玉爆浆麻礨芥末半熟牛肉", "菇金酱烤鸡翅", "芥末手剥鸭掌", "芋头煎蟹", "水瓜炆白贝", "野萃牛油果卡士红糖糍粑", "酥肉", "超级芝士脆", "玉米虾仁饭", "小黄鱼焖豆腐", "香醋黄瓜", "牛肉咔饼", "红酒泡牛仔粒", "厚切酱烤牛舌串", "麻辣参猪肚鸡", "红米海皇粉", "糖烤猪五花小炒肉", "热干面", "黑胡椒西冷牛排", "小炒鲜黄牛肉", "鸡肉辛拉面4", "弹豆千", "飘香牛肉饼", "金丝川香牛肉饼", "江湖味牛肉", "香菇焖饼", "热炒火爆虾", "松茸鼎汤墨鱼元泰式酸辣虾", "古早红糖糍杷台", "烤牛肉塔可", "绝味鱼头", "芥沫手剥鸭掌", "小罐牛排肉", "桃胶珍菌卤味饭", "姜公吕望烤鳗鱼酸菜鱼", "腊味煲仔饭", "原味椰子鸡", "啫肥肠", "酸甜土豆", "谷饲板健牛扒", "醋猪手", "香酥大鯽鱼", "芥沫半熟牛肉", "黄金酱烤鸡翅", "百味天妇罗", "牛肉拉肠", "生态竹笙椰子鸡红糖糍粑", "虾滑", "炸酥肉", "蛋炒饭", "咸蛋黄蟹", "黑胡椒小猪肉", "辣卤脆莲藕片", "糯米脆皮鸭", "海味豆汤饭", "嗄嗄糯香掌", "豆花渎鱼", "酸臭丸子", "火锅肥肠包肉夹馍", "烤羊肉串", "涼皮", "红豆冰沙豆腐花", "牦牛头肉", "酱香牛尾", "厚芋泥麻薯", "葱香鱼头", "古法胡羊焖饼", "肥牛蟹籽饭", "疙瘩筋牛", "樱花虾灼菜心锅包肉", "麻辣烫", "冷面", "奶香芝士玉米粒", "水煎蔬菌", "脆皮菠萝包", "黑鸭翅中", "酸汤谷饲肥牛煲", "牛油辣和骨汤", "冰鲜板健牛排", "牛舌佐芥沫黄酱", "芥沫海苔冰淇淋" ]
