// /*
//  * @Author: vigne 1186963387@qq.com
//  * @Date: 2023-10-20 16:03:40
//  * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/sichuanProvince/name.js
//  * @Description:
//  *
//  * Copyright (c) 2023 by ${git_name_email}, All Rights Reserved.
//  */
// // ### 菜肴

// // ### 小吃

// 水煮肉片,鱼香肉丝,回锅肉,盐煎肉,宫保鸡丁,干煸鳝片,辣子鸡丁,辣子肥肠,麻婆豆腐,水煮鱼,泡椒肉丝,青椒肉丝
// 干烧岩鲤,干烧桂鱼,廖排骨,鱼香肉丝,怪味鸡,宫保鸡丁,粉蒸牛肉,麻婆豆腐,毛肚火锅,干煸牛肉丝,夫妻肺片,灯影牛肉,担担面,赖汤圆,龙抄手
// 鱼香肉丝,宫保鸡丁,夫妻肺片,麻婆豆腐,回锅肉,东坡肘子,
// 香橙虫草鸭,醪糟红烧肉,刘公雅鱼
// 开水白菜,青城山白果炖鸡,夫妻肺片,蚂蚁上树,蒜泥白肉,芙蓉鸡片,锅巴肉片,白油豆腐,烧白（咸烧白,甜烧白）,鱼香系列（肉丝,茄子）,鲃泥鳅系列（石锅鲃泥鳅）,盐煎肉,干煸鳝片,鳝段粉丝,酸辣鸭血,东坡肘子,东坡墨鱼,清蒸江团,跷脚牛肉,西坝豆腐,魔芋系列（雪魔芋,魔芋烧鸭）,串串香,冷锅鱼,简阳羊肉汤,干烧岩鲤,干烧桂鱼,雅安雅鱼全席宴
// 四川泡菜系列,凉粉系列（川北凉粉,伤心凉粉）,川北米粉（如绵阳米粉,绵竹羊肉粉）,红薯粉系列（酸辣粉,肥肠粉）,锅盔系列（卤肉锅盔,肺片锅盔等）,豆花系列（泉水豆花,谭豆花,牛肉豆花,馓子豆花,冰醉豆花,酸辣豆花）,面食系列（担担面,香辣牛肉面）,青城山老腊肉,川式香肠,蛋烘糕,银鱼烘蛋,叶儿耙,黄耙,丁丁糖,三大炮,泡椒凤爪,冒菜,盐边牛肉,冷锅串串,盐包蛋,乐山甜皮鸭/彭山甜皮鸭,怪味鸡块,棒棒鸡,百味鸡,青椒鸡,九味鸡,钵钵鸡,盐水鸭,夫妻肺片
// 火鞭子牛肉,冷吃兔,冷吃牛肉
// 富顺豆花,跳水鱼,鲜锅兔,鲜椒兔,牛佛烘肘,梭边鱼火锅
// 资中球溪河鲶鱼
// 宜宾燃面,竹海名菜,李庄白肉,叶儿粑,泥溪芝麻糕,柏溪潮糕,兔火锅,
// 白糕,伦敦糕,黄粑,猪儿粑,窖沙珍珠丸,两河桃片,合江烤鱼,姜氏卤菜一绝,老牌鸭子,朱氏杂酱
// 酸菜鱼,毛血旺,灯影牛肉,口水鸡,干菜炖烧系列（多以干豇豆,干烧岩鲤为主）,水煮肉片和水煮鱼
// 辣子田螺,豆瓣虾,香辣贝和辣子肥肠
// 泉水鸡,烧鸡公,芋儿鸡和啤酒鸭
// 酸辣鱿鱼卷,酸辣鱼片；烩菜如酸辣汤,酸辣烩鸡血
// 干烧岩鲤,干烧桂鱼,鱼香肉丝,廖排骨,怪味鸡,宫保鸡丁,五香卤排骨,粉蒸牛肉,麻婆豆腐,毛肚火锅,干煽牛肉丝,灯影牛肉,担担面,赖汤圆,龙抄手
// 鱼香肉丝,宫保鸡丁,夫妻肺片,麻婆豆腐,回锅肉,东坡肘子,开水白菜
// 麻婆豆腐,宫保鸡丁,青城山白果炖鸡,夫妻肺片,蚂蚁上树,蒜泥白肉,芙蓉鸡片,锅巴肉片,白油豆腐,烧白（甜烧白）,鱼香系列（肉丝,茄子）,鲃泥鳅系列（石锅鲃泥鳅）,盐煎肉,干煸鳝片,鳝段粉丝,酸辣鸭血,冷锅鱼,甜皮鸭,东坡肘子,东坡墨鱼,清蒸江团,跷脚牛肉,西坝豆腐,魔芋系列（雪魔芋,魔芋烧鸭）,简阳羊肉汤,雅安雅鱼全席宴
// 串串香
// 盆盆鸡
// 麻辣火锅,酸菜鱼,辣子鸡,麻辣鱼,酸萝卜老鸭汤,泡椒系列,牛尾汤,豆花饭,陈皮兔丁,烧白,灯影牛肉,合川肉片,蒜泥白肉等等,辣子鸡,辣子田螺,辣子肥肠,豆瓣虾,香辣贝
// 泡椒牛蛙,泡椒墨鱼仔,泡椒兔,泡椒黄喉
// 美蛙鱼头,石锅鱼
// 酸菜鱼,酸菜鸡
// 水煮肉片和水煮鱼
// 泉水鸡,烧鸡公,芋儿鸡和啤酒鸭
// 青（尖）椒鸡,青（尖）椒兔,青（尖）鱼
// 万州烤鱼,纸包鱼
// 重庆酸辣粉,凉面,口水鸡,格格,涪陵油醪糟,涪陵榨菜,达州包面,七星椒,大风羊肉,石梯蒸鱼,手撕鸭,江阳酸辣鸡,尖椒肥肠,面筋团,干烧岩鲤,永川豆豉,忠县豆腐乳,合川桃片,江津米花糖,灯影牛肉,鬼城麻辣鸡块,吴抄手,鸡丝凉面,碗杂面,老麻抄手,泡椒凤爪
