/*
 * @Author: vigne 1186963387@qq.com
 * @Date: 2023-10-24 17:34:15
 * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/sichuanProvince/others.ts
 * @Description:
 *
 * Copyright (c) 2023 by ${git_name_email}, All Rights Reserved.
 */
/**
 * 四川省-未知城市-美食

盐煎肉,干煸鳝片,辣子鸡丁,辣子肥肠,泡椒肉丝,青椒肉丝,干烧桂鱼,廖排骨,怪味鸡,粉蒸牛肉,毛肚火锅,干煸牛肉丝,夫妻肺片,担担面,赖汤圆,龙抄手,东坡肘子,香橙虫草鸭,醪糟红烧肉,刘公雅鱼,开水白菜,青城山白果炖鸡,蚂蚁上树,蒜泥白肉,芙蓉鸡片,锅巴肉片,白油豆腐,烧白（咸烧白,甜烧白）,鱼香系列（肉丝,茄子）,鲃泥鳅系列（石锅鲃泥鳅）,鳝段粉丝,酸辣鸭血,清蒸江团,跷脚牛肉,魔芋系列（雪魔芋,魔芋烧鸭）,串串香,冷锅鱼,雅安雅鱼全席宴,四川泡菜系列,凉粉系列（川北凉粉,伤心凉粉）,川北米粉（如绵阳米粉,绵竹羊肉粉）,红薯粉系列（酸辣粉,肥肠粉）,锅盔系列（卤肉锅盔,肺片锅盔等）,豆花系列（泉水豆花,谭豆花,牛肉豆花,馓子豆花,冰醉豆花,酸辣豆花）,面食系列（担担面,香辣牛肉面）,川式香肠,蛋烘糕,银鱼烘蛋,黄粑,丁丁糖,三大炮,泡椒凤爪,盐边牛肉,冷锅串串,盐包蛋,乐山甜皮鸭,怪味鸡块,百味鸡,青椒鸡,九味鸡,盐水鸭,火鞭子牛肉,冷吃牛肉,跳水鱼,鲜锅兔,鲜椒兔,牛佛烘肘,梭边鱼火锅,资中球溪河鲶鱼,泥溪芝麻糕,柏溪潮糕,兔火锅,白糕,伦敦糕,黄粑,猪儿粑,窖沙珍珠丸,两河桃片,合江烤鱼,姜氏卤菜一绝,老牌鸭子,朱氏杂酱,毛血旺,干菜炖烧系列（多以干豇豆,干烧岩鲤为主）,辣子田螺,豆瓣虾,香辣贝,烧鸡公,芋儿鸡,啤酒鸭,酸辣鱿鱼卷,酸辣鱼片,烩菜如酸辣汤,酸辣烩鸡血,五香卤排骨,干煽牛肉丝,烧白（甜烧白）,盆盆鸡,麻辣火锅,麻辣鱼,酸萝卜老鸭汤,泡椒系列,牛尾汤,豆花饭,陈皮兔丁,合川肉片,泡椒牛蛙,泡椒墨鱼仔,泡椒兔,泡椒黄喉,美蛙鱼头,酸菜鸡,青（尖）椒鸡,青（尖）椒兔,青（尖）鱼,万州烤鱼,纸包鱼,重庆酸辣粉,凉面,格格,涪陵油醪糟,涪陵榨菜,达州包面,七星椒,手撕鸭,面筋团,永川豆豉,忠县豆腐乳,合川桃片,江津米花糖,鬼城麻辣鸡块,吴抄手,鸡丝凉面,碗杂面,老麻抄手,手撕牛肉,香辣跳跳蛙
*/
// import { groupBy } from '/@/utils/general';
// import { lampshadedBeefScriptsList } from './othersFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const othersFoodsList = [];
// const list = await groupBy(othersFoodsList, 'city');
// console.log('groupBy(othersFoodsList)：', list);
