/**
 * 四川-攀枝花市-特产美食
 * 特产：
 * 美食：盐边桑椹
盐边桑椹，四川省攀枝花市盐边县特产，全国农产品地理标志。盐边桑椹果实较大，椭圆形，表面不光滑，黑紫色，色泽稳定，干品仍呈黑紫色，果汁多，甜而带有微酸味，营养丰富，富含氨基酸、维生素、β-胡萝卜素及花青素等。2013年12月30日，原中华人民共和国农业部正式批准对“盐边桑椹”实施农产品地理标志登记保护
米易红糖
米易红糖，四川省米易县特产，中国国家地理标志产品。米易县域内安宁河和雅砻江与白坡山和龙肘山相向纵穿南北，形成了两山带两水、北高南低、东西横断的自然地理风貌。处于河谷地带的区域更是天然的“大地温室”和全国少有的热作区之一。由于气候、水文等自然条件的独特优势，形成了米易得天独厚的甘蔗生长环境，这也成为了
米易山药
米易山药，四川省攀枝花市米易县特产，全国农产品地理标志。米易山药是米易县特色蔬菜农产品之一，是米易县的特色农业。米易山药产区地处青藏高原东南缘，海拨980-1600米，平均海拔1290米。米易山药表皮光滑，断层白色，无气味，质地脆嫩，味淡，无涩味，有粘性。2013年12月30 日，原中华人民共和国农
米易枇杷
米易枇杷，四川省攀枝花市米易县特产，中国国家地理标志产品。米易枇杷果大厚实，果形整齐均匀，果面呈金黄色或橙红色、色泽鲜艳、果皮薄、毛茸多、锈斑少，果肉细腻、软滑爽口、甜味浓厚、汁多鲜美；果肉、果汁中还富含多种维生素、蛋白质、纤维素以及钙、磷、钾、铁等营养物质。2017年11月，原国家质检总局批准对“
盐边油底肉
盐边油底肉，四川省盐边县特产，中国国家地理标志产品。远古，居住在“笮都夷”的笮人，为在炎热的夏季防止猪肉腐烂变质，研制盐边油底肉；盐边油底肉因绿色无污染，色泽鲜明、醇香浓郁、口感滋糯，耙而不酥、肥而不腻、软而不绵、开胃健脾，具有独特而浓郁的原始肉香。2012年12月26日，原国家质检总局批准对“盐边
米易苦瓜
米易苦瓜，四川省攀枝花市米易县特产，全国农产品地理标志。米易苦瓜是米易县主要蔬菜品种之一，长期以来在米易县境内安宁河谷流域海拔1500米以下地区种植，已有近70年的历史。米易苦瓜产区位于米易县安宁河谷地带，地形以“U”型河谷平坝和低山阶地为主，海拔高度988-1300米。米易苦瓜长圆筒型，瓜乳白色，
攀枝花枇杷
攀枝花枇杷，四川省攀枝花市米易县特产，全国农产品地理标志。攀枝花枇杷产自攀枝花市海拔1300—1700米的地区，产品于元旦、春节期间上市，主要生产的品种以“早钟六号”、“大五星”等大果型品种为主。攀枝花枇杷果大，卵圆形或长卵圆形，果皮橙黄色，果点密、细、果面光洁，富有果粉与茸毛，果锈极少，具有肉质细
攀枝花块菌
攀枝花块菌，四川省攀枝花市特产，中国国家地理标志产品。松露系国际通用名，又名块菌，是寄生在华山松、栎类植物根部的一种真菌，俗称无娘藤、无娘果、猪拱菌等。欧洲人将松露与鱼子酱、鹅肝并列“世界三大珍肴”，被追捧者称为“来自天堂的味道”，是世界珍稀宝贵的地下真菌资源。在中国，松露主要分布在云南及四川的攀西
中坝草莓
中坝草莓，四川省攀枝花市仁和区特产，全国农产品地理标志。20世纪80年代初，由攀枝花市仁和区中坝乡中坝村孟古桥村民组村民黄兴帮、杨明礼等经人介绍引进草莓进行试种，已有30余年历史。中坝草莓果形大、纺锤形；萼片大、反卷；果面鲜红色、有光泽，种子黄色、微凹；髓心白色、中空；果肉粉红色、肉质细、致密；味浓
攀枝花芒果
攀枝花芒果，四川省攀枝花市仁和区特产，全国农产品地理标志。攀枝花地处北纬26°，地处西南内陆地区，属于南亚热带干热河谷气候，具有“南方热量，北方光照”的优越条件，地貌类型复杂多样，以山地为主。这样的海拔与地势利于芒果吸收光热，山地种植的通风透光条件好，利于传粉坐果。种植出的芒果具有甜大鲜的特点。攀枝
盐边羊肉米线
攀枝花小吃类主要以四川味道为主，在当地人气最高的当属盐边县的羊肉米线，纯羊肉熬制的高汤煮出的米线，再加上豆瓣 花椒 小米辣等佐料，味道独特极具代表性；攀枝花由于靠近云南在这里米线的受欢迎程度远远高于面条，大街小巷的小吃店都有米线卖，牛肉米线 肥肠米线 杂酱米线 等别具攀枝花本地特色；各种四川知名小吃
箐河浑浆豆花
箐河浑浆豆花是一道四川攀枝花的地方特色小吃，具有味醇、鲜嫩、色白且略有回甜的特点。
红格脐橙
红格脐橙，四川省攀枝花市盐边县特产，全国农产品地理标志。红格镇是攀西脐橙、椪柑生产基地，这里多为山地，日照强，生产的水果甜味浓，受到消费者喜爱。红格脐橙成熟期早，果皮橙黄色，果面光洁，油胞细腻，皮薄。肉质脆嫩化渣，味浓甜，香气浓郁。2010年11月15日，中华人民共和国农业部批准对“红格脐橙”实施农
盐边西瓜
盐边西瓜，四川省攀枝花市盐边县特产，全国农产品地理标志。盐边西瓜产区海拔落差大，地形由西北向东南倾斜，山脉走向以东西走向为主，地势崎岖，山高谷峡，溪流交错，岭峰连绵。盐边西瓜最适生长海拔1300米左右，产区土壤以沙壤土为主，pH值5.0-6.5，微酸性，有机质含量高，适合西瓜种植。盐边西瓜果形近圆形
没有更多词条了~

 */

import { lampshadedBeefScriptsList } from './panzhihuaFoodScriptContent/lampshadedBeef';
export const panzhihuaFoodsList = [
  // 灯影牛肉
  {
    province: '四川省', // 省
    city: '攀枝花市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: 'lampshadedBeef', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceName: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '四川省', // 省
    city: '攀枝花市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: 'lampshadedBeef', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceName: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
