/**
 * 河南-安阳市-特产美食
特色餐饮
道口烧鸡 [19]、老庙牛肉 [19]、安阳三熏 [19]、曹马芝麻糖、三不沾 [19]、安阳燎花 [19]。
地方小吃
扁粉菜、粉浆饭、安阳烩菜 [19]、皮渣 [19]、血糕、内黄灌肠、关家酥烧饼。安阳血糕等
道口烧鸡
道口烧鸡是河南省安阳市的特色传统名菜之一，被誉为中华第一鸡。该菜品由安阳市滑县道口镇“义兴张”世家烧鸡店所制，是我国著名的特产。 道口烧鸡与北京烤鸭齐名。用多种名贵中药，辅之陈年老汤，其成品烧鸡色泽鲜艳，形如元宝，口衔瑞蚨。极具食疗和保健功能。创业于清朝顺治十八年（1661年），已有三百多年的历史，开始制作不得法，生意并不兴隆，后从清宫御膳房的御厨那里求得制作烧鸡秘方，做出的鸡十分香美。道口烧鸡的制作技艺历代相传，形成自己的独特风格。1981年被商业部评为全国名特优产品。豫北滑县道口镇，素有"烧鸡之乡"的称号。"义兴张"的道口烧鸡，像北京烤鸭一样，在全国食品中独占鳌头，并且誉满神州，名扬海外。
安阳蓼花
安阳蓼花是一道美味可口的特色传统名点。造型美观，色泽金黄，剖面洁白，状如蜂巢，外撒对丝，颇似盛开之蓼花，故名蓼花。落口酥脆焦甜，营养丰富，绵软易消化，老少咸宜，被视为节日待客、馈赠亲友的佳品。安阳蓼花源于江南，迄今已有近200年的历史，据传清代时，浙江一位姓吴的糕点名师赴京途中因病滞留安阳，经当地人精心治疗与调理使之很快恢复健康。他被安阳的淳厚民风所感动，于是就在安阳定居下来，同时也把制作蓼花的技艺传出来。
扣碗酥肉
扣碗酥肉是一道河南安阳的名菜，属于豫菜，是安阳当地饮食的代表菜品，其特点是香酥、嫩滑、爽口、肥而不腻，选用猪上身精肉，肥瘦相间。扣碗酥肉的做法历史悠久，以五花肉为主要材料，烹饪的做法蒸菜为主，口味属于咸鲜，口味偏淡。
内黄灌肠
内黄灌肠是河南省安阳市内黄县的一种传统特色小吃，属于豫菜系，该菜品已纳入安阳市非物质文化遗产。蒜灌肠色泽粉红，味道清淡，趁热吃最佳，吃起来入口光滑，香辣韧软，软而不粘，香而不腻。它是以猪血、猪肠、面粉、香油、五香料为主要原料所制成。灌肠起源在清咸丰年间，由县城邱姓屠户发明。灌肠以猪血、猪肠、面粉、香油、五香料为主要原料精制而成，可以凉调，叫筲灌肠；可以煎食，叫煎灌肠。味美可口、风味独特，且有补血、健脾、壮筋骨、消滞之功效，很受群众欢迎。有民谣《内黄灌肠》曰：“肠子猪血白面灌，小刀一拉下煎盘，小铲儿一翻撮一碗，肚里不饥能解谗。”
安阳烩菜
安阳烩菜是河南省安阳市的一种特色名吃，属于豫菜。安阳烩菜的种类有六七种之多。既有用料考究、制作精细的“海烩菜”、“上烩菜”；也有选料普通、价格便宜的“行烩菜”；还有用料简单的“扁粉菜”；又因使用烹调器皿不同而派生出的“沙锅豆腐”、“沙锅海烩”。安阳烩菜因种类繁多、配料精当、汤醇味美、营养丰富成为地方名菜。
血糕
血糕是河南省安阳市的特色小吃之一，该菜品和皮渣、粉浆饭合称安阳的"三大宝"。始于清乾隆年间。用荞麦面、猪血加调味料蒸制，食时切片油煎，抹上蒜泥，香辣鲜美。安阳血糕营养丰富，酥香适口，味道鲜美，经济实惠，风味独特，深受当群众和外地游客的欢迎。
锦泰燎花
锦泰燎花是河南省安阳市的传统名点。自从明朝万历年间“燎花”问世后，远近知晓，供不应求。后由当地的“锦泰”字号大量生产，成为人们馈赠亲友的佳品。清潮乾隆26年，皇帝途经彰德府(今河南安阳市)，燎花被进献给皇帝，乾隆吃后大悦，钦定为贡品。自此，“锦泰燎花”驰名省内外。
临淇水煎包
临淇水煎包是河南省安阳市林州市临淇镇的特色小吃。临淇水煎包，因兼得水煮、汽蒸、油煎之妙，色泽金黄，一面焦脆，三面软嫩，其脆而不硬，香而不腻，味道鲜美极致。
秦氏熏肉
秦氏熏肉是一道色香味俱全的名肴，属于豫菜系。说起熏肉，古已有之，纵观中国古代饮食，早在唐代以前，“炙品”就在菜肴中占有很大的比重。但值得一提的是安阳地方特色“三熏”的代表作之一“秦氏熏肉”。据传清高宗乾隆十五年（1750年）间，乾隆皇帝巡幸河南嵩山，途经安阳小憩，进膳时对当地官员进奉的一道菜“熏肉”赞不绝口。至此“秦氏熏肉”在民间广为传扬。
扁粉菜
扁粉菜是河南省安阳市的特色传统小吃之一，属于豫菜系。是安阳居民最爱吃的饭菜之一。扁粉菜以红薯粉条做主料，配以青菜、豆腐、猪血等，在一口大铁锅中熬煮。扁粉菜的关键是大骨高汤，高汤味道的好坏，直接影响扁粉菜的整体味道。因此，安阳扁粉菜经营者一直在大骨高汤的做法上下功夫，使扁粉菜味道不断改善。吃扁粉菜的精髓在于辣椒油，辣椒要香而微辣。
皮渣
皮渣又称“渣”是发源于河南安阳和河北邯郸的一种特色地方菜，河南安阳、冀西南以及周边各县市的婚宴三下锅文化、三道饭文化、八大碗菜系均使用皮渣作为主要食材，是独具地方特色菜肴。此菜可煎可烩，炒菜做汤，味美可口，别有风味。口感筋道、香而不腻、后味绵长。作为淀粉的再加工副食，在粉条的加工过程中配调味料后盛如模具定形而成，也有用粉条进行二次煮食后加入海米，葱花、蒜片、姜末、酱油等，加水搅拌蒸制而成。
八宝布袋鱼
八宝布袋鱼，是以鲤鱼、姜醋汁为原料制作的一道菜品，属于豫菜系。
牛屯火烧
火烧是豫北地区独有的一种传统小吃。而安阳市滑县牛屯火烧在火烧家族中一枝独秀。牛屯火烧似烧饼而比烧饼大，像肉盒而比肉盒焦，浑圆如饼、色如紫铜、中间鼓凸、层次分明，素以个大肉多、外焦里嫩、香而不腻、食用方便而备受食客青睐。
万古羊肉卤
万古羊肉卤，是以羊肉、醋液、大料等为原料制作的一道菜品。
三不粘
三不粘，又称三不沾、桂花蛋，是由鸡蛋、淀粉和糖与水混合制成。其不仅色泽金黄，而且味道鲜美。更神奇的是它不粘盘子、筷子和牙齿。所以叫“三不粘”，其色泽金黄，鸡蛋又嫩又甜，味道鲜美营养丰富，特别适合老人和幼儿食用。三不粘是用鸡蛋、淀粉、白糖加水搅匀炒制成的，不仅色彩金黄，味道甘美，更令人称奇的是它不粘盘子、不粘筷子、不粘牙齿，这也正是它为什么叫“三不粘”的缘由。
曹马芝麻糖
曹马芝麻糖是河南安阳县崔家桥乡曹马村传统的名吃，当地芝麻糖闻名全国，其独特技艺已历五百余年。这种芝麻糖质地细腻，酥、薄、轻、空、无渣适口，不粘牙，不粘手。 已载入《河南省企业录》
五香豆沫
五香豆沫是河南省安阳市的传统特色小吃，属于豫菜系；汤食熬制豆沫以小米为主料，与花椒、茴香一起用冷水泡发，加水调磨成糊状米汁。上锅兑水，下入花生仁、黄豆瓣、海带丝、粉条、精盐等，开锅后倒入米汁，边倒边搅动，见锅再开，立即压火，并放入豆腐丝、胡萝卜丝、菠菜、炒芝麻等即成。成品豆沫，糊色乳黄，红绿分明，各种调料咀嚼生香，略透麻辣。
安阳相州皮渣
安阳皮渣是河南省传统的地方名菜，属于豫菜系。安阳“三大宝”之一。成品其色微碧，呈半透明状，触之柔软而有弹性，闻之浓香扑鼻，口感爽滑、筋道。主要以粉条为主，加上大葱、大蒜、荤油、精盐、香油、虾皮、红薯淀粉、猪油、姜末等制作而成。
粉浆饭
粉浆饭是河南省安阳市和山西省运城市夏县的著名小吃，河南做法：用绿豆制作粉皮粉条后的余汁，加小米、黄豆、花生米、白菜、猪油熬制，再加香油、香菜，食之有一股独特的酸、香、甜、绵的味道。是安阳


*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const anyangFoodsList = [
  // 灯影牛肉
  {
    province: '河南省', // 省
    city: '安阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'henanCuisine', // 菜系编码
    cuisineCategoryName: '豫菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '河南省', // 省
    city: '安阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'henanCuisine', // 菜系编码
    cuisineCategoryName: '豫菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
