/**
 * 河南-洛阳市-特产美食
洛阳水席
河南省洛阳市一带特色传统宴，属于豫菜系。
四镇桌
燕菜、葱扒虎头鲤、云罩腐乳肉、海米升百彩。
八大件
快三样、五柳鱼、鱼仁、鸡丁、爆鹤脯。
四扫尾
鱼翅插花、金猴探海、开鱿争春、碧波伞丸。
洛阳汤
羊肉汤，牛肉汤，丸子汤，驴肉汤，豆腐汤，不翻汤，胡辣汤。
蝌蚪面
蝌蚪面是栾川县的地方传统小吃之一。
韩城羊肉汤
韩城羊肉汤是河南省洛阳市的传统小吃之一，属于豫菜系，该菜品因产自洛阳宜阳韩城镇而得名；正宗的韩城羊肉汤，讲究鲜、肥、清、辣四个字。最常见的吃法是泡馍，可烩肉，可加菜。在洛阳地区享有“十大名小吃”之首的，适应性颇广。
张记烧鸡
榆树园张记烧鸡是一道美味可口的地方传统小吃，属于豫菜系。为洛阳经营烧鸡的后起之秀。创始人张新忠，其子张铁林于1962年承其父志，经营烧鸡。张记烧鸡现为洛阳名牌烧鸡。主料有丁香、大茴、小
新安汤面铰
新安烫面饺是一道美味可口的传统名小吃，属于豫菜系。已有70多年的历史，在千里陇海线上闻名。新安烫面饺，用精白粉作皮，猪前胛后臀肉作主馅，配适量大葱、韭黄、白菜心、生姜、佐以白糖、料酒、小磨油、食盐、味精等。把面烫好，擀成薄皮，包成如新月型的面饺，上笼清蒸，十分钟即可。特点：皮薄如纸，色泽如玉，五味具全，鲜香不腻。
玉米糁汤
玉米糁汤是栾川县的地方传统饮食品种之一，因栾川玉米多生长于海拔1000米以上的高山地区，尤其是三川镇、冷水镇海拔更高，昼夜温差大促使玉米生长期更长、籽粒饱满。玉米糁汤用文火熬成，呈金黄色，
洛宁蒸肉
洛宁蒸肉是河南省洛阳市的一种特色小吃，属于豫菜系；洛宁蒸肉由猪肉片、大葱、粉条（地瓜粉条最好）、面酱、调料、面粉（玉米面粉最佳）搅拌，笼蒸而成、底部有一块圆形面饼是秘制而成。味香色

连汤肉片
连汤肉片是河南省洛阳市的传统小吃之一，属于豫菜系，该菜品也是河南洛阳水席中不可缺少的特色名菜。洛阳人喜欢吃水席，几十道菜，汤汤水水下来，吃得人连呼过瘾。连汤肉片以精瘦肉为主料，莲藕、
合油酥
合油酥在30年代就与赖桃酥齐名，同为重庆的名点。造型脱俗，色如白玉，以精制豆沙和糖蜜边油为心料，以酥脆滋润为特点。
栾川豆腐
栾川豆腐是由豆、酸菜卤水等食材制成的食品。
洛阳燕菜
洛阳燕菜又称牡丹燕菜，是河南洛阳独具风格的传统名菜。属豫菜系。主料有白萝卜、海参、 鱿鱼、鸡肉。成品洛阳燕菜只见一朵洁白如玉、色泽夺目的牡丹花，浮于汤面之上，菜香花鲜，赢得贵宾们的拍手叫绝。“洛阳燕菜”又名“假燕菜”、“牡丹燕菜”，是一道具有豫西地方特色的佳肴，历来被列为洛阳水席（“洛阳水席”起源于唐代，有1000多年历史，全席24道菜，有八道冷下酒菜，四道大菜、八道中菜、四道压桌菜。）中的首菜。据说水席有两层含义，一是全部热菜皆有汤；二是所有菜吃完一道再上一道，像流水一样不断地更新。牡丹燕菜是铁定会出场的角色，牡丹燕菜犹如盛唐时期艳装而出的妇人，甫一出场便吸引所有人的目光，一朵色泽夺目娇黄的牡丹花浮于汤面之上，花艳、菜香、汤鲜味美，酸辣香郁、爽滑适口。2018年9月10日，“中国菜”正式发布，“牡丹燕菜“被评为“中国菜”河南十大经典名菜。
洛阳浆面条
洛阳浆面条又称浆饭，是河南省洛阳市的传统小吃之一，属于豫菜系； 浆面条的主料是面条，但配料是关键。因为煮浆面条的不是常用的清水，而是一种特制的酸味豆浆（也称酸浆）。
尚记牛肉汤
尚记牛肉汤，属洛阳小吃，是吴家街人尚老概括经营，迄今40多年。其特点是肉肥汤鲜、煮汤辅料全。
驴肉汤
驴肉汤是以驴肉主料制作的药膳。驴肉汤是河南省洛阳市的传统小吃之一，属于豫菜系，该菜品以驴肉为主要食材，以料酒、精盐、味精、葱段等为调料制作而成。
阎家羊肉汤
阎家羊肉汤，已传四代人，已有150年的历史<代代都是长寿>。第二代人阎顺生，对羊肉汤进行了创新，使调料配置适当，汤味更加鲜美，从此，阎家羊肉汤闻名豫西城乡。阎家羊肉汤的特点是：用鲜羊肉，当天

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const luoyangFoodsList = [
  // 灯影牛肉
  {
    province: '河南省', // 省
    city: '洛阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'henanCuisine', // 菜系编码
    cuisineCategoryName: '豫菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '河南省', // 省
    city: '洛阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'henanCuisine', // 菜系编码
    cuisineCategoryName: '豫菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
