/**
 * 河南-南阳市-特产美食
 * 
* 羊肉汤,牛肉汤,糊辣汤,油条,油烙馍,豆腐脑,煎饼,水煎包,小笼包,菜合（韭菜盒子）,汤面,捞面,蒸面条,浆面条,炒面,糊汤面,臊子面,炝锅面,扯面,* 淅川酸菜,南阳油茶,桐柏豆筋,玄妙观斋菜,镇平烧鸡,博望锅盔,界中米醋,新野臊子,唐河肘子,白土岗辣子鸡,阎天喜饺子,方城烩面,河南博望锅盔,仲景香菇酱,方城羊肉烩面,南阳蒸菜,唐河麻糖,唐河凉粉,玄妙观斋菜,方城烧麦,镇平侯记烧鸡,淅川酸菜,郭滩烧鸡,

 * 
南阳人早餐以羊肉汤、牛肉汤、糊辣汤、油条、油烙馍、豆腐脑、煎饼、水煎包、小笼包、菜合（韭菜盒子）等为主。午饭主食各类面条，比如汤面、捞面、蒸面条、浆面条、炒面，糊汤面，臊子面，炝锅面，扯面等。晚餐俗话说叫“喝汤”，一般“苞谷糁”或“面疙瘩”配馍和菜。
南阳的地方特色食品有：淅川酸菜、南阳油茶、桐柏豆筋、玄妙观斋菜、镇平烧鸡、博望锅盔、界中米醋、新野臊子、唐河肘子、白土岗辣子鸡、阎天喜饺子、方城烩面等。
河南博望锅盔
博望锅盔是河南省传统的小吃。食之酥香爽口，耐嚼耐饥，且久放不坏。
仲景香菇酱
仲景香菇酱，精选西峡香菇，以独有工艺用心烹制而成，粒粒香菇，劲道饱满，酱香浓郁，极富肉感。拌饭、拌面很方便，炒饭、炒菜味更鲜，是佐餐、烹饪的升级之选。2014年7月，西峡仲景香菇酱产品已被国家质量监督检验检疫总局正式批准为生态原产地保护产品，准予其使用生态原产地产品保护标志。 2017年10月，仲景香菇酱通过国家质量监督检验检疫总局复审，再次获得生态原产地产品保护证书。
方城羊肉烩面
方城羊肉烩面在豫南很有名，无论你走在豫南的哪个小县城，总会不经意间就看到街边的餐馆门面上写着正宗方城羊肉烩面，作为一个地道的方城人，一般情况下我是不会走进去吃的，因为我知道再正宗也做不出来地道的方城烩面来的，有时间离家时间长了忍不住烩面的诱惑，才会走进去吃上一碗，吃完对心理上是一种安慰，可实在是吃不出家乡烩面那种沁人心肺的烩面味道来。
南阳蒸菜
南阳蒸菜是河南南阳的风味小吃，以蔬菜为主要原料。
唐河麻糖
唐河麻糖是用米花、碎花生仁，混合糖稀加热，冷却后切成半圆形的薄片，很脆。麻片糖是用白芝麻仁，混合糖稀加热，冷却后切成长方形的、更薄的小薄片。
唐河凉粉
唐河凉粉是一道美味可口的传统小吃。早在四百多年前，唐河民间即用碗豆粉、薯干等制作凉粉，由于这些原料制成的凉粉质脆，不宜长时间存放，故而许多人萌生了这样一个念头：能不能用其他原粮替代豌豆、薯干做成凉粉？经过多次试验，一个很偶然的机会，一位姓段的老师傅在一次试制过程中发现用绿豆制成凉粉不仅质软、弹性强，经凉拌、炒制后口感更佳。这一制作工艺一传十、十传百，很快在唐河兴起了绿豆凉粉，人们食之不厌。
玄妙观斋菜
玄妙观斋菜，是南阳市玄妙观的一道传统素食名菜，选料严谨、广泛，主、辅料都必须是真素，既选天南海北之珍品，又充分利用本地的各种土特产。蔬菜。对这些素料经扒、溜、炒、炸、烩、蒸等方法精心制作，做出的肴撰悦目香口，色香味形俱佳，又质素形荤，非常逼真。玄妙观斋菜经历代厨师、道众、食客的切磋、创新，烹调技法不断提高，名菜佳肴逐步增加。
方城烧麦
清光绪年间，方城县城内开化寺街马玉亮（回族），始创'烧麦'。最初不叫'烧麦'叫'撮子包'，因感其名不雅。又因其边象快熟的麦穗，随改名为'烧麦”。
镇平侯记烧鸡
镇平侯氏烧鸡也称镇平烧鸡，是一道南阳市的传统名菜，属于豫菜系。此菜色泽鲜艳，断筋离骨，皮香肉烂，肥而不腻，外香里嫩，肉质鲜美，每一丝鸡肉里都蕴含着浓香，香飘十里。而且经过焖煮的烧鸡断筋离骨，营养丰富，特别适合牙口不太好的老年人使用，更是老少皆宜的滋补佳品。主要原料为鸡、蜂蜜、麻油、盐水等。
淅川酸菜
淅川酸菜是河南省南阳市淅川县特有的一种蔬菜发酵食品,其制作原料包括剌菜、红薯叶、蒲公英、芝麻叶、小油菜、莴苣叶、萝卜缨等。在其他地方以同样方法制作的酸菜因为水质不同就失去了淅川酸菜原有的特色。
郭滩烧鸡
在唐河县郭滩烧鸡远近闻名，素有“肉质鲜嫩”“五香脱骨”之盛名，为河南省南阳的传统名吃。始于唐宋鼎盛明清，已有四百多年的悠久历史。制成品肉烂、骨酥、皮不破，食用时骨肉自动分离，肥而不腻，味


*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const nanyangFoodsList = [
  // 灯影牛肉
  {
    province: '河南省', // 省
    city: '南阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'henanCuisine', // 菜系编码
    cuisineCategoryName: '豫菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '河南省', // 省
    city: '南阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'henanCuisine', // 菜系编码
    cuisineCategoryName: '豫菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
