/**
 * 陕西-宝鸡市-特产美食
豆花泡馍
豆花泡馍的原料由大豆、锅盔馍和各种调料三大部分组成，其制作方法是先将大豆挑捡洗净泡软，和水后用打浆机磨成豆浆，然后入锅煮熟，放入消泡剂搅匀消泡，再将石膏用水泡开，与豆浆同时倒入保温桶内，迅速加盖，过七八分钟后，就结成了凝固而洁白如玉的豆花。 [24]
西府扯面
扯面是陕西和山西的传统面食，已有3000年历史。以宝鸡的西府扯面最为正宗，为中华名吃。主要原料有上白面粉、鸡蛋、菠菜、红萝卜、调味品、臊（sào）子等。扯面主要流行于陕西、山西以及甘肃的徽县、两当、成县。 [26]
岐山臊子面
臊子面又名“蛟汤面”，典出定居于岐山的周文王挥剑斩蛟龙的故事。岐山臊子面以“薄、筋、光、煎、稀、汪、酸、辣、香”而著名，面条细长，厚薄均匀，臊子鲜香，红油浮面，汤味酸辣，筋韧爽口，老幼皆宜。宋朝大文学家苏东坡曾写诗称赞：“剩欲去为汤饼客，却愁错写弄獐书。” [25]
搅团（水围城）
用面搅成的浆糊，在水滚时，一手握一棍子搅动，另一手均匀撒各样杂面，否则杂面会结块，不能和水分充分结合，以至于结块部分久煮不熟，既影响视觉，又影响味觉，也造成不必要的浪费。棍子顺时针搅几下，逆时针搅几下，熟后配以调汁。 [27]
宝鸡擀面皮
擀面皮是陕西关中地区特有的传统名小吃，尤以西府宝鸡地区为最佳，宝鸡岐山擀面皮2011年被认定为中华名小吃。擀面皮是从唐代冷淘面演变而来。具有筋斗、柔软、凉香、酸辣可口的特点，是关中西府小吃代表之一，也是陕西最具代表的小吃之一。岐山人的擀面皮做法很非凡，别处的米面皮和酿皮是把面调成糊状，放在特制的铁笼上蒸。而岐山擀面皮则是先擀成面，然后再蒸，蒸熟后再切成比凉皮稍宽的条状，吃法和米面皮基本一样，不同于米面皮的是，擀面皮口感较硬，韧度高，有筋性。 [28]
陇县马蹄酥
陇县马蹄酥又名蜜馅儿是陕西省陇县传统风味小吃，圆形似马蹄而得名，是陇县民间走亲访友的名贵糕点。马蹄酥为江阴传统特色糕点。清朝末年仿制镇江同名糕点，并经改进成面。该产品采用上等面粉、赤豆为原料，加果仁为辅料，用糯米发酵后制成。因成品四周厚、中间薄、形似马蹄而得其名。其特点为酥、松、软兼备，色、香、味俱佳。
岐山醋粉
岐山醋粉是陕西省宝鸡市岐山地区独特的特色小吃，吃起来滑嫩细糯、醋香扑鼻，又能助消化，特别是夏季吃起来清凉爽口，又可清热解暑。
岐山烙面皮
岐山烙面皮是以面粉、油泼辣子为主料的食品。
稀的面糊，倒入铁制的箩里，隔水蒸熟，待凉后用刀切成细细条状，拌入醋、盐、蒜水、红油辣椒，就成了具有特色的西府醋粉，其口感微酸，香馥浓郁，吃了以后，胃口大开。
西府搅团
搅团为西北一特色吃食，定义为“用杂面搅成的浆糊”，陕甘宁青尤好吃。现如今在关中地区人们开始用小麦粉制作搅团，配以农家自制的醋，佐以绿色菜蔬，或野菜(冬春之际)其口感，要比用玉米粉制作的好许
岐山面
岐山面是陕西关中地区的一种传统特色面食，有其悠久的历史。岐山面以薄、筋、光、煎、稀、汪、酸、辣、香而著名。岐山面面条细长，厚薄均匀，臊子鲜香，红油浮面，汤味酸辣，筋韧爽口，老幼皆宜。岐山面在关中地区有其非常重要的地位，在婚丧、逢年过节、孩子满月、老人过寿、迎接亲朋等重要场合都离不开。
凤县浆水面
凤县浆水面，其味酸、辣、清香，别具一格，相传该名是由汉高祖刘邦与臣相萧何在此吃面时所起。它一直是凤县人民喜爱的面食，浆水菜的菜以芹菜为佳，白菜、萝卜缨也可。
臊子面
臊（sào）子面是中国北方的特色传统面食之一、是著名小吃，以宝鸡的岐山臊子面和临汾的汾城臊子面最为正宗。在山西晋南地区、陕西关中平原及甘肃陇东等地方流行。臊子面历史悠久，其中含有配菜比如豆腐，鸡蛋等，做法简单。臊子就是肉丁的意思。对于山西人来说，臊子面的配色尤为重要，黄色的鸡蛋皮、黑色的木耳、红色的胡萝卜、绿色的蒜苗、白色的豆腐等材料，既好看又好吃。
凤翔腊驴腿
凤翔腊驴腿是凤翔区久负声名的传统的特色名菜，陕西肉食品传统的名特产，此膳食据传说，清末时期有位姓苏名石娃的，当时制作的腊驴腿以其特色远近闻名，“腊驴腿”生产技术加工工艺就是他传于后世的。
岐山擀面皮
岐山擀面皮是中国陕西省岐山县传统风味小吃。从唐代冷淘面演变而来。具有筋道、柔软、凉香、酸辣可口、四季皆宜之特点，是西北较有民族风味的食品之一。其面皮选料精良，工艺严谨，调味讲究，以“
岐山空心挂面
岐山空心挂面是陕西省岐山县历史悠久的传统面食小吃，是当地人民生活中传统手工面食品制作中最为独特的上品。传统空心挂面以前茁苜蓿地长出的“紫麦”（现为优质小麦品种）为原料，其中包括10余道工序，

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const baojiFoodsList = [
  // 灯影牛肉
  {
    province: '陕西省', // 省
    city: '宝鸡市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shaanxiCuisine', // 菜系编码
    cuisineCategoryName: '陕西菜、陕菜、秦菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '陕西省', // 省
    city: '宝鸡市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shaanxiCuisine', // 菜系编码
    cuisineCategoryName: '陕西菜、陕菜、秦菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
