/**
 * 陕西-渭南市-特产美食
麻食泡
麻食泡是陕西华阴地区特有的风味小吃。
潼关酱笋
潼关酱笋，陕西省渭南市潼关县特产，中国国家地理标志产品。潼关酱笋采用独特传统的工艺生产，用潼关独有的铁杆青笋为原料，用经过传统工艺6个月以上制成的甜面酱进行酱渍，经翻、晒、露等发酵工艺，腌制3个月以上，具有色泽红褐鲜润，味道酥脆香甜，酱香浓郁之特色。据记载，民国十三年（1924年）7月，鲁迅先生赴国立西北大学讲学，路径潼关稍作休息时，品尝了潼关酱菜，对其独特的口味赞赏有加，返回时专程到潼关购买酱菜，回京分送亲友。2011年12月26日，原国家质检总局批准对“潼关酱笋”实施地理标志产品保护。
踅面
踅面[xué miàn]，是陕西合阳独有的传统特色面食。有的人写成“旋面”，是因为“旋”字在合阳方言里念“踅”。踅面是陕西省合阳县及渭南地区传统的面食，为当地人极为偏爱的特色风味小吃。踅面历史悠久，相传西汉高祖三年（公元前 204 年），汉淮阴侯韩信在合阳黄河边的夏阳渡用木罂渡军活捉河东魏王豹时，为解决 10万将士吃饭问题而发明此面，踅面可称得上是我国最早的“方便面”。踅面有2200多年的历史。吃着踅面，再想想这个关于踅面起源的典故，就知道当年韩信怎么发明出踅面作为行军打仗的饭食。一是踅面劲道。厚且筋大，吃在嘴里耐嚼，咽在肚里耐饥。二是味醇。吃踅面时除了盐、味精等其它常用调料外，要拌以猪油和辣子，所以吃起来油香浓郁，辣味悠长，两者都能增进食欲。三是方便。这与踅面的做工有关，我曾见过做踅面的过程，先是和面，在一个很大的瓷盆里倒进面粉和适量水，用一根粗木棒顺着同一方向搅，搅得稀稠匀当了，舀一勺子倒在一张直径差不多有2尺多的大铁鏊中心，再用半月形的木踅子从鏊心向四周一圈一圈旋着刮开摊平。据说踅面的名子就是由那个半月形的木踅子而得的。但街上也有把“踅面”写作“旋面”的，想必也与一圈一圈地旋着刮摊有关。烙熟后一张张搭在外面凉冷，再切成宽窄与薄厚相当的条形，码得整整齐齐，这样能保质三、五天，吃时只需在开水锅里滚一下即可。相对于其他饭食，踅面的三个特点都更有利于行军打仗，汉高祖能稳坐天下，其中也有踅面的一份功劳。
琼锅糖
琼锅糖是陕西省富平县流曲镇特色小吃。
潼关酱菜
潼关酱菜是渭南市潼关县的传统名菜，属于陕西省名优食品之一。源于唐代贡品。其制作工艺精细，色泽鲜润、红中透黄、咸度适中、微甜脆爽。品种有八宝酱菜、萝卜酱菜、连皮酱笋、五香花生、五香面酱、潼关小菜等三十余种。一九一五年获巴拿马世界名特食品博览会银奖。载入《中国土特名产》和《中国土特名产辞典》等。
荞面煎饼
荞面煎饼是陕西合阳县同家庄镇的西同鞮村独特的小吃，当地人称为“红油馇子”。面煎饼软和筋道，加上葱香以及醋与辣子掺和后的特殊味道，大开胃口，直吃得口中吸溜，头上冒汗，却越嚼越香，吃上两三张才过瘾。
八宝肉辣子
八宝肉辣子是陕西渭北民间筵席中必不可少的下饭菜，因其配料、调料众多，故名“八宝”。此菜以猪肉、杏仁、潼关酱笋、青豆、辣椒面等烹制而成，油汁鲜红，香辣味浓，关中人喜欢把它夹在热馒头中食用，是物美价廉的传统名菜。八宝肉辣子猪肉煮六成熟捞出，同玉兰片及酱笋（去皮）均切成1 厘米长、1 厘米宽的丁，杏仁用清水洗净，青豆焯熟。炒锅加菜籽油100 克，旺火烧六成热，投入葱段偏出香味，随即下肉丁煸炒，下青豆、玉兰片、酱笋、杏仁、海米、加酱油，炒至熟透，再加精盐、面酱炒匀，拨在锅边。再加菜籽油50 克
富平太后饼
富平太后饼是陕西省富平县传统的特色饼类小吃，已有2000多年历史。具有外皮焦黄酥脆，内质层次分明，柔软可口，油香不腻的特点，其制作技艺已列入陕西省第二批非物质文化遗产名录。
流曲琼锅糖
流曲琼锅糖，陕西省富平县特产，中国国家地理标志产品。流曲琼锅糖是白芝麻加工的产品，色泽呈米黄色；黑芝麻加工的产品，黑白相间，色泽均匀。气孔分布均匀，无不规则大空洞。香酥脆甜，不粘牙，无异味。产品分条状、片状。条状、片状切面整齐，厚度均一。2009年12月，原国家质检总局正式批准“流曲琼锅糖”为原产地域保护产品（即地理标志保护产品）。
渭南时辰包子
渭南时辰包子是中国陕西省渭南市传统的特色小吃，为陕菜系，主要食材有猪肉，面粉等。
韩城十三花
韩城川原户户养猪，逢事请客，必杀猪招待，既经济，又盛情。经过一代又一代的实践，终于创造出了不同形色的猪肉系列菜肴，典型者，当推“十三花”。
水晶饼
水晶饼是陕西省渭南市下邽镇的地方名点。相传是宋代当地民众赞美寇准而制作的糕点。通过制皮、制馅、制酥、包酥、成型的烹饪步骤完成。水晶饼金面银帮，起皮掉酥，口感油多而不腻，糖重而渗甜，具有
水晶饼、富平柿饼、金丝蜜枣、月牙饼、白水杜康酒、同州西瓜、临渭葡萄、赤水大葱、蒲城酥梨、椽头蒸馍、水盆羊肉、时辰包子、豆腐泡馍、蒲城焰火、合阳踅面、潼关肉夹馍、潼关酱菜、荞面饸饹、澄城麦子泡等。

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const weinanFoodsList = [
  // 灯影牛肉
  {
    province: '陕西省', // 省
    city: '渭南市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '陕西省', // 省
    city: '渭南市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
