/**
 * 陕西-咸阳市-特产美食
 * 
 * 
 * 馇酥
永寿油汤面
三原白封肉
武功镇旗花面
乾州锅盔
乾县挂面
三原蓼花糖
让饸
乾州鸡面
兴平醪糟
长武锅盔
旬邑花馍
旬邑喜菜
彬州麻花
兴平老王家醪糟
武功镇饸咯面
咸阳琥珀糖
长武血条汤
乾州豆腐脑
永寿安宫桥大麻花
永寿槐花蜜
泡泡油糕
彬县荞麦凉粉
御面
永寿热镜糕
长武烧鸡
酒枣
泾阳凉皮
长武水豆腐

 * 
 * 
 * 
 * 
馇酥
馇酥是陕西省传统风味小吃，将面、大油、葱花、调料柔和拧叠成夹层小饼，入鏊烘烤，搽油煎翻，渍黄柔酥。油而不腻，香气四溢。
永寿油汤面
油汤面，陕西永寿特色面食，面薄筋光、汤鲜味美、油而不腻。
三原白封肉
三原白封肉是以猪肋条肉、猪蹄为主料制作的菜品。该菜品是陕西三原传统风味小吃。
武功镇旗花面
旗花面也有叫奇花面，陕西省武功地区传统面食。因它碗上飘的五颜六色似花非花，故曰“奇花面”;也有叫“七花面”的，因它所用的鸡蛋花、葱花、带片等都切成像小旗子一样的平行四边行或三角形，故而得名“旗花面”。是一种当地群众非常喜欢的面食，也叫一口香或起花面，一般用来招待贵客的。也是逢年过节，武功及周边地区人们必做的一种面食。
乾州锅盔
乾州锅盔是陕西省地方传统小吃之一，其外观呈圆形，馍边压成带辐射状的一高一低的波纹，火色均匀，看上去宛如一个大菊花图案。其显著特点是边薄心厚，表面鼓起，馍瓤干酥，色形美观。用手掰开，层层分明；用刀切开，状如板油。闻着香，吃起酥，回味无穷，耐饥，耐贮，携带方便。“乾州锅盔”作为陕西的一种名特食品，已载入《中国土特产大全》一书。
乾县挂面
乾县挂面是陕西乾县地区由手工制成的传统面食，面条细、白、筋、光，面丝细匀，加上烹调时汤煎、油旺、醋酸，并以嫩韭菜、白菜心、鸡蛋饼切碎置汤中做“漂稍”,色、香、味俱佳。
三原蓼花糖
三原蓼花糖，陕西省三原县特产，中国国家地理标志产品。三原蓼花糖外形如藕状或球状，圆满丰实、洁白细腻，松酥适口。表皮为金黄色，粘饰芝麻，芝香浓郁，香酥甜脆，风味独特。2015年8月，原国家质检总局批准对“三原蓼花糖”实施地理标志产品保护。
让饸
“让饸”这道地方美味菜肴的，在三秦大地，八百里关中一带，只有泾阳一地。“让饸”，按照谐音即为软和一意，才上饭桌，热气拌着香气，早已让顽皮稚童急切地咂吧着嘴巴，吐一下舌头，大声疾呼“让饸上来了”，一边麻利地伸出筷子，一边再也忍不住口水呼啦从口角流出。大人们任其顽皮的样子不说，也迅速加入朵食美味之中。
乾州鸡面
乾州鸡面是陕西省乾县地区的一种风味面食。用鸡脯肉加淀粉擀成面片，先焯后蒸，浇入虾米、木耳及调味品等制成的汤汁。面条特点：色白肉嫩、汤清味鲜、形似面条、营养丰富。
兴平醪糟
兴平醪糟是陕西省咸阳市兴平市的特色小吃，其选用高级糯米，经筛、捡、淘、泡、蒸后，并拌入特制曲母，利用一定温度储封发酵而成。以气味醇香、清甜质绵、耐饥止渴、益脾健胃而著名。
长武锅盔
长武锅盔是陕西长武地区的一种传统特色面食，是古代行军打仗、出门旅游的必备干粮，有耐储藏的优点。
旬邑花馍
旬邑花馍是一种陕西民间面塑品。乡间逢年节都要蒸制花馍。如春节蒸大馒、枣花 、元宝人 、元宝篮；正月十五做面盏、做送小孩的面羊、面狗、面鸡、面猪等；清明节捏面为燕；七巧做巧花( 巧饽饽 ) ， 形如石榴、桃、虎 狮 、鱼 等；四月，出嫁女儿给娘家送“面鱼”，象征丰收；也有女儿出嫁作陪嫁用的“老虎头馄饨 ；寒食节上坟时用“蛇盘盘”以示消灾；做春燕表示春回大地；婴儿满月做“囫囵”谓之“龙凤呈祥”、“猛虎驱邪”；老人祝寿用“大寿桃”等等。花馍在民间依不同岁时和用途有各种形式。
旬邑喜菜
旬邑喜菜是一种全家福式烩菜。 上菜用盆或大老腕盛装，半汤半菜，在吃饭或喝酒之前，相当于高档宴席上的开胃汤。
彬州麻花
彬州麻花是彬州著名的风味小吃。彬州麻花采用特制精粉、鸡蛋、生姜、大葱等十多味天然调料及中药村精工制成。彬州麻花选料严谨，色泽金黄，口味鲜香，栈酥脆化渣（在咀嚼中不咽自化），易于消化，久食不腻，
兴平老王家醪糟
陕西兴平老王家醪糟，解放前在兴平西大街与杏核凉眼药名扬西北，虽隐至乡村，然本质纯朴，绵甜爽口，酒味悠长，如今秉承祖业，加入现代工艺，被人们格外青睐。兴平市老王家醪糟产品品牌：好时来。
武功镇饸咯面
饸饹面是一种武功镇地方特色面食，一般是前面支一口汤锅，两边是调料和佐料盘，捞面浇汤的人坐在中间。下面的一般都在后堂，采用老式的人力饸咯床压面，下边是一口煮面的锅一般每次只煮两到三个人的面。
咸阳琥珀糖
咸阳琥珀糖是陕西省咸阳地区的一种传统名特食品，又叫虎皮夹心糖，是以小米加大麦芽为主料制成饴糖，将碾制成粉做成辅料制作而成。传说在清朝光绪二十六年，八国联军侵入北京，慈禧太后逃往西安时吃后所赐得名，一直沿用下来。
长武血条汤
血条汤是陕西长武特色食品。长武人红白喜事，生日满月，逢年过节，招待客人的头一顿上等饭是血条汤。煎汤时加用动物油（大油）作的油泼辣椒、豆腐、葱花、鲜香菜等，形成血条红，豆腐白，辣而不呛，油而不腻的特点，为地方风味吃食一绝。
乾州豆腐脑
乾州豆腐脑是陕西乾县的一道传统风味小吃，用精选黄豆与优质泉水制成，鲜嫩爽滑，软中有韧，豆香浓郁。
永寿安宫桥大麻花
大麻花是陕西省著名的风味小吃，当地永寿县安宫桥大麻花主产监军镇安家宫村特产，生产历史悠久。采用细白面，经多次揉制，再用菜籽油两次炸制而成。
永寿槐花蜜
永寿槐花蜜，陕西省永寿县特产，中国国家地理标志产品。永寿槐花蜜，颜色呈水白色、白色及微黄色，清香甜润，有槐花香味，蜜质粘稠，不易结晶，偶有结晶乳白细腻，不得含有蜜蜂肢体、幼虫、腊屑及正常视力可见杂质。理化指标：果糖和葡萄糖≥65%，蔗糖≤4%，淀粉酶活性（1%淀粉溶液）≥8毫升/（克·升），羟甲基糠醛≤25毫克/千克，果糖≥33%。2018年7月，原国家质检总局批准对“永寿槐花蜜”实施地理标志产品保护。
泡泡油糕
泡泡油糕是陕西三原地区一道很有名气的传统小吃，其渊源可上溯至唐代的烧尾宴名点“见风消”油洁饼，馅是用白糖、黄桂、玫瑰、桃仁、熟面拌成的色泽乳白、表皮膨松，如轻纱制就、蝉翼捏成。
彬县荞麦凉粉
荞麦凉粉作为彬县地方风味特色小吃，曾获“西安咸阳旅游名品”称号。
御面
御面是陕西长武、彬县、旬邑等渭北及周边地区的传统风味特色面食，又称玉面、淤面，是一种有别于凉皮的面粉特制食品，筋光柔软，光滑爽口。御面以其制作方法称为“淤面”，以其色亮如玉称为“玉面”，又以其为宫中贡品而称为“御面”。
永寿热镜糕
永寿热镜糕是以优质糯米、蜂蜜、大枣等为主料制作的糕点。
长武烧鸡
长武烧鸡是长武人宴宾的上等佳肴，随着近几年来人们的生活水平不断提高，长武烧鸡也成了红白喜事，设宴摆席必备的菜肴，也在长武人餐桌上随时可见。更是长武人走亲访友的好礼品。
酒枣
酒枣不仅保持了鲜枣的色形，而且枣香酒香相融，清醇芬芳，甘甜酥脆，风味独特。是彬人逢年过节待客的佳品。
泾阳凉皮
已有200余年的历史，凉皮的制法多、品种繁，突出酸辣鲜香，口感好，滑利爽口、筋韧耐嚼，深受大众欢迎。凉皮分米皮和面皮两种，米皮用蒸法，凉皮或蒸或擀。蒸者绵软，擀者筋道。以秦镇的米面皮、西府擀面皮最为著名，食时将其晾凉切条，加入焯熟的绿豆芽，加入精盐、芝麻酱、醋、蒜水、香料、辣椒油等即成。
长武水豆腐
豆腐在长武有一种特殊的吃法，就是将豆腐点好后连汤食用——这就是有名的长武水豆腐。


*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const xianyangFoodsList = [
  // 灯影牛肉
  {
    province: '陕西省', // 省
    city: '咸阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shaanxiCuisine', // 菜系编码
    cuisineCategoryName: '陕西菜、陕菜、秦菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '陕西省', // 省
    city: '咸阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shaanxiCuisine', // 菜系编码
    cuisineCategoryName: '陕西菜、陕菜、秦菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
