/**
 * 陕西-榆林市-特产美食
榆林炸豆奶
炸豆奶是陕西省榆林市的传统风味小吃之一，该菜品以豆浆，鸡蛋，绿豆淀粉为原料，经炸至而成。外焦里嫩，香甜适口，味道甘醇。榆林为古代塞上著名的城镇，城东有三教庵，内有一眼“普惠泉”，泉水清凉甘甜，富含矿物质。用此水磨豆浆制作豆腐，味道殊美。榆林炸豆奶旧时就是用此泉水磨豆浆制作的。
水炒羊肉
水炒羊肉，是以羊肉和水为原料制作的一道菜品，故名水炒羊肉。是陕西绥德著名的传统小吃。
四十里铺羊肉面
四十里铺羊肉面是陕西省榆林市绥德县的一道传统小吃该菜品门店遍布全国，在陕北，有句民谣无人不晓。那就是，“米脂的婆姨绥德的汉，清涧的石板瓦窑堡的炭，四十里铺的羊肉面。”四十里铺羊肉面，其中羊肉是选自陕北肥嫩的山羊肉，肉质鲜美肥嫩，是羊肉中的极品，面为揪面片。
宰羔肉
宰羔肉是陕西省定边、靖边地区有名的传统小吃。宰羊羔有着双重效益，羔皮毛片黑亮细软，呈水波状，乃贵妇人极喜爱的高档大衣皮料；羊羔肉则可加工上等佳肴。
炉馍
炉馍，陕西传统特色小吃，炉馍做工精细、酥脆可口、馅味清香而闻名遐迩。做炉馍馍的工艺、用面、用油最为考究。面要用上好的春小麦面粉，猪油要色白纯净。面粉和油要严格按比例配制首先将面粉(米面最佳)用温火炒熟，拌上白糖、红糖、核桃仁、花生仁、青红丝、梅桂酱、芝麻、陈皮面等
缸腌腊猪肉
陕北家制“缸腌腊猪肉”是广泛流传于陕西以家庭为单位、用民间传统的加工方法腋制的省榆林地区的西部(包括榆林、定边、靖边）的一种腋腊肉制品。当地群众用自养自宰的猪肉为原料，瓷缸为容器，应用经过长期实践总结的盐埋法和油封法两种独特的加工方法而成的一种色香味俱佳，且外观整洁。
小米凉粉
府谷有名的传统小吃，小米淘净，冷水泡十至二十分钟捞出，配合清水磨成米浆，入锅熬煎，边熬边搅，快熟时加入蒿籽粉。把熬熟的米浆在高粱箔子上摊成薄饼，晾冷后再摊一层，如此反复摊晾即成。吃时切成细条，调上芝麻、芥末、辣椒油、香油、醋、等调味品、凉吃味道甚佳。
炸豆奶
炸豆奶是陕西榆林的一道特色名小吃，是用豆浆为主要原料制成，故名炸豆奶。
子洲面花
捏面花是子洲淮宁河川在寒食节的民俗。面花又称子推馍，是为祭奠晋国大臣介子推而做的祭品。相传，晋文公重耳流亡期间，介子推割股肉供晋文公充饥。文公复国后，介子推不求利禄，与母归隐绵山。文公焚山以逼迫介子推，熟料大火烧了三天三夜介子推坚决不出山，抱树而死。晋文公下令，介子推焚死之日禁火寒食，以寄哀思。于是流传下了延续2640多年的寒食节，这里的居民则在每年的寒食节捏面花，代代相传。
拼杂烩
拼杂烩是一道美食，制作原料是熟猪肉片、炸洋芋片、粉皮。
榆林羊杂碎
榆林羊杂碎(也称羊杂烩)，是由羊血、心、肝、肺、肠、肚等混合烩制而成，故得此名，制作羊杂碎还讲究“三料”、“三汤”、“三味”。
荞面圪坨
荞面圪坨是陕西定边、靖边的特色风味小吃。
定边羊羔肉
二是清炖法。将肉块投入烧至七八成热的油锅里，拦10多分钟，待肉质呈白色状，加面酱再拦至肉中本身水消失，再加温水、盐等，用温火炖一小时左右，放少许味精、葱丝、芫荽即成。
子洲果馅
子洲果馅是陕西省榆林市子洲县的一种传统风味小吃，是一种有馅的饼食，馅是用陕北的滩枣制成，分为"枣馅"和“糖馅”俩种口味，外沿鼓园如轮，文火烤至焦黄，皮酥内甜。
炸奶链
炸奶链是陕西榆林地区小吃名点，榆林牧草繁茂，盛产羊只，羊奶尤佳。炸奶链以鲜羊奶为主料， 油炸成斜形的链条状，故名。清代以来，炸奶链一直是教待宾朋的美点。营养丰富，香甜可口，老幼皆宜。
卤驴板肠
卤驴板肠是一道以驴大肠为主料制作的菜品。
清涧煎饼
清涧煎饼是陕西省榆林市清涧县一种独特的风味小吃，煎饼状若朗夜之圆月，晶莹如白雪，轻薄似蝉翼，柔韧绵冽，其味沁人心肺，过口难忘。用荞麦做成，极为好吃。早在元代王桢《农中》就有荞麦去皮壳，磨而成面，摊作煎饼，配蒜而食的记载，可谓历史悠久，是清涧人民过年过节的必备小吃，也是招待亲朋的上乘佳品。
佳县马蹄酥
佳县马蹄酥是陕西佳县的一道传统特色小吃，用精粉、猪板油、蜂蜜和白糖等为原料制成，色泽褐黄，纹层清晰，脆酥绵甜，且耐存放。佳县马蹄酥因形似马蹄而得名，又因其外形像碗口，香甜如蜜又叫蜜碗，外形美观，油而不腻，酥软清香，甘甜可口。清代有诗人曾用“乍经面起还留迹，不踏花蹄也自香”的诗句来专门赞美马蹄酥。
绥德油旋
绥德油旋是陕西绥德著名的传统小吃，用精粉，温水和面（加少许盐、碱水）制成，其色泽金黄油亮，层层饼旋薄如羽翼，外脆酥里绵软，油香扑鼻。
老榆林拼三鲜
老榆林拼三鲜是陕西省榆林地区的一道特色菜品，相传乾隆皇帝微服私访榆林的时候，当地官员在宴席中向乾隆献上了此菜，乾隆皇帝吃此菜后大为赞赏，给予此菜很高的评价，并且还将此菜带回宫中，作为招待外国使臣的重要菜品，榆林拼三鲜成为宫廷御菜。
米脂驴板肠
驴板肠是陕西榆林市米脂地区一种很有特色的风味食品，因它不仅肉质细腻香醇、麻辣可口，而且还有滋阴补肾的疗效。板肠的“板”字，是整块的意思，指驴的全副大肠。
榆林市本地特色风味有：羊肉系列（如烤全羊、烤羊肉、炖羊肉、羊杂碎等）、荞面系列（如荞面饴馅、荞面讫铊）、小米、豆制品系列（如豆腐宴、水煮豆腐）、土豆系列（如土豆宴）、红碱淖特色水煮鱼等。 [106]
美食
榆林豆腐
横山羊肉
拼三鲜
羊杂碎
榆林肝子碗托
炸豆奶
洋芋擦擦
米脂驴板肠

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const yulinFoodsList = [
  // 灯影牛肉
  {
    province: '陕西省', // 省
    city: '榆林市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '陕西省', // 省
    city: '榆林市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'sichuanCuisine', // 菜系编码
    cuisineCategoryName: '川菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
