/**
 * 湖北-荆州市-特产美食
 * 鱼丸、皮条鳝鱼、冬瓜鳖裙羹、珍珠糯米丸子、江陵八宝饭、公安牛肉、松滋杜婆鸡、石首笔架鱼肚、洪湖莲藕藕带、洪湖野鸭。小吃：早堂面、公安锅盔、公安豆皮、米丸子、元豆泡糯米、黄家堂牛肉米粉、小胡鸭
 * 洈水鳜鱼、笔架鱼肚
 、荆州鱼糕
荆州鱼糕
千张扣肉
冬瓜鳖裙羹
油炸藕丸
荆州八宝饭
早堂面

 * 
 * 
 * 荆州市的美食很多，其中通常有荆州鱼糕、鱼丸、千张扣肉、皮条鳝鱼、冬瓜鳖裙羹、珍珠糯米丸子、江陵八宝饭、公安牛肉、松滋杜婆鸡、石首笔架鱼肚、洪湖莲藕藕带、洪湖野鸭。小吃：早堂面、公安锅盔、公安豆皮、米丸子、元豆泡糯米、黄家堂牛肉米粉、小胡鸭等。
荆州鱼糕
荆州鱼糕，湖北省荆州市特产，中国国家地理标志产品。荆州自古盛产鱼，鱼糕作为荆州的八大名肴其历史源远流长，相传为舜帝妃子女英所创，在荆楚一带广为流传，春秋战国时开始成为楚宫廷头道菜，直到清朝，仍是一道宫廷菜，据说乾隆尝过荆州花糕后脱口而咏：食鱼不见鱼，可人百合糕。现代鱼糕越做越为精美，人们用鱼和肥膘肉做糕，再用猪肉、山药等制成肉丸。肉丸垫底，鱼糕放在上面，最后以肚片、腰片烹炒盖帽，多菜共碗，俗称花糕、杂烩丸子，是荆州一带的红白喜事宴席上的头道菜。荆州鱼糕已经超越了单纯的饮食习惯而积淀成为一种独具特色的地方民俗文化。2013年01月23日，原国家质检总局批准对“荆州鱼糕”实施地理标志产品保护。2019年11月15日，入选中国特色农产品区域公用品牌。
鱼糕，作为荆州/沙市地区的八大名肴其历史源远流长。“荆州鱼糕”是用白色鱼肉制作的，可用红色鱼肉炸鱼丸子，和鸡肉、猪腰子、猪肚烩菜，成为荆州宴席名肴。
千张扣肉
此菜以肥瘦兼有的五花猪肉为原料，经煮炸，上红糖色，切成薄片，以碗扣住蒸熟，由于肉片薄如纸，形如梭，片数多，故名千张扣肉，又名梳子肉。
冬瓜鳖裙羹
冬瓜鳖裙羹，是以鳖（又称甲鱼、团鱼、脚鱼）的裙边和嫩冬瓜一起煨制的一种汤。其制法讲究，选料精细。先将裙边肥大的鳖宰杀后取下裙边切成块状，以旺火爆炒，再加鸡汤和调料煮，然后放入嫩冬瓜块清炖，直至鳖裙溶烂。
油炸藕丸
传说乾隆皇帝三下江南途经洪湖时，当地州官为敬奉天子，要厨师们拿出绝技，让天子吃藕不见藕。厨师们寻思各自的拿手好戏，其中一个厨师想起饥荒之年以藕充饥，把藕捣碎后做藕丸吃的事，于是五味调合，精烹细作。乾隆皇帝吃了，龙颜大开，回京后将油炸藕丸定为御膳。
荆州八宝饭
荆州八宝饭原是清代的一位御厨从宫廷出来后，到荆州城开设饭馆流传下来的。这种八宝饭用红枣、莲子、苡米仁、桂元内、蜜樱桃、蜜冬瓜条、糖桂花以及糯米先蒸制成坯，再加白糖、猪油散烩而成。由此又名叫“散烩八宝”。吃到口里，觉得润滑溶消，香甜透味，油而不腻，甜而不厌。
荆州八宝饭是湖北荆州的地方传统名点，在全国八宝饭中独树一帜，原是清代的一位御厨从宫廷出来后，到荆州城开设饭馆流传下来的。吃到口里，觉得润滑溶消，香甜透味，油而不腻，甜而不厌，于是“浅盏
早堂面
早堂面，是沙市著名的传统早点，已有百年历史。关于早堂面的来历，比较令人信服的说法是在1895年沙市开埠后，当地一面馆老板根据这里的码头工人因从事体力劳动喜欢吃油水厚重食物的特点，制作了这种油厚码肥、汤鲜味美的面条。由于码头工人多在凌晨时分到面馆吃面后上工，故得此名。

酥炸春卷
是荆州城区春节期间宴请宾客的特色传统名吃。杜甫曾有“春日春盘细生菜”的诗句。“春盘”是用薄饼卷蔬菜的食品。明清以来，春盘便逐渐演变成了“春卷”。
欢喜坨
欢喜坨又称欢喜团、麻汤圆、麻鸡蛋，其起源于湖北武汉，是湖北武汉、荆州，沔阳（今仙桃），天门，江陵等地的一种特色传统小吃，已有百余年的历史，其是由糯米粉滚成圆团，再裹上一层芝麻炸熟而成，炸熟后外脆内软，外焦里嫩，色泽鲜艳，吃起来一声脆响后糖汁四溢，满嘴芝麻香。
洈水鳜鱼、笔架鱼肚等 [69] 


*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const jingzhouFoodsList = [
  // 灯影牛肉
  {
    province: '湖北省', // 省
    city: '荆州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'hubeiCuisine', // 菜系编码
    cuisineCategoryName: '楚菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '湖北省', // 省
    city: '荆州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'hubeiCuisine', // 菜系编码
    cuisineCategoryName: '楚菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
