/**
 * 湖北-襄阳市-特产美食
 * 
* 襄阳夹沙肉,襄阳夜壶油茶,襄阳玉带糕,襄阳糊辣汤,* 三镶盘,夹沙肉,襄阳缠蹄,红烧蹄膀,糖醋白菜,清蒸槎头鳊,泡菜牛肚丝,酱猪大骨,酱爆肉,宜城盘鳝,宜城大虾,* 油茶,清汤,米窝,油馍筋,牛油面,红油豆腐面,襄阳酸辣面,酸浆面,炸酱面,胡辣汤,麻汁面,包面,炒糊波,襄阳薄刀,襄阳黄酒,金刚酥,玉带糕,* 襄阳大头菜,糖醋白菜,王府小点,襄阳糊辣汤,金刚酥,豆腐面,宜城红心咸鸭蛋,襄樊凉面,襄阳薄刀,牛油面,宜城板鸭,襄阳缠蹄,襄樊叫化鸡,泡菜牛肚丝,


 * 
 * 
襄阳夹沙肉、襄阳夜壶油茶、襄阳玉带糕、襄阳糊辣汤等 [65] 
襄阳菜是楚菜系的北味菜，以襄阳和郧阳（今十堰）地区的风味为基础，吸收鄂豫陕渝四省的风味。特点是以猪、牛、羊肉为主要原料，加以该地区特产山珍和野味，制作方法以红扒、热烧、生炸、回锅、凉拌居多。巴蜀荆楚地区的人们生性嗜辣，几乎所有的菜都要用辣椒，与麻辣的楚菜、猛辣的湘菜不同，楚菜讲究的是鲜辣。
襄阳菜既有着楚菜鲜辣的特点，又保持着自己的风味，烹制手法以蒸、煨、炸为主，尤喜菜上淋油。襄阳名菜有三镶盘、夹沙肉、襄阳缠蹄、红烧蹄膀、糖醋白菜、清蒸槎头鳊、泡菜牛肚丝、酱猪大骨、酱爆肉、宜城盘鳝、宜城大虾等。
襄阳市的小吃品种如油茶、清汤、米窝、油馍筋、牛油面、红油豆腐面、襄阳酸辣面、酸浆面、炸酱面、胡辣汤、麻汁面、包面、炒糊波、襄阳薄刀、襄阳黄酒、金刚酥、玉带糕等。
襄阳大头菜
襄阳大头菜，湖北省襄樊市襄州区特产，中国国家地理标志产品。大头菜与榨菜一样，都是芥菜的变种。榨菜是茎用芥菜，大头菜是根用芥菜，雪里蕻是叶用芥菜。而芥末调料，是芥菜的种子碾磨成的。襄阳大头菜的腌制，须三腌、五卤、六晒，这一独特工艺，被授予省级非物质文化遗产。襄阳大头菜是中国四大名腌菜之一，据《中国风物志》记载，为诸葛亮隐居襄阳隆中时所创，民间素有诸葛菜、孔明菜之美称。它含有丰富的氨基酸、维生素、纤维素、铁、锌、钙、磷等多种人体所需的微量元素，入口脆嫩味美，生津开胃，酱香浓郁，并具有下气消食、利尿除湿、解毒消肿之功效，屡获省、部及全国名优产品称号，被国务院副总理邹家华赞为“中国一绝”。2007年09月06日，原国家质检总局批准对“襄阳大头菜”实施地理标志产品保护。
糖醋白菜
糖醋白菜，是以白菜为主要材料制作的药膳，为楚菜系、湖北菜系，口味甜酸适度。
王府小点
王府小点是湖北襄阳的地方传统名点。
襄阳糊辣汤
襄阳糊辣汤为襄阳市独有的一种经济实惠的风味小吃。糊辣汤用料讲究，佐料齐全。主要用料有粉条、面筋、山药、黄花、木耳、带丝、牛肉丁等，佐料有胡椒、丁香、肉桂、草果、西茴、豆蔻等，混合碾碎，经过箩筛。其做法是：先将主料煮熟，再用糖浆加色，并用洗面筋的水打黄。做好后的汤呈粉红透明的糊状。热乎乎的，微辣而味长。
金刚酥
金刚酥，湖北襄阳著名的传统特色小吃，主要原料是面粉、食糖、麻油及少量食碱。发酵后，掺揉制成马蹄形饼，然后放入特制的大烘炉内焖烤4个小时。其色焦黄、香脆、不沾牙齿、落口后“酥口易化”，牙不好，无牙者都可食用。
豆腐面
豆腐面是湖北襄阳枣阳市的传统小吃，以普通的碱面为主要原料。襄阳豆腐面的比较讲究，里面有二十多种作料。金灿灿的炸豆腐，配上炖海带、猪血块，合着细长的碱面，侵在香浓的牛油汤里，真是让人闻香止步。
宜城红心咸鸭蛋
宜城红心咸鸭蛋是湖北省著名的特色产品。
襄樊凉面
襄樊凉面是湖北襄樊地区的传统面食，据传，唐代民间即食凉面。杜甫有诗曰：“新面来近市……经齿冷于雪，君王纳凉晚，此味亦时须。”凉面的吃法， 《清稗类钞》中记载：“率为白水所煮，将进面时，即有生疏数小蝶，陈于几，曰面马。意为前马之导也，而和以调料而加于面。”所谓“面马”，也叫“菜马”。有麻汁、食醋、蒜泥、黄瓜丝、胡罗卜菜末、香椿菜末、盐水等。将煮好的面条用冷水淘凉后，盛于碗中，浇上菜马拌匀即成。可根据各人的口味自浇自拌，十分方便。因为襄阳人喜欢吃生蒜，故蒜泥必不可少，再加以食醋，不仅取其味，又可消毒杀菌，实为受大众欢迎的夏令佳食。
襄阳薄刀
襄阳薄刀是湖北省襄阳市著名的传统小吃。据说与三国时期的关羽有关，它的制作方法是由发的很有精道的粗面，蒸上15-20分钟。配上黑木耳等食材，和切的很细很长的胡箩卜丝，很嫩的肉丝以及红、青番椒丝，然后用特殊的工具把面压成1/3小拇指粗的面条，炒制而成。
牛油面
牛油面是湖北省襄阳市的一种特色面食，其特点是一辣二麻三鲜，味道可口，回味悠长，久食不厌，且牛油面是襄阳人最喜欢的早餐之一。襄阳经典面食还有荤系（牛杂面、牛肉面）和素系（豆腐面、海带面）。荤系是在牛油面中加入牛肉或者牛杂等肉类，一般有辣椒。素系是在牛油面中加入豆腐海带等素菜，一般不放辣椒。牛油面和热干面不是一个种类，牛油面属于汤面。热干面属于拌面。
宜城板鸭
宜城板鸭，湖北省宜城市特产，中国国家地理标志产品。宜城板鸭选料考究、加工精细，每年农历九月开始制作，到翌年二月二结束，尤以霜风天制作的板鸭品质最佳。用传统方法腊制板鸭、酱板鸭、水板鸭营养丰富，味美可口，含有铜、锌、铁、钙等十多种人体需要的微量元素和营养物质。宜城板鸭具有外形方正、质于板状、宽阔体肥、皮白肉红、质嫩致密、腊香浓郁、味觉回甜等特点，概括地评价为“干、板、酥、烂、香”5个字。2006年07月12日，原国家质检总局批准对“宜城板鸭”实施地理标志产品保护。
襄阳缠蹄
襄阳缠蹄，是湖北省襄阳市的特色小吃。襄阳缠蹄是传统的佳肴。将猪蹄肉用多种香料腌渍数天。后用细麻绳缠紧在通风处吹晾，数日后即可取下煮熟食之。此菜多用于冷盘拼盘，色泽红亮，肉质清香，佐以姜丝米醋，余味幽长，是下酒的好菜。
襄樊叫化鸡
襄樊叫化鸡是以鸡为主料制作的菜品。
泡菜牛肚丝
泡菜牛肚丝是以牛肚为主要食材制成的一道湖北省襄阳市地方传统名菜。


*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const xiangyangFoodsList = [
  // 灯影牛肉
  {
    province: '湖北省', // 省
    city: '襄阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'hubeiCuisine', // 菜系编码
    cuisineCategoryName: '楚菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '湖北省', // 省
    city: '襄阳市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'hubeiCuisine', // 菜系编码
    cuisineCategoryName: '楚菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
