/**
 * 湖北-仙桃市-特产美食
3、沔阳三蒸，有粉蒸、清蒸、扣蒸、泡蒸、花样造型蒸等多种蒸菜技法。
4、沔阳三腊，腊鱼、腊肉、腊鸡鸭，与沔阳三蒸齐名，风味独特，享誉荆楚。每逢春节前夕选料、腌制。
10、毛嘴卤鸡，荣获首届中国国际食品博览会金奖，湖北省展销会金奖。
11、锅块，主料是和好的面，面里有大蒜苗，表面撒有芝麻，是仙桃市特有的早点小吃。
沔阳粉蒸肉
沔阳粉蒸肉是沔阳三蒸之一，湖北沔阳（今仙桃市）地方传统名菜，属于湖北菜系，是湖北美食中的一朵奇葩，在中国名菜系中占有重要的一席之地。沔阳人民爱吃蒸菜，有"无菜不蒸"的食俗，被称为蒸菜之乡。沔阳粉蒸肉用新鲜猪五花肉为主料，米粉制成。成品色泽粉红，肉质柔嫩，滋味鲜美，肥而不腻。2010年，“沔阳三蒸及其蒸菜技艺”已经被湖北省政府列入为省级非物质文化遗产。
仙桃蒸三元
仙桃蒸三元是湖北省沔阳（今仙桃市）的传统名菜之一，具浓郁地方特色。是沔阳民间，婴儿满月，婚丧喜事，生日、祝寿等酒宴上必不可少的主菜。 “仙桃蒸三元”，即蒸肉圆、蒸豆腐圆、蒸珍珠圆（又名素衣圆子，糯米圆子）。如今沔阳人习惯用“沔阳三蒸”欢宴待客，以示喜庆和郑重。有趣的是其中的“蒸珍珠丸子”，美如工艺制品，入口之鲜不能不令客人叫绝。此物系用猪肉和鱼碎末拌鸡蛋液，加粉芡、米粉及佐料制丸上笼蒸熟。入盘时特别洁白剔透，玲珑小巧，犹如粒粒珍珠落入玉盘之中，使人大饱眼福，食之有无穷的美感，食后更使人久久难以忘怀当年陈夫人的美德。
九珠皮蛋
九珠皮蛋是湖北省地方传统名菜。沔阳松花皮蛋改进为“九珠皮蛋”后，其品质更上一层楼。去壳的皮蛋，蛋白呈深褐色或草青色，结晶透明，松花点缀，美若玉雕。蛋黄紧缩，切开后，似菊花绽蕾，又如砂糖裹心。质地醇美，味道绵长，清凉爽口，四时咸宜，被定为出口的免检食品，为祖国的四化建设作出了贡献。
红庙酥饼
红庙酥饼的产地是湖北仙桃地区的传统特色小吃，拥有着悠久的历史沉淀，据史料记载，红庙酥饼创始于清朝。经清朝乾隆皇帝品尝之后红庙酥饼闻名遐迩，并以它独特的风味，闻名遐迩。
郑场豆豉
郑场豆豉是湖北省仙桃市郑场镇生产的豆豉，主要原料是黄豆。
沔阳三腊
“沔阳三腊”：腊肉、腊鱼、腊鸡，是沔阳（今湖北仙桃）的一大风味，它与“沔阳三蒸”齐名，享誉荆楚，驰名九州，独具特色，堪称沔阳饮食文化中的杰作。沔阳人一提起腊肉炒藜蒿，腊鸡煨火锅，就会口中“泉涌”，咕咕哽咽。 肉、鱼、鸡之所以都冠以“腊”字，是因为这些食品都是在腊月腌制而成的，具有鲜明的时令性。
沙湖豆皮
沙湖豆皮是湖北省沔阳（今仙桃市）的传统食品之一，具浓郁地方特色，因地产沔阳，如今也成为老沔阳豆皮。作为是老沔阳的特色小吃，既可当下酒的菜，又能作主食来饱肚子。其名称也是依据制作时作用材料加以命名。主要的原料用绿豆或红豆（饭豆子）和少量的黄豆再去掺细米，又以早谷细米为佳。经过磨制、摊敷而成。豆类又以选用绿豆为最，故称为绿豆豆饼或统称为豆饼。
沔阳珍珠丸
沔阳珍珠丸是一种美食，主料有猪肉
沙湖盐蛋
沙湖盐蛋是湖北仙桃市沙湖镇的传统名菜。在沙湖镇周围，水中有一种水草叫麦黄角，活虾喜栖于角中，鸭子寻食连角带虾吞食后，所产鸭蛋的蛋黄呈红色，腌制的盐蛋如打破后将蛋黄蛋清置于白色瓷碗中，则见蛋黄像一朵色泽艳红的花朵，十分美观。如将盐蛋煮熟食用，则见蛋白极白，蛋黄艳红带油，味道比一般盐蛋好吃多了。沙湖盐蛋曾经是贡品。
沔阳三蒸
沔阳三蒸，是湖北沔阳（今仙桃市）的汉族传统名菜之一，属于湖北菜系。沔阳三蒸是以水产类、禽畜类、蔬菜类为主要原料，以粉蒸为主要技法，清蒸、扣蒸等多种蒸菜技法并用制成的系列菜肴，更有民谚“三蒸九扣十大碗，不上蒸笼不成席”，蒸菜已成为仙桃独特的饮食习俗，具有广泛的群众基础。此菜鲜嫩软糯，原滋原味，清淡，绵软。是湖北美食中的一颗明珠，在中国名菜系中占有重要的一席之地。“清蒸菜最能保证营养不受损失”的提法现在已广为人知，“沔阳三蒸”也由此在“吃要吃的科学”浪潮中重焕青春。颇为荤素搭配营养均衡，粉蒸菜都裹着捣细的米粉，菜的本香配上大米的清香，回味深长。2010年，“沔阳三蒸及其蒸菜技艺”已经被湖北省政府列入为省级非物质文化遗产。2015年在首届沔阳三蒸文化节上，仙桃被授予“中国沔阳三蒸之乡”称号。2018年9月10日，“中国菜”在河南省正式发布，“沔阳三蒸”被评为“中国菜”之湖北十大经典名菜。2020年12月3日，《楚菜标准》正式发布，“沔阳三蒸”作为首批21道菜入选。
沙湖咸蛋
沙湖沔阳州选用食用天然饲料鸭子产的鸭蛋加工而成的红心咸蛋煮熟切开后，蛋白如凝脂白玉，蛋黄似红桔流丹，让人赏心悦目，食欲顿开。品之，则芳香可口，风味别致。
毛嘴卤鸡
毛嘴卤鸡是湖北省仙桃市传统名菜之一，采用五谷杂粮喂养而成，肉质细嫩，口味绵长。在卤制过程中，再配以蜂蜜 杜仲、肉茴、枸杞、八角等十八种名贵中药及天然香料，用百年循环卤汁加毛嘴特有的传统工艺加工而成。毛嘴卤鸡号称荆楚一绝，在大江大北赢得美名美誉。之所以好吃，就因为毛嘴卤鸡肉质细嫩、油而不腻、香醇可口、品味绵长。
仙桃鳝鱼米粉
鳝鱼米粉是仙桃当地的名小吃，早餐必备，相当于武汉的热干面一样。粉细如丝缕，汤汁浓稠、爽滑可口，滋味鲜香，熬汤的料要选用野鳝鱼骨、猪腿骨和肉皮，熬出来的汤鲜，味长，将新鲜的大米泡制8小


*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const xiaoganFoodsList = [
  // 灯影牛肉
  {
    province: '湖北省', // 省
    city: '孝感市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'hubeiCuisine', // 菜系编码
    cuisineCategoryName: '楚菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '湖北省', // 省
    city: '孝感市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'hubeiCuisine', // 菜系编码
    cuisineCategoryName: '楚菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
