/*
 * @Author: vigne 1186963387@qq.com
 * @Date: 2023-10-20 19:04:17
 * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/beijing/name.js
 * @Description:
 *
 * Copyright (c) 2023 by ${git_name_email}, All Rights Reserved.
 */
// 冰糖葫芦,小窝头,果脯蜜饯,灌肠,炒肝,爆肚,艾窝窝,茯苓饼,茶汤,豆汁,豆面酥糖,豌豆黄,酸梅汤,驴打滚,
// 三不粘,三味全蟹,三鲜酿豆腐,乌龙吐珠,五彩葫芦,五彩鱼皮丝,京东侉炖鱼,京味扣荤素,京酱肉丝,元宝肉,兄弟全鱼,八仙鸭子干货水产,北京烤肉,北京烤鸭,四味三文鱼,四喜丸子,姜汁排叉,它似蜜,官烧目鱼,宫府鲍鱼,小楼烧鲇鱼,小鸡酥,带把肘子,干烧冬笋,开口笑,抓炒里脊,拔丝莲子,拔丝鸡盒,板栗金塔肉,梅花干贝,毛豆烧茄子,涮羊肉,清汤燕菜,清蒸炉肉,清酱肉,清酱茄子,湛香鱼片,潘鱼,炉肉扒海参,炒合菜,炒成什,炒榛子酱,炒肉丝拉皮,炒豆酱,炒赛蟹,炒鸭丝掐菜,炒麻豆腐,炒黄瓜酱,炸烹虾段,炸馓子,炸香椿鱼,烩乌鱼蛋,焦圈,焦熘馅馇,煎蒸黄鱼,爆炒腰花,爆羊三样,爱窝窝,玉兔五彩丝,玉黍鳜鱼,珍珠鲍鱼,福寿肘子,紫酥肉,红娘自配,红梅珠香,红烧海参,翡翠裙边,肉丝炒如意菜,芥末墩,芫爆肚丝,花篮蟹肉,茧儿羹,莲蓬豆腐,菊花烩鸡丝,菊花羊肉,葱爆羊肉,蟠龙菜,蟹子烧鲨鱼皮,蟹黄鱼翅,象牙鸡条,贵妃鸡,辣油雪贝,酥小鲫鱼,酥炸牛肉,酥炸番茄,酥炸银鱼,酸菜羊肉,醋熘木须,金丝海蟹,金丝韭菜,钳子米炒芹菜,雪花桃泥,鸡蓉燕菜,麻酱冬瓜脯,黄焖羊肉,黄焖鱼翅,黄豆疙瘩丝
