/*
 * @Author: vigne 1186963387@qq.com
 * @Date: 2023-10-20 19:04:17
 * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/liaoningProvince/name.js
 * @Description:
 *
 * Copyright (c) 2023 by ${git_name_email},All Rights Reserved.
 */
// 三盛源饺子,不老林,亮中桥干豆腐,凌源烧鸡,剥面,北镇猪蹄,咸鱼饼子,喇嘛粥,喇嘛糕,四季面条,塔糖,大头宝氽丸子,大清花饺子,大米嘎巴,姜葱炒蟹,宝发园四绝菜,家炖大头宝,岩明火勺,干煎河刀鱼,开口馅饼,张久礼烧鸡,打糕,拌蚬子,拌鸡架,朝鲜族烤牛肉,李记坛肉,李连贵熏肉大饼,杏仁小米粥,杨家吊炉饼,汤河鲜鱼,沈阳小土豆,沟帮子水馅包子,沟帮子熏鸡,河蟹,海鲜焖子,海鲶鱼炖豆腐,清沟鱼宴,潘家肘子,灯笼海参,炒焖子,炒鸡架,炸鸡架,烀鸡架,烤牛肉,烤鸡架,煮鸡架,熏鸡架,生卤海蟹,生拌花虾,盖州现编,碗砣,碱蓬菜团子,老世泰糕点,老四季,老山记海城馅饼,老杨头烧鸡,老边饺子,茄子炒蚬子,葱烧文蛤,葱爆羊肉,蒙族馅饼,虹螺岘干豆腐,虾爬子,西塔大冷面,辣串,辽西火锅,过油肉,那家馆白肉血肠,酱焖海兔,铁板鸡架,锦华烧鸡,锦州什锦小菜,锦州烧烤,马家烧麦,骚夹子豆腐,高楼香鸡,鲅鱼炖白菜,鸡架,麻花,
