/**
 * 江苏-淮安市-特产美食
淮扬菜
淮扬菜主要发源于淮安市、扬州市，与鲁菜、江苏菜、苏菜、粤菜并称为中国四大菜系。淮扬菜，始于春秋，兴于隋唐，盛于明清，素有“佳味之美”之誉。
淮扬菜原料多以水产为主，以江湖河鲜为主料，以顶尖烹艺为支撑，以本味本色为上乘，以妙契众口为追求，雅俗共赏而不失其大雅，尤其是“和、精、清、新”的理念。
淮扬菜刀功较精细，尤以瓜雕享誉四方。菜品形态精致，滋味醇和；在烹饪上则善用火候，讲究火功，擅长炖、焖、煨、焐、蒸、烧、炒；原料多以水产为主，注重鲜活，口味平和，清鲜而略带甜味。著名菜肴有清炖蟹粉狮子头、大煮干丝、三套鸭、软兜长鱼等。
捆蹄
捆蹄是一道名菜，属于苏菜系；历史悠长，是江苏淮安涟水县高沟镇的特产。其中，有名的高沟捆蹄系属市级非物质文化遗产之一。自古就流传着“中秋向后日渐凉，高沟捆蹄相争尝，购货客人如云涌，只惜生产供不上”的民谣。此菜色泽酱红，咸鲜香甜，鲜嫩可口，食之不腻，细嚼慢品，回味无穷，初尝食味，久嚼生津。以猪肉为制作主料，高沟捆蹄的烹饪技巧以卤菜为主，口味属于咸甜味。
盱眙龙虾
盱眙龙虾，江苏省淮安市盱眙县特产，中国国家地理标志产品。盱眙龙虾是淡水龙虾，又称克氏螯虾，一般在盱眙境内的陡湖、洪泽湖、天泉湖、猫耳湖、天鹅湖、八仙湖等河湖水塘生长、繁育，是中国重要的水产资源，被列入中国农业入世后的战略发展规划。该种群发展特别快，尤其是每年的5—9月份更是生长旺季，已成为优势种群。盱眙龙虾体色红亮，富有光泽；体表干净无污物，活力强；肉质鲜嫩、肥硕饱满。从中医的角度看，盱眙龙虾具有清热解毒、强身健体等功效，是一种色、香、味、营养俱佳的美味保健食品。2009年06月11日，原国家质检总局批准对“盱眙龙虾”实施地理标志产品保护。2019年11月，入选中国农业品牌目录2019农产品区域公用品牌。2023年6月12日，中国农业大学国家农业市场研究中心发布称，2023年盱眙龙虾品牌价值已达353.12亿元。
安东萝卜干
安东萝卜干是一道美味可口的传统名菜，属于江苏菜。安东县，是现在江苏省淮安市涟水县的旧称，由于此地的制作的萝卜干味道别具一格，因此取名安东萝卜干。清代即已擅名淮海间。萝卜干制作有生干、熟干之别。熟干临食用时，必须加以烹调，方德呈其美味。生干则不待烹调，即可为菜。其制作方法并不复杂。制熟干：将萝卜洗净去须，大者纵剖四瓣，小者二瓣。放入笼内，蒸至八分熟取出，晒干。然后藏之瓮中·味永不变。还可将猪肉等加入其中，则别呈风味。如果在食用时，在萝卜干中加入虾米进行烹调，其味更是鲜美。
洪泽湖白鱼
洪泽湖白鱼是泗洪县地方特色美食，食材选自中国四大淡水湖之一洪泽湖的白鱼。洪泽湖白鱼属于名贵鱼类，少刺多肉，从隋朝开始就成为进献皇室的贡品。有较高的药用价值，具有补肾益脑，开窍利尿等作用。俗称翘嘴红舶、娇鱼、白扁鱼、黄白鱼、翘嘴、大白鱼、翘嘴白鱼
涟水鸡糕
涟水鸡糕是涟水地区传统糕类特产。鸡糕细嫩，造形雅致，营养丰富，深受老人喜爱。制作鸡糕是以鸡胸脯肉为主料，配之以适量的鲜虾仁、鸡蛋、山药、豆粉、葱姜汁等辅料，加上十多种调味品制作而成。2020年9月，入选江苏省百道乡土地标菜名单。
煎藕夹
煎藕夹是江苏金湖著名的传统小吃。主要原料有藕、自发粉、生粉、肉馅等。
淮阴鸡粥蒲菜
淮阴鸡粥蒲菜是一道由生鸡脯肉和蒲菜为主要材料做成的菜品，属于家常菜粥。
洪泽湖河蚬
洪泽湖河蚬，江苏省淮安市特产，全国农产品地理标志。河蚬又称黄蚬、金蚶、扁螺等，是双壳类软体动物，栖息于淡水的湖泊、沟渠、池塘及咸淡水交汇的江河中。河蚬可以作为中药的药材，有开胃、通乳、明目、利尿、去湿毒、治肝病、麻疹退热、止咳化痰、解酒等功效。洪泽湖河蚬是洪泽湖特种水产品之一，也是重要的生态和经济水生物种，其良好的品质、极佳的口感以及一定药用的功能，使得它在日韩市场上颇受欢迎，被誉为洪泽湖渔民的“金疙瘩”。2015年7月22日，原中华人民共和国农业部正式批准对“洪泽湖河蚬”实施国家农产品地理标志登记保护。
朱桥烩甲鱼
朱桥烩甲鱼是一道传统名菜，属苏菜系，此菜营养丰富，肉质细嫩、味道鲜美，实为筵席之珍品。此外，还可清蒸、清炖、红烧，风味各异。淮安市东南水乡以鱼米著称，水乡湖面滩涂广阔，是甲鱼生长繁殖的天然优良场所。朱桥镇早在本世纪内30年代初就以烩制甲鱼著称，距今已有五六十年的历史。
十三香小龙虾
十三香小龙虾，是一道淮扬菜美食，产自江苏盱眙的汉族小吃，用小龙虾和特制的调味料磻溪十三香（数十种中草药混合），再配以辣椒、花椒、葱姜蒜盐糖、洋葱、青椒、料酒等材料烧制而成，有麻、辣、鲜、香、甜、嫩、酥七种口感，十分富有营养。“十三香”已非当初简简单单的五香加八大味共计十三种香料，而是多种乃至几十种香料的结合。故此基于十三香搭配的不同，十三香小龙虾也衍生出八大门派、二十七种烧制方法、多种多样的不同的香料配方及菜品口味。菜式上，还可以做成十三香小龙虾鲜锅、麻辣十三香小龙虾等。
淮安蒲菜
淮安蒲菜，江苏省淮安市特产，全国农产品地理标志。蒲菜尤以古城淮安（今淮安区）西南隅天妃宫所产为肥美，菜体洁白如玉，食之肥嫩清香，素有“天下第一笋”的美誉。淮安蒲菜食用部分为幼嫩叶鞘包裹而成的假茎。假茎乳白色，圆润饱满，长度不低于35厘米，基部直径不小于1.5厘米。生食鲜嫩多汁，清香微甜，无涩味；熟食爽嫩柔软，无渣。2014年5月，原中华人民共和国农业部正式批准对“淮安蒲菜”实施农产品地理标志登记保护。
洪泽湖青虾
洪泽湖青虾，江苏省宿迁市泗洪县特产，全国农产品地理标志。 “洪泽湖青虾”体型均匀完整，气味清新。鲜活时，洪泽湖青虾个体甲壳较薄、光亮且半透明；肌肉紧密，有弹性。如集群，体色整体呈现半透明亮青色状。“洪泽湖青虾”触须长度大于体长，而一般青虾须长小于体长。煮熟后，“洪泽湖青虾”香味浓郁，集群体色红而不艳、背红腹白。2015年11月05日，原中华人民共和国农业部批准对“洪泽湖青虾”实施国家农产品地理标志登记保护。
金湖甲鱼
金湖甲鱼是甲鱼的一种，为灰黑色（纯野外长大的甲鱼有灰黑色、土黄色、褐底黑斑色等，而家养甲鱼则多呈黑中透绿色、黄中带绿色、绿青苔色等。），主要生活在荷塘。

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const huaiAnFoodsList = [
  // 灯影牛肉
  {
    province: '江苏省', // 省
    city: '淮安市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangsuCuisine', // 菜系编码
    cuisineCategoryName: '江苏菜、苏菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '江苏省', // 省
    city: '淮安市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangsuCuisine', // 菜系编码
    cuisineCategoryName: '江苏菜、苏菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
