// /*
//  * @Author: vigne 1186963387@qq.com
//  * @Date: 2023-10-20 16:02:51
//  * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/jiangsuProvince/name.js
//  * @Description:
//  *
//  * Copyright (c) 2023 by ${git_name_email}, All Rights Reserved.
//  */
// // ### 菜肴

// // ### 小吃

// 苏菜即江苏菜系。江苏菜系在烹饪学术上一般称为“苏菜”，由南京、徐海、淮扬和苏南四种风味江组成，是宫廷第二大菜系，今天国宴仍以淮扬菜系为主。江苏菜系选料讲究，刀工精细，口味偏甜，造型讲究，特色鲜明。由于江浙地区气候潮湿，又靠近沿海，所以往往会在菜中增加糖分，来去除湿气。江苏菜很少放辣椒，因为吃辣椒虽然能够去除湿气，但是容易上火。因此，江浙菜系是以偏甜为主。苏菜风格源于宋代开封，宋室南迁带入并逐渐占据主要地位。今天开封饮食仍然与江苏有诸多相同之处，如小笼包、桂鱼等等。 [16] （1）金陵风味以南京菜为代表，主要流行于以南京为中心，一直延伸到江西九江的地区。金陵菜烹调擅长炖、焖、叉、烤。特别讲究七滋七味：即酸、甜、苦、辣、咸、香、臭；鲜、烂、酥、嫩、脆、浓、肥。南京菜以善制鸭馔而出名，素有“金陵鸭馔甲天下”的美誉。金陵菜代表菜品有金陵鸭、金陵鲜、金陵草等。南京小吃是中国四大小吃之一。代表有小笼包子、拉面、薄饼、葱油饼、豆腐涝、汤面饺、菜包、酥油烧饼、甜豆沙包、鸡面干丝、春卷、烧饼、牛肉汤、小笼包饺、压面、蟹黄面、长鱼面、牛肉锅贴、回卤干、卤茶鸡蛋、糖粥藕等。（2）淮扬风味以扬州、淮安菜为代表，主要流行于以大运河为主，南至镇江，北至洪泽湖、淮河一带，东至沿海地区。淮扬风味选料严谨，讲究鲜活，主料突出，刀工精细，擅长炖、焖、烧、烤，重视调汤，讲究原汁原味，并精于造型，瓜果雕刻栩栩如生。口味咸淡适中，南北皆宜，并可烹制“全鳝席”。淮扬细点，造型美观，口味繁多，制作精巧，清新味美，四季有别。著名菜肴有清炖蟹粉狮子头、大煮干丝、三套鸭、文思豆腐、扬州炒饭、文楼汤包、拆烩鲢鱼头、扒烧整猪头、水晶肴肉等。（3）徐海风味以徐州菜为代表。流行于徐海和河南地区，和山东菜系的孔府风味较近。徐海菜鲜咸适度，习尚五辛、五味兼崇，清而不淡、浓而不浊。其菜无论取料于何物，均注意“食疗、食补”作用。另外，徐州菜多用大蟹和狗肉，尤其是全狗席甚为著名。徐海风味菜代表有：羊方藏鱼（据说是以此菜创造出“鲜”字）、霸王别姬、沛公狗肉、彭城鱼丸，地锅鸡等。（4）苏南风味以苏州菜为代表，主要流行于苏锡常和上海地区。和浙菜、安徽菜系中的皖南、沿江风味相近。苏南风味与浙菜的最大的区别是苏南风味偏甜。苏南风味擅长炖、焖、煨、焐，注重保持原汁原味，花色精细，时令时鲜，甜咸适中，酥烂可口，清新腴美。苏南名菜有香菇炖鸡、咕咾肉、松鼠鳜鱼、鲃肺汤、碧螺虾仁、响油鳝糊、白汁圆菜、叫化童鸡、西瓜鸡、鸡油菜心、糖醋排骨、桃源红烧羊肉、太湖银鱼、太湖大闸蟹、阳澄湖大闸蟹。松鹤楼、得月楼是苏州的代表名食楼。苏州小吃是中国四大小吃之一，是品种最多的小吃，主要有卤汁豆腐干，松子糖，玫瑰瓜子，苏式月饼、虾子酱油，枣泥麻饼，猪油年糕、小笼馒头、苏州汤包、桃源红烧羊肉、藏书白切羊肉、奥灶面等。有人用一首民谣概括苏州小吃：姑苏小吃名堂多，味道香甜软酥糯。生煎馒头蟹壳黄，老虎脚爪绞连棒。千层饼、蛋石衣，大饼油条豆腐桨。葱油花卷葱油饼，经济实惠都欣赏。香菇菜包豆沙包，小笼馒头肉馒头。六宜楼去买紧酵，油里一汆当心咬。茶叶蛋、焐熟藕，大小馄饨加汤包。高脚馒头搭姜饼，价钿便宜肚皮饱。芝麻糊、糖芋艿，油汆散子白糖饺。鸡鸭血汤豆腐花，春卷烧卖八宝饭。糯米粢饭有夹心，各色浇头自己挑。锅贴水饺香喷喷，桂花藕彩海棠糕。臭豆腐干粢饭团，萝卜丝饼三角包。蜜糕方糕条头糕，猪油年糕糖年糕。汤团麻团粢毛团，双酿团子南瓜团。酒酿园子甜酒酿，定胜糕来梅花糕。笃笃笃笃卖糖粥，小囡吃仔勿想跑。赤豆粽子有营养，肉粽咸鲜味道好。鸡头米、莲子羹，糖炒栗子桂花香。枣泥麻饼是特产，卤汁豆腐干名气响。

// 著名的菜肴有：金陵烤鸭、老鸭汤、炖生敲、鸭包鱼翅、水晶肴蹄、松鼠桂鱼、西瓜鸡、盐水鸭、清炖甲鱼、鸡汁煮干丝等。

// 苏州菜系中的特色小吃包括枣泥拉糕、小方糕、三鲜馄饨、酒酿圆子、豆腐花、船点、青团子、八宝饭等等。金陵菜口味和醇，玲珑细巧，一千多年前，鸭已为南京美食；扬州菜清淡适口，刀工精细；苏州菜口味趋甜，清雅多姿。江苏名菜有金陵烤鸭、彭城鱼丸、老鸭汤、烤方、羊方藏鱼、水晶肴蹄、扬州炒饭、清炖蟹粉狮子头、金陵丸子、白汁圆菜、霸王别姬、黄泥煨鸡、清炖鸡孚、盐水鸭、金陵板鸭、碧螺虾仁、蜜汁火方、樱桃肉、母油船鸭、烂糊、地锅鸡、黄焖栗子鸡、红烧沙光鱼、莼菜银鱼汤、万三蹄、响油鳝糊、金香饼、鸡汤煮干丝、肉酿生麸、凤尾虾、三套鸭、无锡肉骨头、梁溪脆鳝、苏式酱肉和酱鸭、沛县狗肉等。

// 南京的金陵烤鸭、老鸭汤、炖生敲、盐水鸭、炖菜核、板鸭、松子肉、凤尾虾、蛋烧卖，苏州的松鼠鳜鱼、三虾豆腐、白汁元鱼、莼菜塘鱼片、胭脂鹅、八宝船鸭、雪花蟹汁、油爆大虾，常熟的叫花子鸡，无锡的镜箱豆腐、樱桃肉、梁溪脆鳝，板浦的荷花铁雀。淮安的长鱼席，即黄鳝席，品种达百种之多。扬州的三套鸭、溜子鸡、卤鸡、清炖甲鱼、火煮干丝、糖醋鳜鱼、双皮刀鱼、文思豆腐、清炖狮子头，镇江的水晶肴蹄、清蒸鲥鱼，靖江的肉脯，徐州的易牙五味鸡、符离集烧鸡、霸王别姬、鸳鸯鸡、葱烧孤雁、乐天鸭子、纪妃伴龙颜、地锅草鸡、古沛郭家烧鸡、徐州三鲤、徐州四孔鲤鱼、龙门鱼、梁王鱼、彭城鱼丸、愈灸鱼、金蟾戏珠、鱼腹藏羊肉、鱼汁羊肉、东坡回赠肉、新沂捆香蹄、太虚丸子、开阳炒苔菜、众星捧月、冬瓜四灵、西楚贡菜、油炸金蝉、长寿面、烙馍、蝴蝶馓子、小孩酥、蜜三刀、稚羹、饣它 汤 [5] 辣汤、丸子汤、热粥、帝王粥、古邳粥、云母羹、龟打，桂花楂糕、苔干、邳州银杏、邳州炒干货、丰县苹果，沛县冬桃、沛县广电冷面，两来风辣汤，睢宁香肠等。羊方藏鱼霸王别姬三套鸭煮干丝狮子头水晶肴蹄金陵盐水鸭松鼠鱼梁溪脆鳝鱼
