/**
 * 江苏-宿迁市-特产美食
 * 特产：
丁嘴金菜
丁嘴金菜（即黄花菜），最为出名的产地，属宿豫区丁嘴镇（现大兴镇）。因为这里水土适合金针菜生长，几乎家家户户都种植，且引进了优良品种，经过历代栽培。形成了独特的优良品系，其中花型大的大菜和大乌嘴良种，约占80%以上。
车轮饼
车轮饼是江苏省宿迁地区的特色传统名点之一，主要原料为面粉、白糖、青红丝、生猪板油、冰糖等，产于洋河、埠子镇一带。车轮饼为油炸食品，需热食，色泽金黄，口感细腻。车轮饼虽为美食，但糖份、脂肪较多，不建议作为主食食用，正常一次性食用1—2块 [19] 。
五香大头菜
宿迁五香大头菜的加工工艺始传于民间作坊，已有600余年的历史。它以宿迁当地的大头菜为原料，经过腌、晾、晒、调、搓、闷等几十道工序加工而成。因其具有五种香味而得名。相传清代乾隆南巡时品尝此菜，赞曰：“五味俱全，宿迁独有”五香大头菜名列宿迁“四大特产”之首。曾获得“巴拿马”金奖和商业部优质产品等荣誉 [20] 。
水晶山楂糕
水晶山楂糕产于支口街道探楚社区，探楚地处废黄河与古运河之间，与骆马湖隔（运）河相望，相距仅有三里左右。境内全部为黄河冲积土，土壤疏松，适合山楂树生长，故探楚为远近闻名的山楂村。水晶山楂糕色红晶莹，酸甜适中，吃起来很开味口，是宿迁招待贵宾的一道名菜 [20] 。
黄墩湖腊豆
黄墩湖腊豆又名纳豆、酱豆、盐豆，俗称水豆豉。这种小菜以咸、鲜、香著称，作为饭前开胃小菜 [20] 。
泗阳膘鸡
膘鸡，江苏泗阳著名的特色小吃之一，红白相间，质地柔韧，肉香扑鼻，夹而食之，不肥不腻，口味鲜嫩。农家婚丧喜庆，多以膘鸡作为“头道菜”上桌，客人评论厨师手艺如何，也都是以膘鸡的制作为标准。2020年9月，入选江苏省百道乡土地标菜名单。
𦠿汤
𦠿汤（sà字写作“𦠿”，左“月”右“䪞”）是中国地方特色传统风味小吃，获得过山东省十大金牌旅游小吃、好客山东网红好物、中国首届金牌旅游小吃称号，入选河南省非物质文化遗产，安徽省宿州市非物质文化遗产。《说苑·杂言》中就有“七日不食，黎羹不糁”的记载。《礼记·内则》称：“糁，取牛、羊肉，三如一，小切之。与稻米二，肉一，合以为饵，煎之。”这里所说的“糁”，颇类今糁。
黄狗猪头肉
黄狗猪头肉是江苏省宿迁市的著名小吃，也称为宿迁黄狗猪头肉、乾隆老汤黄狗猪头肉，为清朝乾隆十二年（1747年）黄德所创。黄狗猪头肉与扬州扒烧整猪头齐名，都是北方猪头肉做法的代表。不同的是，扬州的猪头是整形上桌的，而宿迁的猪头肉是切成块烧的，外形上与红烧肉无异。黄狗猪头肉传统手工技艺已入选宿迁市首批非物质文化遗产目录，此菜被列入《江苏名菜谱》。
宿迁水晶山楂糕
水晶山楂糕是宿迁的传统糕类特产，早在1927年的巴拿马国际博览会上就得过金奖。1959年全国果品加工评比会上，“水晶山楂糕”被评为全国第一名。
霸王别姬
霸王别姬这道菜原名叫做龙凤烩，是徐州人民为了纪念推翻秦朝统治的西楚霸王项羽和大义凛然的妃子虞姬所创制的一道名菜，代代相传并流传至今。解放后，毛泽东、刘少奇、陈毅等党和国家领导同志来徐州视察工作，都品尝过这道名菜，并给予赞扬。这道名菜经已故名厨裴继洪改进，借鸡、鳖形象的烘托，使霸王别姬这一历史题材，含义委婉，意境甚妙。鸡、鳖肉质鲜嫩，汤浓味醇。2018年9月，被评为“中国菜”之江苏十大经典名菜。（概述图来源自：）
车轮饼
车轮饼是江苏省宿迁市的一种特色传统名点，其主要原料为面粉、白糖、青红丝、生猪板油、冰糖等，盛产于宿城区洋河镇（原属泗阳县）。车轮饼为油炸食品，需热食，色泽金黄，口感细腻。车轮饼虽为美食，但糖份、脂肪较多，不建议作为主食食用，正常一次性食用1—2块。注明：日式车轮饼和台湾车轮饼与宿迁车轮饼的做法不相同。



*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const suqianFoodsList = [
  // 灯影牛肉
  {
    province: '江苏省', // 省
    city: '宿迁市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangsuCuisine', // 菜系编码
    cuisineCategoryName: '江苏菜、苏菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '江苏省', // 省
    city: '宿迁市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangsuCuisine', // 菜系编码
    cuisineCategoryName: '江苏菜、苏菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
