/**
 * 江苏-无锡市-特产美食
无锡市特产美食众多，整体口味偏甜，包括有无锡小笼包、酱排骨、油面筋、阳山水蜜桃、太湖三白（银鱼、白虾）、油酥饼、玉兰饼、
无锡酱排骨
无锡酱排骨色泽酱红，酥香入骨，甜咸适中，腴而不肥。一九八二年中央新闻记录电影制片厂在无锡拍摄了酱排骨的烧制销售情况。
阳山水蜜桃
阳山水蜜桃是无锡著名特产之一，已有近七十年的栽培历史。有形美、色艳、味佳、肉细、皮韧易剥、汁多甘厚、味浓香溢、入口即化等特点。水蜜桃的品种很多，其中以早熟的雨花露、中熟的白凤和晚熟的白花水蜜桃为最佳。不仅色、香、味俱佳，而且含有一定的蛋白质、脂肪、维生素及多种矿物质，是畅销港、澳及海外的无锡特产。
清水油面筋
色泽金黄，表面光滑，味香性脆，是无锡的一大特产。
宜兴紫砂壶
紫砂壶的特点是不夺茶香气又无熟汤气，壶壁吸附茶气，日久使用空壶里注入沸水也有茶香。
小笼馒头
无锡小笼馒头是无锡的传统名点，已有百年历史。它选用上等面粉、选料精细，小笼蒸煮。馅心中回入熬熟的蟹黄油，即为著名的蟹粉小笼。
三鲜馄饨
三鲜馄饨，起源于无锡县东亭乡民间，后发展为无锡传统名点。馄饨以鲜肉、开洋、榨菜制成馅心，故称三鲜。
方糕
方糕，无锡传统名点，由崇安寺六芳斋师傅王禹清引进湖州大方糕改制而成，具有常有浓郁的江南风味。
萝卜丝饼
萝卜丝饼为无锡风味小吃。制作方法为先将萝卜洗净刨成丝，用少许食盐略腌后，挤去水分，放入葱末拌匀。另用面粉和冷水调成糨糊状，再用白铅皮做成的椭圆形模勺，底层铺满粉浆，放入萝卜丝，再用面浆封面，放入油锅内煎成金黄色脱模即成。
酒酿棉子圆
酒酿棉子圆在无锡已有百年历史。它选用上等白糯米粉用热水拌和搓揉，切成方块，用扁筛成大小似棉子的小圆子。另将酒酿捣碎和白糖一起放入碗中，将煮熟的圆子连汤盛于碗中即成。
挂粉汤圆
挂粉汤圆又称五色汤圆，是地锡传统名点。吃时下沸水煮熟即可。
糖芋头
无锡传统名点，具有芋艿酥烂、色泽鲜红、甜汤鲜洁、香味四溢等特点。
玉兰饼
1850年由无锡孙记糕团店制，因正值玉兰花开时节而得名。此饼选用糯米粉加开水糅合成小块，做成饼胚，包入菜猪油、豆沙、鲜肉、玫瑰、芝麻等馅心放入平锅用油煎烙。
烧卖
烧卖，是无锡的传统名点之一。该点心选用猪腿肉、猪板油、荠菜或青菜嫩叶，加调料拌成菜肉猪油馅心。
梅花糕
梅花糕是江苏南京、苏州、无锡等江南地区的一种著名的风味特色小吃。源于明朝，发展到清朝时就成为江南地区最著名的传统特色糕类小吃。相传乾隆皇帝下江南时见其形如梅花，色泽诱人，故作品尝。入口甜而不腻、软脆适中、回味无穷，胜过宫廷御点，拍手称快。因其形如梅花，便赐名梅花糕，流传。梅花糕和海棠糕类似，呈金黄色，松软可口，老少皆宜。
宜兴糖芋头
糖芋头是宜兴著名特色的小吃，选用宜兴大浦的特产“香梗芋”、鲜藕、蜜桂花、红米血糯少许，吃时下沸水煮熟即可，香郁适口，软韧滑爽，馅味鲜洁。
糖芋头
糖芋头是江苏无锡地方传统名点。它选用芋头，红糖 ,白糖，甜糯绵软，香郁适口，吃时下沸水煮熟即可，软韧滑爽，馅味鲜洁。
母油船鸭
母油船鸭是江苏省的一道传统名菜，属于苏菜系。在一百多年前，太湖游船众多，船家都在船上煮饭烧菜，供游客食用。船家用整只鸭子，在陶罐中煨制，原汁原汤，香味浓郁，肉质酥烂不碎，深受船客欢迎。因当时此菜尚无正式名称，游客称它为“船鸭”。
刀鱼面
刀鱼面是江苏江阴传统小吃，属于江苏菜。该小吃味道鲜美，和中开胃，对润泽皮肤有好处。刀鱼面面条由新鲜刀鱼茸、蛋清、上等面粉加水搅拌，手工擀制而成。汤则由老母鸡、筒子骨、猪肉糜、刀鱼头尾、猪骨煲成，煮熟的刀鱼面洁白细腻，久煮不烂，既耐咬嚼，又鲜美无比，如再配上火腿丝、蛋皮丝、撒些蒜叶末，更是让人未食生津，堪称一绝。
肉骨头
肉骨头是江苏省无锡市（太湖明珠）的一道传统名菜。它是用猪排骨为主料，制作时将排骨洗净剁成小块，加上桂皮、八角、葱、姜等佐料焖烧，还要加些糖，至酥烂而成。排骨酥香鲜嫩，汤汁浓厚，入口即化，味浓骨离，还略有甜味。
油豆腐干
油豆腐干是江苏省无锡地区传统小吃。将老豆腐用刀切成1厘米厚，逐块放入油锅煎成金黄色，盛入碗中，用剪刀剪碎，浇上熟酱油、甜面酱、葱末、姜末，白糖等佐料即可食用。此小吃香气诱人，外脆内嫩，颇受市民喜爱。
无锡酱排骨
无锡酱排骨，俗称“无锡肉骨头”，是江苏省无锡市的传统菜品，属于苏菜系，体现了无锡菜肴的基本风味。无锡酱排骨选用猪肋条排骨制成，色泽酱红，肉质酥烂，骨香浓郁，汁浓味鲜，咸中带甜。2018年9月，无锡酱排骨入选江苏十大经典名菜。
高塍猪婆肉
高塍猪婆肉是宜兴美肴之一。该肴始出于宜兴高塍镇桃园村陈氏家族，已有一百三十多年历史。高塍猪婆肉色艳、肉香、味鲜、皮沙，为大众喜爱的下酒之物，亦是馈赠亲友的佳品。
无锡小笼包
无锡小笼包又称小笼馒头，是江苏省无锡市的一道传统名菜，属于苏菜系，该菜品已有百年历史，选用上等面粉制作、选料精细、小笼蒸煮，南方口味。具有夹起不破皮，翻身不漏底，一吮满口卤，味鲜不油腻等特色。馒头紧酵皮薄（注：传统无锡小笼馒头做法中，馒头皮不发酵，因此蒸熟后皮薄而不破，很有嚼劲）、馅多卤足、鲜嫩味香，秋冬时，馅心中加入熬熟的蟹黄油，即为著名的“蟹粉小笼”，食时鲜美可口。
和桥豆腐干
和桥豆腐干是江苏宜兴久享盛誉的传统名产，相传已有130多年的历史。因其味特别鲜美，驰名遐迩，清朝的皇帝赞赏它为食中佳品，定为贡品。其特点是干咸而不涩，甜而不腻，香而不厌，细细咀嚼，香喷喷，甜滋滋，咸津津。1950年，宜兴特制和桥豆腐干十多万斤，专程运往朝鲜慰问中国人民志愿军，寄寓祖国家乡人民的一片深情厚意。和桥老油五香豆腐干，清代曾作为贡品。和桥豆腐干于2011年被列入无锡市级非物质文化遗产名录。
梁溪脆鳝
梁溪脆鳝又名无锡脆鳝，是江苏省无锡市的一道传统名菜，属苏菜-无锡菜。相传始创于一百多年前的太平天国时期，系惠山直街一姓朱的油货摊主发明流传下来的。梁溪脆鳝由鳝丝经两次油炸而成，外观酱褐色，乌光发亮，口味甜中带咸、松脆适口、味浓汁酸，即使保存几天，也不致发软。
水发团圆
江阴人用的团圆，历来有两种：一种是用干糯米粉烫熟或炒熟后滚上干粉捏制出来的，另一种是湿米粉筛出来的。用湿米粉筛出来的团圆，俗称水发团圆。其与干粉捏制出来的团圆相比，制作要方便得多，吃口要软糯得多。水发团圆制成后，只要烧上一锅开水，将团圆倒入，待其浮上水面后，便能捞入加了桂花红糖汤的碗中食用。这时的水发团圆又甜又香，又软又糯，口感是颇有特色的。
脆皮银鱼
脆皮银鱼是江苏无锡的一道名菜，外脆里嫩，鲜香可口。银鱼产于中国东南沿海的淡水湖泊，通体洁白如玉，肉质细嫩少刺，是一种稀有名贵淡水鱼，其质量以太湖所产为最佳。据史料记载，银鱼在我国唐宋时期即已为食用。脆皮银鱼系选用优质太湖银鱼经码味、挂糊炸制而成，食时蘸以调料。体态饱满，色泽奶黄，外脆里嫩，鲜美适口，营养丰富。
腐乳汁肉
腐乳汁肉是江苏无锡名菜，据说在光绪三十二年（1906 年）由无锡聚丰园菜馆厨师王荣初刨制。原用红腐乳作调料，现今用红曲米，把肉烧成红腐乳大小，借用红腐乳的形与色，故得其名。又不断改进，把腐乳汁肉与卤鸭同烧，卤鸭与汁肉的滋味互相渗透，肥而不腻，酥烂入味，甜中带咸，色泽红亮，乃无锡喜庆筵席中常用的大菜。无锡太湖船菜中，上此菜时还增配有荷叶夹子，用来夹着汁肉同吃，既以面点代饭，又使面点混和着汁肉的酥肥香润，可谓别有风味。
萝卜丝饼
萝卜丝饼是一道以小麦面粉、萝卜丝和鸡蛋等材料制作的江苏风味小吃，含有蛋白质、脂肪酸、维生素等营养成分，具有防癌、养心益肾等功效。
无锡油面筋
无锡油面筋是江苏省无锡市的一道传统的地方名菜，属于苏菜系，该菜品始于清乾隆时代（18世纪中叶）。由面粉、肉馅等食材制成。当初的制法是将筛过的麸皮加盐水用人力踏成生麸（又称面筋），再将生麸捏成块状，投入沸油锅内煎炸，成为球形中空的油面筋。清水油面筋的称呼在清代末年（19世纪中期）出现。
清水油面筋
清水油面筋是江苏省无锡市的一道传统名菜，属于苏菜系，该菜品与惠山泥人、无锡酱排骨列为无锡三大名产，该菜品创始于清朝咸丰年间，已有近两百年历史。该菜品以小麦蛋白质粉（谷芫粉）为原料，用素油炸制，成品大小均匀、金黄溜圆、油光闪亮、皮薄松脆。油面筋吃法多样，既可加在各种素食中，也能与各种肉类配伍，炒、烧、煮汤均可。尤其是在油面筋中塞进肉糜制成的肉酿面筋，经得起久煮，不破不碎，口味极佳。2016年1月14日，清水油面筋列为江苏省第四批省级非物质文化遗产项目名录，项目序号：33，项目编号：JSⅦ-108。
小笼包
小笼包，本称小笼馒头，是中国著名的汉族传统面点小吃，汤包源于北宋京城开封的灌汤包，早在北宋时期，已有售卖，称灌浆包或灌汤包子。据《东京梦华录》记载，东京汴梁(今开封市)70多家酒店之一的“王楼”，制售的名为“山洞梅花包子”。后又在各地得到发展和演变，形成不同的口味。小笼包在江浙一带习惯叫做小笼馒头，四川、芜湖叫做“小笼包子”，武汉叫做“小笼包”，一个蒸笼里有10个包子，10个包子为一笼。小笼包是常州、无锡、苏州、南京、上海、杭州、宁波、嘉兴等地的传统小吃。清代道光年间出现了现代形式的小笼包，并在各地都形成了各自的特色，如常州味鲜、南京味清、无锡味甜，但都具有皮薄卤足、鲜香美味等共同特点。
惠山油酥
惠山油酥，原名重油烧饼，别名金刚肚脐。是江苏无锡传统名点。相传明末清初，明宗室的朱圣谕携眷来到无锡惠山脚下，一时苦于生计。某日，朱圣谕踱进古华山门 ，目光无意落在坦胸露腹的四大金刚的肚
无锡小笼包
无锡小笼包又称小笼馒头，是江苏省无锡市的一道传统名菜，属于苏菜系，该菜品已有百年历史，选用上等面粉制作、选料精细、小笼蒸煮，南方口味。具有夹起不破皮，翻身不漏底，一吮满口卤，味鲜不油腻等特色。馒头紧酵皮薄（注：传统无锡小笼馒头做法中，馒头皮不发酵，因此蒸熟后皮薄而不破，很有嚼劲）、馅多卤足、鲜嫩味香，秋冬时，馅心中加入熬熟的蟹黄油，即为著名的“蟹粉小笼”，食时鲜美可口。
无锡酱烧肝
无锡酱烧肝是江苏无锡地区传统名菜，历史悠久，滋味隽永。无锡地区都把它当作一种年菜食用。
宜兴糖芋头
糖芋头是宜兴著名特色的小吃，选用宜兴大浦的特产“香梗芋”、鲜藕、蜜桂花、红米血糯少许，吃时下沸水煮熟即可，香郁适口，软韧滑爽，馅味鲜洁。
肉酿面筋
肉酿面筋是江苏省无锡市著名的传统菜肴，逢年过节时，家家都要烧煮。家有客人来临，待客时桌上也少不掉一碗肉酿面筋。肉酿面筋制法相当简单，只要将肉馅塞入无锡清水油面筋中就可以。烧煮时，如再加乘冬笋、香菇、黑木耳、金针菜等，其味更佳。
无锡酱排骨
无锡酱排骨，俗称“无锡肉骨头”，是江苏省无锡市的传统菜品，属于苏菜系，体现了无锡菜肴的基本风味。无锡酱排骨选用猪肋条排骨制成，色泽酱红，肉质酥烂，骨香浓郁，汁浓味鲜，咸中带甜。2018年9月，无锡酱排骨入选江苏十大经典名菜。
水发团圆
江阴人用的团圆，历来有两种：一种是用干糯米粉烫熟或炒熟后滚上干粉捏制出来的，另一种是湿米粉筛出来的。用湿米粉筛出来的团圆，俗称水发团圆。其与干粉捏制出来的团圆相比，制作要方便得多，吃口要软糯得多。水发团圆制成后，只要烧上一锅开水，将团圆倒入，待其浮上水面后，便能捞入加了桂花红糖汤的碗中食用。这时的水发团圆又甜又香，又软又糯，口感是颇有特色的。
腐乳汁肉
腐乳汁肉是江苏无锡名菜，据说在光绪三十二年（1906 年）由无锡聚丰园菜馆厨师王荣初刨制。原用红腐乳作调料，现今用红曲米，把肉烧成红腐乳大小，借用红腐乳的形与色，故得其名。又不断改进，把腐乳汁肉与卤鸭同烧，卤鸭与汁肉的滋味互相渗透，肥而不腻，酥烂入味，甜中带咸，色泽红亮，乃无锡喜庆筵席中常用的大菜。无锡太湖船菜中，上此菜时还增配有荷叶夹子，用来夹着汁肉同吃，既以面点代饭，又使面点混和着汁肉的酥肥香润，可谓别有风味。
清炒大玉
清炒大玉，著名小吃，属苏菜系。
海棠糕
海棠糕是江苏传统糕点，创制于清代，因糕形似海棠花而行名，后逐渐成为江南传统糕类小吃之一。同梅花糕一样，同为一道历史悠久的花色点心，香甜可口，热食尤佳。海棠糕以花生为制作主料，海棠糕的烹饪
刀鱼面
刀鱼面是江苏江阴传统小吃，属于江苏菜。该小吃味道鲜美，和中开胃，对润泽皮肤有好处。刀鱼面面条由新鲜刀鱼茸、蛋清、上等面粉加水搅拌，手工擀制而成。汤则由老母鸡、筒子骨、猪肉糜、刀鱼头尾、猪骨煲成，煮熟的刀鱼面洁白细腻，久煮不烂，既耐咬嚼，又鲜美无比，如再配上火腿丝、蛋皮丝、撒些蒜叶末，更是让人未食生津，堪称一绝。
奶油鲫鱼
奶油鲫鱼是江苏无锡著名的小吃，属于船菜，制作时将鲜活鲫鱼开肚去腮洗净，先放入油锅内两面煎透，然后再加入鸡汤与冷水一起将汤烧成白色即成，这里的奶油不是指需要用奶油熬煮，而是这道菜熬好后，汤色奶白，口感醇厚，如同奶油一般，故而称作奶油鲫鱼，奶油鲫鱼味浓而不腻，肉质鲜嫩可口。
挂粉汤圆
挂粉汤圆是一道陕西特色小吃，是元宵的姊妹品。主料亦为糯米，但制法不同，风味各异。
糖芋头
糖芋头是江苏无锡地方传统名点。它选用芋头，红糖 ,白糖，甜糯绵软，香郁适口，吃时下沸水煮熟即可，软韧滑爽，馅味鲜洁。
肉骨头
肉骨头是江苏省无锡市（太湖明珠）的一道传统名菜。它是用猪排骨为主料，制作时将排骨洗净剁成小块，加上桂皮、八角、葱、姜等佐料焖烧，还要加些糖，至酥烂而成。排骨酥香鲜嫩，汤汁浓厚，入口即化，
梅贡饼
梅贡饼，江苏无锡的传统名点，制于1932年。它选用精白面粉、熟猪油、水做成油酥面粉，将制好的鲜肉、豆沙、枣泥、椒盐、芝麻、玫瑰、葱油、南腿、开洋等各种馅心，分别包入油酥内，下火用大号炭几，上火提炉用白煤，上下夹烘将饼正、反各翻两次，锅面里外对调烘熟即成。梅贡饼呈金黄色，皮酥层薄，出炉热吃，味想可口。
高塍猪婆肉
高塍猪婆肉是宜兴美肴之一。该肴始出于宜兴高塍镇桃园村陈氏家族，已有一百三十多年历史。高塍猪婆肉色艳、肉香、味鲜、皮沙，为大众喜爱的下酒之物，亦是馈赠亲友的佳品。
玉兰饼
玉兰饼是江南地区的传统名小吃，它是用糯米和肉馅做成的。玉兰饼创始于清道光十二年（公元1850年）由无锡孙记糕团店创制的，因正值玉兰花开时节而得名。做时选用糯米粉加开水糅合小块，做成饼胚，包入菜猪油、豆沙、鲜肉、玫瑰、芝麻等馅心，放入平锅用油煎烙，呈金黄色。品质以外皮香脆、内壳软糯、甜咸适口、香味诱人为好。 肉馅要事先拌好佐料，包在糯米和成的面里，然后下锅煎。煎好后的玉兰饼色泽诱人，外脆里香，江南一带的人常用来当早餐和豆浆一起食用，美味还不容易令人发饿。色泽金黄，外皮酥脆，馅心软糯。
萝卜丝饼
萝卜丝饼是一道以小麦面粉、萝卜丝和鸡蛋等材料制作的江苏风味小吃，含有蛋白质、脂肪酸、维生素等营养成分，具有防癌、养心益肾等功效。
清水油面筋
清水油面筋是江苏省无锡市的一道传统名菜，属于苏菜系，该菜品与惠山泥人、无锡酱排骨列为无锡三大名产，该菜品创始于清朝咸丰年间，已有近两百年历史。该菜品以小麦蛋白质粉（谷芫粉）为原料，用素油炸制，成品大小均匀、金黄溜圆、油光闪亮、皮薄松脆。油面筋吃法多样，既可加在各种素食中，也能与各种肉类配伍，炒、烧、煮汤均可。尤其是在油面筋中塞进肉糜制成的肉酿面筋，经得起久煮，不破不碎，口味极佳。2016年1月14日，清水油面筋列为江苏省第四批省级非物质文化遗产项目名录，项目序号：33，项目编号：JSⅦ-108。
和桥豆腐干
和桥豆腐干是江苏宜兴久享盛誉的传统名产，相传已有130多年的历史。因其味特别鲜美，驰名遐迩，清朝的皇帝赞赏它为食中佳品，定为贡品。其特点是干咸而不涩，甜而不腻，香而不厌，细细咀嚼，香喷喷，甜滋滋，咸津津。1950年，宜兴特制和桥豆腐干十多万斤，专程运往朝鲜慰问中国人民志愿军，寄寓祖国家乡人民的一片深情厚意。和桥老油五香豆腐干，清代曾作为贡品。和桥豆腐干于2011年被列入无锡市级非物质文化遗产名录。
脆皮银鱼
脆皮银鱼是江苏无锡的一道名菜，外脆里嫩，鲜香可口。银鱼产于中国东南沿海的淡水湖泊，通体洁白如玉，肉质细嫩少刺，是一种稀有名贵淡水鱼，其质量以太湖所产为最佳。据史料记载，银鱼在我国唐宋时期即已为食用。脆皮银鱼系选用优质太湖银鱼经码味、挂糊炸制而成，食时蘸以调料。体态饱满，色泽奶黄，外脆里嫩，鲜美适口，营养丰富。
镜箱豆腐
镜箱豆腐是江苏省无锡市的一道传统名菜，属于苏菜系，该菜品由无锡迎宾楼菜馆名厨刘俊英创制，选用无锡特产“小箱”豆腐烹制而成。20世纪40年代，迎宾楼菜馆厨师刘俊英对家常菜油豆腐酿肉加以改进，将油豆腐改用小箱豆腐，肉馅中增加虾仁，烹制的豆腐馅心饱满，只形美观，细腻鲜嫩，故有肉为金，虾为玉，金镶白玉箱之称。因豆腐块形如妇女梳装用的镜箱盒子，故取名为镜箱豆腐。此菜呈桔红，鲜嫩味醇，荤素结合，老少皆宜，是雅俗共赏的无锡名菜。


 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const wuxiFoodsList = [
  // 灯影牛肉
  {
    province: '江苏省', // 省
    city: '无锡市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangsuCuisine', // 菜系编码
    cuisineCategoryName: '江苏菜、苏菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '江苏省', // 省
    city: '无锡市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'jiangsuCuisine', // 菜系编码
    cuisineCategoryName: '江苏菜、苏菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
