// /*
//  * @Author: vigne 1186963387@qq.com
//  * @Date: 2023-10-20 16:02:20
//  * @FilePath: /cooking-menu/src/views/asia/eastAsia/china/mockData/guizhouProvince/name.js
//  * @Description:
//  *
//  * Copyright (c) 2023 by ${git_name_email}, All Rights Reserved.
//  */
// // ### 菜肴

// // ### 小吃

// 花溪牛肉粉、肠旺面、青岩豆腐、卤味、串串香、丝娃娃、洋芋粑、青岩卤猪蹄、青岩鸡辣角、清镇黄粑、青岩玫瑰糖、豆腐圆子、糕粑稀饭、恋爱豆腐果、酸辣烫、叉烧圆子粉、六盘水水城羊肉粉、水城烙锅、岩脚面、郎岱富硒茶、水城凉粉、荷叶糯米鸡、豆汤圆子火锅、兰家牛肉粉、郎岱凉粉、兴义刷把头、兴义羊肉粉、兴义牛肉粉、鸡肉汤圆、舒记杠子面、聂记凉剪粉、贞丰糯米饭、盒子粑、兴义香酥鸭、三合汤、冲冲糕、邱家鸡蛋糕、安顺波波糖、安顺荞凉粉、安顺裹卷、鸡肉饼、黄平牛肉干、一品大包、碗耳糕、
// 阴辣椒、凉拌折耳根、漤菜、酸大肠、汤圆、羊肉粉、王猪脚、竹荪炖鸡、徐家太婆香豆花、恋爱豆腐、夜郎八卦鸡、王傻子烧鸡、炒荞饭、燕麦炒面、纳雍猪米肠、臭豆腐干、燕麦炒面、奢香玉簪、发粑、黄粑、木梳粑、彝家水花酒、石姨妈菜叶豆腐乳、芙蓉蹄筋、罗甸荞灰豆腐、荷叶粑、罗甸花米饭、都匀冲冲糕、油炸鲜鱼、蹄花饭、砂锅豆腐、涮鸡片、遵义羊肉粉、豆花面、豆腐皮火锅、赤水竹笋、空心面条、鸡蛋糕、江口米豆腐、油香粑、社饭、
