/**
 * 贵州-遵义市-特产美食
羊肉粉、豆花面、豆腐皮火锅、赤水竹笋、绥阳空心面条、遵义鸡蛋糕等
鸭溪黄家牛肉、小叶苦丁茶、遵义豆花面、朝天椒、遵义羊肉粉、空心面、凤冈养生油茶、洋芋粑粑、仁怀三把鸡、合马羊肉、南白黄糕粑、刘二妈米皮、正安手工米皮、尚稽豆腐皮、绿豆粉、荞面条、田三蒸饺
乌江豆腐鱼
乌江豆腐鱼是一道色香味俱全的地方名肴，属于黔菜系。此菜香鲜辣烫，色味俱佳。其鱼肉鲜美清香，豆腐雪白滑嫩，久煮不老，食之无渣，入口即化。乌江位于遵义县最南端，高速公路侧有饮食一条街，店堂栉比，家家户户专营活鱼加工，特殊风味的乌江豆腐鱼闻名省内外。已成为乌江旅游业中独具特色的饮食文化品牌。2018年9月，被评为“中国菜”之贵州十大经典名菜。
南白黄糕粑
南白黄糕粑为遵义县南白镇特产，原料普通，制法独特，兼具糕、粑的特点，富有传统风味。其原料为上好的大米，糯米各一半，再加两米总和8%-10%黄豆。将米磨成粉，糯米蒸熟，黄豆磨浆，掺合拌匀，待浆干后搓揉成团，打成长条形块状，外包斑竹笋壳，用绳扎紧，然后上甑猛火蒸2-3小时，让粑熟透。再小火闷24小时左右即可出甑。出甑后水分蒸发收汗，粑表面黄亮油润，不沾手、不稀皮。上等的黄糕粑切口断面呈金黄色，细腻而油润，其中的糯米粒晶莹闪亮，吃进口中糯而不沾，香甜可口，有冷食或蒸、炸、烤、煎等吃法。切片蒸食，吃起来绵、软、香、糯，滋润爽口。
桐梓玉兰片
桐梓玉兰片是以楠竹鲜笋精心加工而成的干笋片。鲜笋是竹的嫩苗，楠竹鲜笋具有体粗壮，质地细嫩的特点，用它加工出来的玉兰片色白味鲜，糖质含量高，碳水化合物的含量丰富， 历来是我国传统年节和喜庆筵席的佳肴。
鸭溪凉粉
鸭溪凉粉是贵州遵义地区最具特色的夏季休闲消暑特色风味小吃，男女老少皆宜，因产自遵义县鸭溪镇而得名，是黔北凉粉的代表。它采用优质豌豆为原料，经过水泡、细磨、滤渣、煮制和冷却之后，切为薄薄的长条状。看上去色泽嫩黄，质地细腻，吃的时候放上特制的油辣椒、酱，蒜水，风味独特。材料简单，做法独特，解乏解饿，美味可口。
甜酸羊肉
甜酸羊肉始于清代，起源于贵州省遵义市遵义县新舟镇禹门一带，已有200多年历史。
遵义羊肉粉
遵义羊肉粉是贵州省遵义市的一道特色小吃，用鲜羊肉熬汤，浇米粉，放羊肉片、调料而食。已有300余年制作历史。贵州各地均产羊肉粉，唯有遵义羊肉粉驰名。遵义市的大街小巷，羊肉粉馆栉比鳞次，食客之多，首屈一指。曾获得第二届“中华名小吃”称号。
凉拌米皮
拌。大米磨成米浆舀入刷过熟油的蒸盘内摊薄，待凉后用刀切成2厘米宽的长条放入盘中，用沸水烫一下，加入半勺凉开水和氽熟的绿豆芽，再将大头菜、盐菜、酥黄豆、葱花放于米皮上，用红油辣椒、酱油、醋、味精、麻油、花椒油、姜蒜水兑成汁浇淋在米皮上即成。
黄糕粑
黄糕粑，是贵州省、四川省（自贡市等地）的一种传统特色小吃，由于食用时的形状酷似糕点，粑片呈金黄色，故得名黄糕粑。黄糕粑是走亲访友、家人团聚、过年过节的必备标志性食品，是用黄粑叶包装成型的，苗寨里做得大，大体呈圆柱形，比一般人的手臂都粗，如同灰碱粑的大小。一般需切成块多人食用或分多次食用，如果您到了贵州农村一定要尝尝那里的黄糕粑。城镇里面主要用于商业用途，所以做得小，采用两张黄粑叶交叉成十字型将粑体包成小块正方形，一只手将它握在手里，一般人都能吃完。
乌江鱼
“乌江鱼”是遵义乌江镇的一个历史悠久、独具特色的饮食品牌，四秀皆宜，闻名遐迩。 “乌江鱼”是用真正的野生鱼（即江中之鲢鱼）精心配料，加以遵义“朝天辣椒”，以火锅方式烹制而成，鲜辣味美，吸引了无数的游客。乌江镇大街上那整片的火锅店、站在路边向过往车辆招徕的女服务员和她们软糯的口音，也成了进入遵义城区必经的一道景观。
尚稽豆腐皮
尚稽豆腐皮是一种汉族传统名吃。产于遵义县尚稽镇，已有100多年的历史，是豆制品家族中独具特殊风味的地方名食。这是一种经发酵制成的豆制品。尚稽豆腐皮外呈棕褐色，质地绵韧，虽臭犹香，风味别具。不作任何加工即可食用，也可切丝凉拌，引还可用水发软或油炸至半泡后炒肉引。可冷食，嚼之绵韧，口舌生津；可拌食，切成丝后与烧熟的青红椒丝凉拌，其味深长，颇能下饭；可炸食，炸泡后色泽乳黄，酥脆爽口，适宜佐酒；可炒食，水发后与肉合烹，香臭相辅，甚为可口。
遵义鸡蛋糕
遵义鸡蛋糕是贵州省遵义市的一道特色小吃，该小吃具有甜，咸两种口味，产自历史名城遵义，当地有很多地方名特产食品，其中小鸡蛋糕算是最有名气的一种，100多年来成为遵义的一大名点。凡到遵义的人都要买上几包带回家吃或馈赠亲友，吃过的人都说：“遵义鸡蛋糕有特色，比起其他鸡蛋糕好吃”。
豆花面
豆花面是贵州省遵义市独创的传统名小吃，清新活泼，美味可口。豆花，有的地方叫水豆腐，是用前一次点豆腐的窖水存放几天后成为酸汤。用这种酸汤点豆腐，使豆腐没有石膏或卤水的苦涩味，比一般豆腐细嫩，比豆腐脑紧扎。
熊猫竹笋筵
赤水不产熊猫，却盛产竹类。赤水家家户户吃竹、用竹，生产、生活与竹息息相关。赤水人居不可无竹、食更不可无竹，人们于是昵称竹食品为“熊猫菜”，昵称赤水竹饮食为“熊猫餐”，赤水人也就顺理成章变为食竹的“熊猫”。 赤水竹食品原材料十分丰富，在市境内绵延数千里生长，植物类有竹荪、冬笋、绵竹笋、水竹笋、箐竹笋等数十个品种
醋羊肉
醋羊肉是遵义东乡禹门地方的传统风味菜。它是用烫皮全羊、麻糖、麸醋和大干辣椒制成的“黄酱”烹制而成，所以又叫“黄酱羊肉”。
酸鲊芋丝
酸鲊芋丝包括酸鲊土豆丝、酸鲊红薯丝、酸鲊芋头丝等，这类原料制作的酸鲊菜以前是配在酸鲊辣椒渣里面。
叶儿粑
叶儿粑，是四川地区特色传统小吃。川西农家清明节、川南春节的传统食品。叶儿粑在不同的地区有不同的叫法和特点。在崇州等地也叫艾馍。在川南自贡、宜宾、泸州以及云贵的昭通、遵义等地则叫做猪儿粑。此外在乐山地区，叶儿粑选用的叶子则有所不同，当地人选用本地特有的大叶仙茅叶子作为粑叶，可以很好的将其裹起来。制作叶儿粑选料考究，工艺精细，具有色绿形美、细软爽口的特点，为四川名小吃之一。用糯米粉面包麻茸甜馅心或鲜肉咸馅心，置旺火蒸。特色是清香滋润，醇甜爽口，荷香味浓，菜分两味，咸鲜味美。
遵义罐罐饭
米饭油亮清香，腊肉烟香浓郁，配菜美味爽口。
赤水罐罐鸡
罐罐鸡起源于清代末年，因用笔筒形瓦罐盛鸡蒸制而得名。罐罐鸡的选料、用料、制作工艺很讲究，风味别具一格，颇受四方宾客的赞扬。成为遵义地区的名菜肴，也是宴请客人席中常用的座汤菜。罐罐鸡可根据招待不同对象，配以不同的原料。一般只需在砍匀的鸡块中，配入水发墨鱼、柏松的姜块、白胡椒、葱节及食盐少许，然后装入罐内，上笼用猛火蒸几小时即可。
遵义豆花面
遵义豆花面是贵州省遵义市的一道特色小吃，属于黔菜系，该菜品柔软滑爽，辣香味浓，风味特殊，其最初由佛教素面，创制于20世纪初；遵义豆花面是很有特色的贵州特色小吃，以面条为主要材料，烹饪的做法以煮菜为主，味道鲜香可口。
遵义黄粑
遵义黄粑又名黄糕粑，是一种贵州非常有名且颇有特色的美食。以遵义县南白镇所产品质为佳。
刘二妈米皮
刘二妈米皮是遵义地区老字号的名小吃，制作原料主要有米皮（卷粉）、大头菜等。
合马羊肉
合马羊肉取料于合马山羊，是黔北颇有名气的特色食品。有着长征文化、盐运文化等历史背景，加之不断发展壮大，也成为仁怀市合马镇地盘上的优势产业和地域品牌。
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const zunyiFoodsList = [
  // 灯影牛肉
  {
    province: '贵州省', // 省
    city: '遵义市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'qianCuisine', // 菜系编码
    cuisineCategoryName: '黔菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '贵州省', // 省
    city: '遵义市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'qianCuisine', // 菜系编码
    cuisineCategoryName: '黔菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
