/**
 * 山东-德州市-特产美食
禹城扒鸡
禹城扒鸡又称称禹城五香脱骨扒鸡，山东禹城特色传统名吃，已有200余年的历史。它以制作独特、肉烂脱骨、色鲜味美、肥而不腻、营养丰富等特点而著称，1919年载入《山东各县乡土调查录》。
德州羊肠汤
德州市的大街小巷到处可见到卖羊肠汤的车摊，酱红色的羊肠往碗里那么一盛，再淋上艳红的辣椒油，撒上翠绿的香菜叶，最后再浇上一勺滚烫的热汤，那诱人的香味便悠悠地飘了过来，叫人馋涎欲滴。
乐陵金丝小枣
乐陵金丝小枣，山东省乐陵市特产，中国国家地理标志产品。乐陵以盛产金丝小枣而闻名天下，素有“百里枣乡”的美称。乐陵金丝小枣品质优异，掰开半干的小枣，可清晰地看到由果胶质和糖组成的缕缕金丝粘连于果肉之间，拉长1—2寸不断，在阳光下闪闪发光，金丝小枣因此而得名。1995年，乐陵被国家林业局命名为“金丝小枣之乡”，2001年又被中国经济林协会命名为“中国名优特金丝小枣特产之乡”。2004年12月13日，原国家质检总局批准对“乐陵金丝小枣”实施原产地域产品保护。
羊肠汤
羊肠汤是文雅一点的称呼，过去就叫羊肠子，沧州方言发音是”样尝――咋”。沧州地处华北平原的东部，回族是这里的一个主要民族，因宗教原因回族并不食用和烹饪羊的肠、血等，所以并无此忌讳的其他民族用此开发出了不少美食，沧州小吃羊肠子便是代表。做法是:先将50斤清水添入锅内，待锅烧响放进鲜羊肉、骨架一副，用大火烧(以木柴火为好)，顶出血沫，尔后将佐料下锅，同时外加大葱、生姜各半斤和适量，再熬40分钟即成底汤。佐料主要有白芷、肉桂、草果、陈皮、杏仁等，要按一比例适量下锅，多了则药味出头，少了则腥膻除不净。食用时，根据顾客对于肥瘦的选择，取不同种类熟羊肠、羊腹腔膜、血肠、羊蛋等在汤锅中煮熟，盛入碗中。顾客根据自己喜好加上孜然、味精、盐、香菜、香辣油等即可配合大饼或烧饼食用。它色泽光亮呈乳白色汤质优美营养丰富，羊肠子入口爽而不腻异香诱人无腥膻的气味。
尚堂扒鸡
尚堂镇位于庆云县南部，尚堂扒鸡为庆云地方特产之一。
大柳面
大柳面是山东德州远近闻名的特色传统名吃，属于鲁菜系，是德州宁津的三大名吃之一，因始于大柳镇而得名，有“金丝缠碗”的美誉。它缘于二百多年前的乾隆年间，最初由大柳镇张家面铺首创，薪火相传到第五代，张连贵不断改进擀面技术，完善制卤工艺，招徒扩店，苦心经营。来宁津的人少有不吃它的。
德州扒鸡
德州扒鸡又称德州五香脱骨扒鸡，是著名的德州三宝（扒鸡、西瓜、金丝枣）之一。德州扒鸡是中国山东传统名吃，鲁菜经典。德州扒鸡制作技艺为国家非物质文化遗产。早在清朝乾隆年间，德州扒鸡就被列为山东贡品送入宫中供帝后及皇族们享用。五十年代，国家副主席宋庆龄从上海返京途中，曾多次在德州停车选购德州扒鸡送给毛泽东主席以示敬意。德州扒鸡因而闻名全国，远销海外，被誉为“天下第一鸡”。
葱烧蹄筋
葱烧蹄筋，具有爽口润滑，芳香绵柔的口感。此菜色泽艳丽红、绿、酱红三色分明、味道鲜香、软嫩适口。
保店驴肉
保店驴肉是一道以驴肉为主要原料的菜品。
宋楼火烧
宋楼火烧为夏津特色传统名吃，系用上等面粉，加适量黄豆面为原料制成。每个折六层，层层刷涂香油，经锅烙火烤而膨为灯笼形，香酥可口，每只重量仅七钱。故又名“灯笼火烧”、“风筝火烧”。开水冲泡滑腻可口，且易于消化。若切成细丝加精肉或鸡蛋焖烩，吃起来柔软松散，别具风味。
傻小二棒仔鸭
傻小二“棒仔鸭”选用樱桃谷瘦肉型鸭为材料，经18种名贵中草药浸泡腌制，果木炭火烘烤，高汤酱制风干而成，其肉色枣红，酱香油润，滋味悠长，低脂不腻。
傻小二扒鸡
德州扒鸡最早起源于禹城，也叫五香脱骨扒鸡，因在最初制作时只添加五味调料而得名。改革开放后特别是近年来，为了进一步开发禹城扒鸡，使这一历史名吃发扬光大，禹城市委、市政府决定实施“种鸡饲养—

*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const dezhouFoodsList = [
  // 灯影牛肉
  {
    province: '山东省', // 省
    city: '德州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shangdongCuisine', // 菜系编码
    cuisineCategoryName: '鲁菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '山东省', // 省
    city: '德州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shangdongCuisine', // 菜系编码
    cuisineCategoryName: '鲁菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
