/**
 * 山东-东营菏泽市-特产美食
 * 
 * 
 * 菏泽风味小吃
单县羊肉汤,水煎包,曹州烧饼,曹县烧牛肉,芝麻糖,郓城壮馍,东明香肚,成武酱大头,单县馓子,面泡子,什集烧羊肉,皮家烧鸡,胡辣汤,谢集罐子汤,黄河鲤鱼,牡丹饼,巨野罐子汤,皮家烧鸡,黄安驴肉,曹县烧饼,糖果饯,耿饼,成武酱大头,左营绿豆丸子,单县羊肉汤,百寿坊羊肉汤,郓城壮馍,

 * 
菏泽风味小吃
单县羊肉汤
水煎包
曹州烧饼
曹县烧牛肉
芝麻糖
郓城壮馍
东明香肚
成武酱大头
单县馓子
面泡子
什集烧羊肉
皮家烧鸡
胡辣汤
谢集罐子汤
黄河鲤鱼
牡丹饼
巨野罐子汤 [82]
皮家烧鸡
皮家烧鸡，是郓城县侯集镇子房墓村皮姓烧鸡专业户的传世产品，不仅在郓城享有盛誉，且远销北京、乌鲁木齐等城市。
黄安驴肉
郓城黄安驴肉，以肉质鲜美、醇香浓郁、油而不腻、风味独特而久负盛名，以致周围各县的驴肉店铺都纷纷挂上了“黄安驴肉”的招牌。
曹县烧饼
曹县烧饼历史悠久，是山东菏泽的老少皆宜的传统名吃之一，曹县烧饼用料考究，烧饼用小麦精粉，经过和、盘、揉、摔等多道工序，包上用香油、盐调和的茴香、花椒等多种佐料而成的油瓤，再经过切花、盘沿、涂上一层糖稀、表面沾上芝麻仁，即贴入炉内烧烤。烤成的烧饼表面黄中透红，用手揭开，底儿、盖儿、芯儿层层分离，香气扑鼻，吃一口保准外酥里嫩，不硬不粘，老少皆宜。
糖果饯
糖果饯是以白砂糖为原料，经模制浇注而成的各种糖质造型。
耿饼
耿饼又称曹州镜面柿，是山东菏泽地方传统名点，产于菏泽，因菏泽古称曹州，而耿庄所产柿饼风味最好而得名，曹州耿饼相传已有上千年的生产历史，早在明代就驰名全国，被列为进献朝廷的贡品，曹州耿饼橙黄透明，肉质细软，霜厚无核，入口成浆，味醇甘甜，营养丰富，且耐存放，久不变质，历来为柿饼中上品，深受人民群众的赞赏，耿饼还有较高的药用价值，有清热、润肺、健脾、涩肠、治痢、止血、降血压等功能，柿霜可治疗喉痛、口疮等病症。菏泽已规划大面积种植柿树，以增加人民需求和出口创汇。
成武酱大头
成武酱大头，山东省成武县特产，中国国家地理标志产品。是由该县特产的芥菜（大头菜）腌制的酱菜，该菜创始于清乾隆年间，历史悠久。其特点是：棕红透明，集香、咸、甜三味于一体，咸甜适度，香味绵长，口感清脆，风味独特，是物美价廉的地方小菜。生产工艺被列入山东省非物质文化遗产名录。获国家地理标志认证。2010年12月29日，原国家质检总局批准对“成武酱大头”实施地理标志产品保护。
左营绿豆丸子
左营绿豆丸子是由牛肉、绿豆、海鲜、芝麻等作为主要食材，辣椒油、五香粉、味精等作为主要调料所做成的一道美食。该道美食是通过反复烹炸的做法制作而成的。
单县羊肉汤
单县羊肉汤，山东省单县特产，中国国家地理标志产品。单县羊肉汤始创于清嘉庆十二年（1807年），经二百多年的发展羊肉汤在制作工艺上不断创新，使羊肉汤得以发扬光大和多方延续。单县羊肉汤呈白色乳状，鲜洁清香，不膻不腻，品种繁多，各具其妙；肥的油泛脂溢，瘦的白中透红，天花汤健脑滋目，口条汤壮身补血，肚丝汤健胃壮体，眼窝汤清火明目，奶渣汤沙酥带甜，滋阴壮体，还有马蜂汤、三孔桥汤、腰花汤等七十二种风味。口感鲜而不膻，香而不腻，不仅是一道爽口的美食，而且还有药膳的功能，具有温中散寒、健脾和胃、滋阴壮阳、助消化、增加人体抗病能力等功效。2015年06月19日，原国家质检总局批准对“单县羊肉汤”实施地理标志产品保护。
百寿坊羊肉汤
百寿坊羊肉汤是山东百寿坊食品有限公司研制的快捷方便名吃食品，风味独特、真空包装、携带方便。产品先后获2004年全国大京九农副产品交易会“优秀展品奖”、公司获“山东省消费者满意单位”、“山东省食品诚信单位”、“山东省肉类食品行业先进单位”等称号。百寿坊商标被评为“山东省著名商标”，销售网络已覆盖21个省、市。
郓城壮馍
郓城壮馍，山东郓城著名的传统小吃，椭圆形，长宽约30X15公分左右，皮分4层，面皮肉馅、馅以鲜牛肉为主，也有素馅的，如鸡蛋、韭菜等，以葱、姜、菜蔬、香油等多种祖传佐料搅拌而成。皮为小麦精粉，

 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const hezeFoodsList = [
  // 灯影牛肉
  {
    province: '山东省', // 省
    city: '东营菏泽市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shangdongCuisine', // 菜系编码
    cuisineCategoryName: '鲁菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '山东省', // 省
    city: '东营菏泽市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shangdongCuisine', // 菜系编码
    cuisineCategoryName: '鲁菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
