/**
 * 山东-济宁市-特产美食
 * 
 * 
* 麦子煎饼,曲阜熏豆腐,甏肉干饭,麻鸭卧雪,挎包火烧,梁山糟鱼,金乡烧羊肉,安山炖鱼,烧罗汉面筋,筒子鱼,微山湖咸鸭蛋,蜜制红三刀,清炖鲑鱼,兖州大烧饼,金乡烧饼,山阳熏鱼,微山湖醉蟹,孔府糕点,泗水火烧,曲阜煎饼,


 * 
 * 
 * 
 * 
 * 
麦子煎饼
麦子煎饼是兖州的主食，是一种薄如纸的煎饼。传统做法是将麦子淘净泡透后，在石磨上磨成沫子，把沫子摊在烧热的鏊子上，通过抿、刮等工序，待煎饼黄而不糊的时候，揭下来，这种薄如纸的煎饼就做成了。
曲阜熏豆腐
曲阜熏豆腐，又称“孔府熏豆腐”。驰名中外，为山东独具风味的特色传统小吃。风味口感独特，凉拌、炒、炖、煮均可，又可下酒作为佐餐。
甏肉干饭
甏肉（bèng ròu）干饭是山东省济宁市的一道传统名小吃，属于鲁菜系；甏是一种盛放食物的器皿。甏肉顾名思义，用甏盛放烹制的肉。
麻鸭卧雪
麻鸭卧雪又名香酥鸭，此菜创始于山东省微山县，也是微山湖地区最负盛名的特色小吃之一。如今已经发展成为和孔府菜 ，筒子鱼，四孔鲤鱼并列齐名的济宁市四大鲁菜之一。
挎包火烧
挎包火烧，山东省传统名吃，以熟猪头肉夹食，其肉香而不腻，吃时外酥内韧，别有一番特色。民国初年，激进的年轻人刚刚脱掉长马褂，以穿中山装看作一种时尚。人们把中山装的四个兜习称挎包，烧饼铺的师傅受其启发，于是仿制衣兜，做出了与烧饼完全不同的面食“挎包烧饼”，因其口感味道特别，流传近百年，发展成为当地人的主要食品之一。
梁山糟鱼
梁山糟鱼，骨肉同食，香而不腥，肥而不腻。
金乡烧羊肉
金乡烧羊肉是以羊肉为主要材料制作而成的一道菜品。
安山炖鱼
安山炖鱼是以鱼为主料制作的菜品。
烧罗汉面筋
烧罗汉面筋是山东济宁地区的传统风味名菜。此菜做法精细，面筋四周，摆放18 个口蘑，恰似十八罗汉静坐，故而得名；1915 年，军阀靳云鹏（济宁邹县人）宴请曹锟，内厨马钦义运用济宁传统做法，献上这道家乡风味菜。菜一登席，雅趣倍增，深得曹锟及其随行人员的赞赏：“济宁食俗不凡，色香俱佳”。此菜亦因之身价倍增，誉声贯耳。
筒子鱼
筒子鱼是山东省微山湖地区最为著名的传统名肴之一，此菜起源于山东微山县。如今已发展成为和孔府菜，麻鸭卧雪，四孔鲤鱼并列齐名的微山四大鲁菜之一。
微山湖咸鸭蛋
微山湖咸鸭蛋是山东省传统名吃，蛋壳呈青色，外观圆润光滑，鲁南一带人又叫它“青皮”。咸鸭蛋在我国历史悠久，深受老百姓喜爱，在市场上也备受青睐。
蜜制红三刀
蜜制红三刀是山东金乡特色传统风味名点，制作历史悠久，起源于19世纪中期。 红三刀以大槽芝麻油、麦芽、小米糖稀、白糖、蜂蜜、芝麻、桂花为原料。先将蒸熟的面粉，按一定比例兑入糖稀合成面块，然后取剂成胚，经油炸、浸浆而成。红三刀呈漫方形，迎面三刀，表分四瓣，面蒙脱皮芝麻，灿若繁星点缀；中间红而透亮，底似薄冰，闪闪发光。食之外酥内松，香味纯正，沙甜可口，食而不腻，广受欢迎。
清炖鲑鱼
山东梁山特色传统名吃。鲑鱼，在梁山又称为季花鱼。梁山清炖鲑鱼肉质细腻白嫩，味道鲜美，是下酒名菜。。源于鲑鱼的肉质很嫩，而且营养价值很高。
兖州大烧饼
兖州大烧饼是山东兖州的传统名吃，兖州大烧饼不像馒头那样单调，它有香、酥、脆、甜、软的特色。
金乡烧饼
金乡烧饼，传统特色小吃，面粉经过特殊处理，再佐以糖稀、香油、芝麻及小茴、大茴、肉桂、陈皮、丁香等调料，经造型、烘烤等工序制成。正面凸起，棕红鲜亮，芝麻灿然，边缘刀纹清晰，背面淡黄平展，夹层油润松软。食之则外酥内润，馨香扑鼻，甜咸适中。
山阳熏鱼
山阳熏鱼，历史悠久，金乡八珍之一，缗食之鲜也。公元前144年，西汉景帝年间，金乡县为山阳国，张当居为山阳侯。当居喜射猎、善垂钓，当时山阳国河洼内盛产撅嘴鲢鱼，侯爷垂钓之时，常命其随处将鱼加以佐料在林中架在火上熏烤，鱼熏毕，金黄鲜亮，外酥内润，熏香四溢，食之满口鱼香，回味无穷。张当居将熏鱼献于天子，汉景帝食之赞不绝口，赐名为“山阳熏鱼”。经过千百年的传承，山阳熏鱼以其独特考究的制作工艺和别具一格的熏香风味享誉齐鲁，成为金乡一大名吃。
微山湖醉蟹
微山湖醉蟹是山东省特色传统名食，此菜芳香无腥，蟹味鲜美。已有200多年的历史。这种醉蟹是用微山湖所产的鲜蟹及多种调料精制而成。渍好的醉蟹，仍栩栩如生，色、形仍如活蟹。揭开蟹盖，蟹肉雪白，蟹黄鲜红，入口酒香浓郁，鲜美异常，风味独特，是严冬宴席上的珍品。
孔府糕点
孔府糕点是山东曲阜的传统名点。也象孔府宴一样，是源远流长、世代相传的一种独具风味糕点。 特别是明、清两代，孔府糕点要比当时北京市面上在售的名点好得多。孔府的糕点讲究现烤现吃、求其色、香、形具佳。
泗水火烧
泗水火烧是山东著名的小吃，含馅似饺子，皮干焦酥脆，皮薄馅多，外酥里绵，鲜香味浓，轻咬一口，油水便滋溢而出。
曲阜煎饼
曲阜煎饼是著名的特色传统面食，山东特产之一。曲阜煎饼将小麦粉、玉面粉等调成糊状放入平锅内摊烙后，放入用花生油、炒花生碎、葱花、食用盐、辣椒末等材料调制而成的馅料后烙成，可以根据不同的材
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const jiningFoodsList = [
  // 灯影牛肉
  {
    province: '山东省', // 省
    city: '济宁市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shangdongCuisine', // 菜系编码
    cuisineCategoryName: '鲁菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '山东省', // 省
    city: '济宁市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'shangdongCuisine', // 菜系编码
    cuisineCategoryName: '鲁菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
