// // ### 菜肴

// // ### 小吃

// 菊花鸡汤,菊花烩鸡丝,
//   糖醋鲤鱼,宫保鸡丁（鲁系）,九转大肠,汤爆双脆,奶汤蒲菜,南肠,玉记扒鸡,济南烤鸭
//   锅贴,灌汤包,盘丝饼,糖稣煎饼,罗汉饼,金钱酥,清蒸蜜三刀,水饺
//   肉末海参,香酥鸡,家常烧牙片鱼,崂山菇炖鸡,原壳鲍鱼,酸辣鱼丸,炸蛎黄,油爆海螺,大虾烧白菜,黄鱼炖豆腐,
//   烤鱿鱼,酱猪蹄,三鲜锅贴,白菜肉包,辣炒蛤蜊,海鲜卤面,排骨米饭,鲅鱼水饺,海菜凉粉,鸡汤馄饨,
//   一品寿桃,翡翠虾环,海米珍珠笋,炸鸡扇,燕窝四大件,烤牌子,菊花虾包,一品豆腐,寿字鸭羹,拔丝金枣,
//   太公望红焖鸡,卤煮鸡杂,鸡丝汤
//   苏造肉,苏造肘子,菊花鸡汤,菊花烩鸡丝
//   一品豆腐,糖醋鲤鱼,葱烧海参,三丝鱼翅,白扒四宝,糖醋黄河鲤鱼,九转大肠,油爆双脆,扒原壳鲍鱼,油焖大虾,醋椒鱼,糟熘鱼片,温炝鳜鱼片,芫爆鱿鱼卷,清汤银耳,木樨肉（木须肉）,胶东四大拌,糖醋里脊,红烧大虾,招远蒸丸,枣庄辣子鸡,清蒸加吉鱼,济南把子肉,葱椒鱼片,糖酱鸡块,油泼豆莛,诗礼银杏,奶汤蒲菜,乌鱼蛋汤,锅烧鸭,香酥鸡,黄鱼豆腐羹,拔丝山药,蜜汁梨球,砂锅散丹,布袋鸡,芙蓉鸡片,氽芙蓉黄管,阳关三叠,雨前虾仁,乌云托月,黄焖鸡,锅塌黄鱼,奶汤鲫鱼,烧二冬,泰山三美汤,汆西施舌 ,赛螃蟹,烩两鸡丝,象眼鸽蛋,云片猴头,油爆鱼芹,油炸全蝎,西瓜鸡

// ,清汤全家福,清汤银耳,清汤燕窝,氽芙蓉黄管,奶汤蒲菜,奶汤八宝布袋鸡,汤爆双脆,

// 当朝一品锅,御笔猴头,御带虾仁 ,带子上朝,怀抱鲤,神仙鸭子,油泼豆莛,
// 临沂八宝豆豉,临沂羹糁,单县羊肉汤,济宁的甏肉,枣庄辣子鸡,
// 清蒸鳜鱼,红烧甲鱼,奶汤鲫鱼,油淋白鲢,
// 胡辣焖鲨鱼和雪饺鱼翅,汤爆螺片和五彩虾托,荷香酿海参和干烧鲳鱼,九转大肠和扒全蟹白菜卷 ,香葱烧海参,葱烧海参,荷叶肉,乌鱼蛋汤,油焖大虾,醋椒鳜鱼,栗子扒白菜,汤爆散丹,酱汁活鱼,酱爆鸡丁,葱烧牛蹄筋,油泼豆莛,干贝扒冬瓜,爆三样,锅塌白菜盒,糟熘鱼片,糟熘鱼片,赛螃蟹,拔丝鸳鸯,拔丝鸳鸯,挂霜花生,蜜汁山药,鲜虾炒白菜,把子肉,炒芙蓉干贝,樱桃肉,干炸丸子,山东蒸丸-招远蒸丸,芙蓉蟹肉,芫爆散丹,芫爆里脊片,鸡丝炒拉皮,辣子鸡丁,炒山东白菜-老厨白菜,芙蓉鸡片,大葱爆猪肝,辣炒拼葱爆羊肉,豆浆炖鲫鱼,酱烧小黄鱼,焦熘里脊,焦熘豆腐丸子,焦熘鱼片,鸡刨豆腐,酥鲫鱼,干烧鲤鱼,炖羊肉,炒合菜（北京版,大翻勺：怀中抱月,海底捞月,仙鹤亮翅三种动作）,平鱼煨饽饽,炸八块,辣子鸡,秋栗枣香鸡,香椿拌大虾,熘鸡腐,烩两鸡丝,
