/**
 * 小吃
 * 特产：
 * 美食：
 * ▪ 徽州豆黄馃	▪ 德式土豆小饼	▪ 伤心凉粉	▪ 开口笑	▪ 好吃的芝心紫薯球
 * ▪ 彭城鱼丸	▪ 侗家辣粑又名吒辣粑	▪ 微波瓜子仁	▪ 微波炉板栗	▪ 微波炉五香花生米
 * ▪ 微波炉牛奶饼干	▪ 微波炉版糖烤板栗	▪ 微波炉烤红薯	▪ 微波烤红薯	▪ 彩色冰皮月饼礼盒
 * ▪ 彩蔬营养色拉卷	▪ 彩色汤圆贺元宵	▪ 传统蛋黄五香咸肉粽子	▪ 传说中的古法炸响铃	▪ 干炸丸子
 * ▪ 干炸杏鲍菇	▪ 干焙洋芋丝	▪ 广式粽子	▪ 干炒牛河	▪ 平遥蜜汁长山药
 * ▪ 广式萝卜糕	▪ 广式芋头糕	▪ 广式豆沙月饼	▪ 广式马蹄糕	▪ 广式腊香萝卜糕
 * ▪ 广式肠粉	▪ 培根金针菇卷	▪ 培根金针菇卷	▪ 年糕	▪ 南瓜黑芝麻汤圆
 * ▪ 潮州棕子	▪ 松露巧克力	▪ 松花蛋皮肠	▪ 湿捞河粉	▪ 抹茶羊羹
 * ▪ 抹茶蜜豆糯米糍	▪ 抹茶椰丝团	▪ 卤蛋	▪ 油塔子	▪ 油炸冰激凌
 * ▪ 油炸汤圆	▪ 油炸春卷	▪ 油炸洋葱圈	▪ 油炸红薯	▪ 油炸红薯条
 * ▪ 油炸腰果	▪ 油炸臭豆腐	▪ 油炸豆腐丸子	▪ 油炸青苔	▪ 油炸花生米
 * ▪ 油炸薯条 ▪ 串串烧	▪ 串串香	▪ 劲爆鸡米花	▪ 印尼椰汁七层糕	▪ 常德肉丝米粉
 * ▪ 原味南瓜饼	▪ 圣女果培根卷	▪ 双味艾糍	▪ 咸味芝士棒	▪ 土司
 * ▪ 兰州小吃灰豆子	▪ 巧克力冰淇淋月饼	▪ 巧克力大理石面包	▪ 七夕巧果	▪ 巧克力汤圆
 * ▪ 川北凉粉	▪ 川南凉糕	▪ 巧克力紫薯饼	▪ 心太软	▪ 三丝春卷
 * ▪ 家常菜凉拌土豆粉	▪ 咖喱土豆泥	▪ 土家掉渣饼	▪ 四川担担面	▪ 宫廷桃酥
 * ▪ 三层桂花椰汁糕	▪ 奥利奥麦芬蛋糕	▪ 宫廷固元膏	▪ 天妇罗	▪ 七夕点心
 * ▪ 八宝粽	▪ 咖啡糯米糕	▪ 咖啡牛奶椰蓉酥	▪ 外婆的家的炒面茶	▪ 东北烤冷面
 * ▪ 客家烧仙草	▪ 咖喱番茄丸子米线	▪ 宝宝烤鱼饼	▪ 可可燕麦饼	▪ 华夫饼
 * ▪ 咖喱鱼丸	▪ 咖喱鱼蛋	▪ 咖啡软起司冰皮	▪ 台湾蚵仔煎	▪ 台湾麻薯
 * ▪ 咸叶贴	▪ 奶油南瓜羹	▪ 奶油土豆羹	▪ 奶油糯米糍	▪ 奶油炸糕
 * ▪ 奶油香蕉	▪ 奶油蘑菇汤	▪ 反沙芋	▪ 宁波肉汤圆	▪ 小小酥
 * ▪ 八宝饭	▪ 姜撞奶	▪ 凯撒大帝	▪ 南宁老友粉	▪ 凉拌凉皮
 * ▪ 南宁老友猪杂面	▪ 姜汁撞奶	▪ 姜汁椰奶马蹄千层糕	▪ 冰淇淋版泡芙	▪ 山楂果酱
 * ▪ 山楂糕	▪ 山楂糖水罐头	▪ 姜汁炖奶	▪ 吉林煎粉	▪ 多汁生煎包
 * ▪ 椒盐烤薯条	▪ 家常 藕饼	▪ 卤杂豆	▪ 咸水角	▪ 口水鸡
 * ▪ 八宝酱鲜拌米线	▪ 凤梨酥	▪ 土司香芋卷	▪ 山楂饭团	▪ 剁椒萝卜
 * ▪ 咖喱鸡肉饭	▪ 大枣银耳红豆薏仁米糊	▪ 凉拌荞麦米粉	▪ 咖哩饺	▪ 树莓酱蛋挞
 * ▪ 冰爽水晶凉粉	▪ 凉皮	▪ 切糕	▪ 姜糖糯米团子	▪ 小米锅巴
 * ▪ 冰糖萝卜	▪ 冰糖雪梨	▪ 冰糖葫芦	▪ 双皮奶	▪ 叉烧包
 * ▪ 小琦子椒盐薯角	▪ 南翔小笼包	▪ 南瓜凉糕	▪ 南瓜汤	▪ 南瓜汤圆
 * ▪ 冰皮月饼	▪ 原生态野菜水煎饺	▪ 地瓜小麻团	▪ 地瓜糯米饼	▪ 南瓜玛芬
 * ▪ 南瓜紫薯糕	▪ 潮汕红桃果	▪ 漏鱼	▪ 抹茶铜锣烧	▪ 油条
 * ▪ 油糍	▪ 油炸乳扇	▪ 油炸糕	▪ 油炸糕	▪ 油煎糖糕
 * ▪ 三色果冻	▪ 沙拉培根土豆饼	▪ 三色重阳糕	▪ 大理石芝麻汤圆
 */
