/**
 * 浙江-杭州市-特产美食
 * 
* 八宝童鸡,西湖醋鱼,杭州卤鸭,粢毛肉圆,萧山萝卜干,千岛湖红烧鱼头,葱包桧儿,叫花童鸡,鱼头浓汤,糟鸡,一品南乳肉,蟹酿橙,火腿蚕豆,红烧卷鸡,港汇笋尖虾皇饺,西湖藕粥,火蒙鞭笋,春笋步鱼,宋嫂鱼羹,栗子炒子鸡,龙井虾仁,钱江肉丝,杭州老鸭煲,杭州虾爆鳝面,

 * 
 * 
 * 
 * 
八宝童鸡
八宝童鸡是一道菜品，八宝童鸡的主料是母鸡，辅料是水淀粉、糯米等，调料为食盐等。制作方法是先将鸡杀白洗净，把所需配料按照指定方法处理，将处理好的调料灌入鸡肚内；随后将鸡投入沸水中烫冷水洗，最后上笼用旺火蒸煮至酥取出即可。
西湖醋鱼
西湖醋鱼（West Lake Fish in Vinegar Gravy），又名“叔嫂传珍”“宋嫂鱼”，前身为“宋嫂鱼羹”，是中国浙江省杭州市传统风味名菜，为浙江菜系。西湖醋鱼主以草鱼等食材用料烹制，色泽红亮，肉质鲜嫩，酸甜清香，口感软嫩，带有蟹味。2018年9月10日，西湖醋鱼被评为浙江省十大经典名菜之一。
杭州卤鸭
杭州卤鸭是浙江省杭州市的一道特色美食，属于浙菜系；该菜品在加工时，应先用清水预煮，一般预煮15~20min，然后再用酱汁或卤汁煮制成熟，某些产品在酱制或卤制后，需再烟熏等工序。
粢毛肉圆
粢毛肉圆是塘栖名菜之一，以鲜肉、糯米为主料制作的比乒乓球略大的肉圆子。与板鸭、汇昌粽、细沙羊尾、米塑合称“塘栖五大名小吃”。
萧山萝卜干
萧山萝卜干，浙江省杭州市萧山区特产，中国国家地理标志产品。萧山萝卜干是江南酱腌技艺的杰出代表。“一刀种”萝卜经过传统技艺脱水加工，历时300天制成。其味清香，口感清脆。正宗的萧山萝卜干是“三晒两腌”，在萝卜切条后，不是放盐腌制，而是直接晾晒，每天翻三次，靠风来脱水。经过3—5天后，把晾晒好的萝卜撒盐并用打磨棒压实，放进坛子里。第一次按每百斤的白条萝卜加盐三斤的比例，拌匀揉透，分批入缸。装缸时，放一层，压一层，逐层压实。经过三天，出缸再次晒二三天。而后再进行第二次腌制，以每百斤加盐一斤半的比例，再拌匀揉透，仍分批入缸，腌制七天左右，即可以出缸。2004年10月25日，原国家质检总局批准对“萧山萝卜干”实施原产地域产品保护。
千岛湖红烧鱼头
千岛湖红烧鱼头是一道著名的传统菜肴。汤呈乳白、肉质鲜嫩。取一容器，将鱼头洗净后放入，加入姜片、葱段、烧酒、盐、鸡精腌制10-20分钟，红柿子椒切成丝备用；坐锅点火倒入适量油，待油温七成热
葱包桧儿
“葱包桧儿”是浙江省杭州市的一道风味传统小吃，望仙桥畔王二炸“油炸桧”出了名，王二有时炸多了，一下子卖不出去，冷了又软又韧，味道不佳，更无人买。他对秦桧夫妇的心头之恨，还愤愤难平，就将冷油炸桧在热锅一烤，把烤熟的油炸桧同葱段卷入拌着甜面酱的春饼里，再用铁板压烤，烤到表皮呈金黄色，油炸桧“吱吱”发叫，王二方才解恨，他拿起来一吃，觉葱香可口，便取名叫“葱包桧儿”，一直流传。其中“儿”为儿化音。
叫花童鸡
叫花童鸡是浙江省杭州市的一种特色传统名菜，属于浙菜系，该菜品也是1956年浙江省认定的36种杭州名菜之一。其采用具有地方特色的越鸡、绍酒、西湖荷叶，加上各种调味品烤制而成。先在鸡腹中填满佐料，然后用荷叶及箬壳包扎，再在外边裹上一层用绍兴酒脚、盐水调和的酒坛泥，放在文火中煨烧三四小时。到顾客食用时，整个泥团拿到餐桌上当着客人的面拆开。由于它是经密封烧烤的，保持了鸡的原汁原味，泥团中的名酒的香醇气味，经火烤后沁入鸡肉，一股清香在桌面上扑鼻而来，更增添了情趣。
鱼头浓汤
鱼头浓汤是浙江省杭州市的一道特色名菜，属于浙菜系，该菜品是非常适合全家老小在冬天吃的菜肴，其味道鲜美，营养丰富。如果把炖好的鱼头汤架在电磁炉上，配上各种蔬菜、豆腐等，就又变成了鱼头火
糟鸡
糟鸡是浙江省的一道特色传统名菜，属于浙菜系；该菜品已流传了近千年，细细嚼来，咸鲜中透出酒意，人微醺，采用浙江萧山大种鸡制作而成，肉质鲜嫩，糟香扑鼻，别具风格，是冬令佳品，食品的一宝。
一品南乳肉
一品南乳肉是一道浙江杭州的特色传统名菜，属于浙菜系杭州菜。此菜色泽鲜艳，肉酥而不腻。选用腐乳卤作主要调味品烹制菜肴，在浙江民间广为流行，风味独特，饶有乡土气息， 1956 年浙江省认定为36 种杭州名菜之一。

蟹酿橙
蟹酿橙是浙江省杭州市的一道特色传统名菜，属于浙菜系；该菜品新颖、鲜美、气味特殊。
火腿蚕豆
火腿蚕豆是浙江省传统的传统名菜，属于浙菜系杭州菜。此菜红绿相间，色泽鲜艳，清香鲜嫩，回味甘甜。俗话说“清明见豆荚，立夏可以吃”。初夏的蚕豆，眉部呈翠绿色，肉质柔嫩，带皮烹食，有一种特殊的芳香。“火腿蚕豆”用火腿中腰峰和初上市的鲜嫩蚕豆偏炒而成，是夏初时令佳肴，1956 年被浙江省认定为36种杭州名菜之一。
红烧卷鸡
红烧卷鸡是一道色香味俱全的名肴，属于浙菜系杭州菜。成菜柔软、鲜嫩、浓香，富有杭州乡土风味。选用泗乡腐皮、天目笋干等杭州地区的特产作原料，此菜是1956 年浙江省认定的36 种杭州名菜之一。
港汇笋尖虾皇饺
港汇笋尖虾皇饺是一道美食。
西湖藕粥
西湖藕粥是以西湖老藕、糯米为主料制作的菜品。
火蒙鞭笋
火蒙鞭笋是一道美食，口味独特，制作简单，营养价值很高，主要材料为笋

春笋步鱼
菜系：浙江特色：，笋脆爽口，色泽黄亮，为杭州传统名菜中初春难得的时菜。
宋嫂鱼羹
宋嫂鱼羹是浙江省杭州市的一道风味传统名菜，属于浙菜系-杭帮菜；该菜品创制于南宋淳熙年间。宋嫂鱼羹通常将鳜鱼或鲈鱼蒸熟后剔去皮骨，加上火腿丝、香菇、竹笋末、鸡汤等佐料烹制而成。该菜品出炉后，色泽油亮，鲜嫩滑润，味似蟹肉。
栗子炒子鸡
栗子炒子鸡是浙江省杭州市的一道特色名菜，属于浙菜系，该菜品选用原料除嫩鸡外，还必须用新鲜嫩栗。
龙井虾仁
龙井虾仁（Souteed Shrimp Mear with Longjing Tea），是中国浙江省杭州市传统风味名菜，为浙江菜系。龙井虾仁将茶饮与虾仁融合，整体清新软嫩，虾仁玉白，鲜嫩，芽叶清香，色泽雅丽，虾中有茶香，茶中有虾鲜，食后清口开胃，回味无穷。2018年9月10日，龙井虾仁被评为浙江省十大经典名菜之一。
钱江肉丝
钱江肉丝是浙江省杭州市的一道特色名菜，属于浙菜系，该菜品青翠红亮，香味扑鼻，味道醇厚。钱江肉丝显然糅进了北方菜肴那种浓重的口味，但仍然保持了杭州菜肴咸鲜入味、刀工精细等特点。
*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const hangzhouFoodsList = [
  // 灯影牛肉
  {
    province: '浙江省', // 省
    city: '杭州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '浙江省', // 省
    city: '杭州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
