/**
 * 浙江-湖州市-特产美食
 * 
 * 
* 诸老大粽子,张一品酱羊肉,玫瑰酥糖,双林子孙糕,藏心鱼圆,野荸荠桔红糕,洗沙羊尾,板羊肉,双林姑嫂饼,百笋宴,长兴爆鳝丝,茶糕,刘家大蹄,周生记馄饨,老法虾仁,丁莲芳千张包子,震远同牛皮糖,烂糊鳝丝,湖州大馄饨,湖州馄饨,


 * 
 * 
 * 
诸老大粽子
诸老大粽子是产自浙江省湖州市的著名传统小吃，是湖州“四大名点”（诸老大粽子、周生记馄饨、丁莲芳千张包子、震远同玫瑰酥糖）之一，湖州“中华老字号”之一，属于端午节节日美食。
张一品酱羊肉
此菜选用嫩湖羊，以炭火焖，用酱油、水糖、红枣、生姜、胡椒等配料精制而成。特点是色泽红亮，汁浓肉嫩，酥而不烂，鲜嫩可口，色、香味兼备，为湖州百年传统名菜。他的羊肉肥而不腻鲜嫩香酥，具有补肾壮阳、暖中祛寒、温补气血、开胃健脾的功效，补益产妇，通乳治带，助元阳，补虚劳形衰、通乱治带、生精血等辅助功效。是浙江的有名小吃，有特色。
玫瑰酥糖
玫瑰酥糖属于浙江省非物质文化遗产的一部分，浙江湖州四大地方传统名点之首。是中华老字号震远同“茶食四珍”中的一珍，玫瑰酥糖是由“屑子、酥心、骨子”制作而成，极富江南传统风味。玫瑰酥糖“香、细、甜、酥”，它的特点是色泽乳白，嵌以粉色玫瑰酥心，香味醇郁，甜而不腻。
双林子孙糕
双林子孙糕为浙江湖州双林镇特色传统糕类名点之—。双林子孙糕用料讲究，制作精细，馅选用核桃肉、金桔饼、青梅、糖猪肉、玫瑰酱与白糖精制而成。子孙糕具有细糯柔韧，香甜可口，还有多味的特点，故有“多味糕”之称。子孙糕是浙江湖州市双林镇的传统名点，已有70多年的历史。其皮薄馅多，香甜油糯，深受食者欢迎。
藏心鱼圆
鱼丸用鳗鱼或淡水鱼剁茸，加甘薯粉（淀粉）搅拌均匀，再包以猪肉或虾等馅，制成丸状食物，是浙江湖州地方特色的传统风味小吃之一。其馅心变化多样，猪肉、虾仁、笋均可，口味随之各异，湖州民间食俗，“藏心鱼圆”为喜庆筵席上必备之菜，可谓无此不成席，此菜鱼圆色白晶莹，质地肥嫩滑润，口味清鲜。
野荸荠桔红糕
野荸荠桔红糕，浙江南浔传统的特色名点。野荸荠原是南浔镇一茶食店的店名，系百年老店。店主姓沈，苏州人，茶食店现做现卖传统特产桔红糕、定胜糕，麻酥糖、糖年糕、百果糕等各式潮式食品。其中以桔红糕和定胜糕最为著名。
洗沙羊尾
洗沙羊尾，浙江湖州传统的特色名点。因形似圆环，肥糯如羊尾，故名。采用上好板油薄片包卷洗沙加干糯米粉成馅心，再挂上蛋糊，油炸呈黄色装盆，撒上绵白糖和玫瑰花碎片，外表色泽淡黄，内里板油溶画被洗沙眼吸收，味道油润甘香，为湖州民间筵席必备莱肴。
板羊肉
板羊肉是浙江湖州传统的特色名菜，双林的板羊肉，做法是加料白烧，样子颇像天津醉白褛的水晶羊羔，可是味道又完全不同。算是镇上最具规模的羊肉店，他家从上代流传下一个不成文的规定，每天只宰二十头湖羊，绝不多杀，每天清晨一早开市，卖到日将近午，大概就盆空釜净，清洁溜溜，后来的顾客只好空手而同。
双林姑嫂饼
双林姑嫂饼是浙江南浔区双林镇的特色传统名点之一。扁圆形，厚薄均匀，表面印模清晰，底面光洁，粉质细腻、油润，呈浅灰色，有麻油香味，酥松爽口，由于体积小面精，一口一块，口即酥溶。选用上等白面粉、黑芝麻、猪板油、砂糖、精盐等精心制作而成。
百笋宴
百笋宴是浙江安吉传统的特色名宴。安吉有中国竹乡的美称，“百笋宴”并非用一百支笋同锅烹制而宴，而是运用现代烹饪手艺，分别以烩、爆、炒、焖、熘、蒸、煮等10余种烹饪方式，或独立成笋、或辅以各种荤素原料配合成菜，有近200多道菜式。如将调料与笋结合的“黄焖鱼翅笋”、用泥巴包起来放在炉子上火烤的“香烤孟宗笋”，以素菜为主的“锅贴笋”。有安吉一品、油焖春笋、鸡汁脆笋、咸肉烧笋、笋饼、竹筒竹鸡、双色笋卷、竹筒饭等多样品种。有热菜，也有冷盘，并调制各类汤羹及以笋为辅料的各种点心，搭配安吉竹叶“酿”成的饮料，形成了风味奇特的“百笋宴”。“百笋宴”因其营养价值被烹调行家誉为“天下第一素食”。精心制作出冷热兼具的100多道笋菜佳肴，现安吉竹笋宴已推出160余款。安吉“百笋宴”已成为吴越美食文化中绽开的一朵奇葩。。
长兴爆鳝丝
长兴爆鳝丝是雉城传统的特色名菜。色、香、味俱佳，远近闻名。主料鳝鱼选料讲究，须用大小一式的鳝鱼丝，鳝鱼划丝浸渗后，用“五油”(素油、荤油、麻油、酱油、糟油)“三辣”(老姜、青椒、胡椒粉)配以火腿丝等，用文火慢爆烹制成，鲜美可口，风味独特。相传，乾隆游江南到长兴，品尝此菜后赞叹不绝，后被列为宫廷名肴。长兴县临太湖，毗天目，全具盛产鳝鱼，品质兼优，且制作鳝鱼的技艺 十分高超。相传，乾隆皇帝巡视江南之际，杭州官府通报各地名厨高手烹菜 献艺。据称“长兴爆鳝丝”夺得魁首，被乾隆赞誉为“江南难得一味”。此菜口感香脆，解乏健脑，是缓解疲劳的上品。
茶糕
茶糕乃是浙江省水乡古镇新市之地方糕类名点，以历史悠久、选料考究、味道鲜美著称，具有松香鲜三大特色，在杭嘉湖水乡平原小有名气。茶糕的外形四四方方，体态丰腴有弹性，看过去呈半透明状，是茶的碧绿色。
刘家大蹄
刘家大蹄是南浔镇风味小吃代表之一。
周生记馄饨
周生记馄饨是浙江省著名的传统面食小吃。与诸老大粽子、丁莲芳千张包子、震远同玫瑰酥糖同为湖州“四大名点”。周生记馄饨煮熟后，白嫩细腻，光润晶莹，遂被誉为“水晶元宝”和“双羽鸟”。其馄饨制作精良，具有“皮薄滑润，馅大饱满，入口汁长，回味久鲜”的特色。
老法虾仁
老法虾仁是浙江湖州传统的特色名菜，当地阡陌纵横，水网密布，盛产鱼虾。湖州人常用活河虾现挤虾仁，生煸成肴，世代沿袭，故名老法虾仁。但这种烹法是将虾仁上浆，旺火宽油滑熟，配以火腿、海参、香菇等高档辅料，使菜色泽艳丽悦目，虾仁质地软嫩，食之汁清不腻，味鲜爽脆。
丁莲芳千张包子
丁莲芳千张包子是浙江湖州传统的名点。清光绪四年（ 1878 ），湖州菜贩丁莲芳以鲜猪肉、千张为原料，裹成长枕形千张包子，配细丝粉，名曰千张包子丝粉头，肩挑叫卖。后听取顾客意见，在肉馅中添进笋衣、开洋，并改为五厘米见方的三角形包子，细丝粉改用以绿豆为原料的粗丝粉，切成 4-5 厘米，使外形、馅料和辅料等方面均有别于家常色彩而独具一格。后又听取顾客意见，不断创新改进，成为湖州名点。此名点以用料讲究、烹调有术、味道鲜美而闻名遐迩。包子所用的千张和丝粉都是特制的，千张薄而韧，包得密不透气，香浓汁鲜；丝粉白而粗，久煮不糊，柔软入味。
震远同牛皮糖
牛皮糖在全国各大食品厂都有生产，但都存在一个问题，夏天的时候牛皮糖会软塌塌的，一到冬天却硬得像块石头，一敲就碎，震远同的牛皮糖一开始也存在这样的问题。牛皮糖发硬是因为糖在制作完成后冷却还原，要解决问题必须防止还原糖的产生。所以震远同在制作饴糖时加入了酸，产生转化糖，牛皮糖发硬问题迎刃而解。正是因为这样的研究精神，使得震远同的牛皮糖，真正成为湖州特产。
烂糊鳝丝
烂糊鳝丝是浙江湖州的特色传统名菜。是以鳝鱼、火腿、鸡胸脯肉、虾仁、柿子椒、蚕豆淀粉、酱油、香油、黄酒、胡椒粉、白砂糖等为原材料制作而成。相传在清乾隆年间，乾隆皇帝下江南路过南浔，品尝之后，发觉味道鲜美，回味无穷，因此把烂糊鳝丝列为宫廷菜肴，这道菜因此成名。2018年9月10日，“中国菜”正式发布，“烂糊鳝丝“被评为浙江十大经典名菜。
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const huzhouFoodsList = [
  // 灯影牛肉
  {
    province: '浙江省', // 省
    city: '湖州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '浙江省', // 省
    city: '湖州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
