/**
 * 浙江-金华市-特产美食
菜卤豆腐
菜卤豆腐又名菜卤滚豆腐，是浙江磐安县传统的名菜，当地山区老百姓的家常菜之一。豆腐的味道嵌入肉中，肉的味道又混入菜卤，汁香汤浓，水卤交融，别具风味。即使是腊肉非常稀少的年月，撮一把菜卤，切几片豆腐，舀一勺米水，置入大锅饭内焖熟，吃起来也是有滋有味，非常下饭。
永康肉麦饼
永康肉麦饼又称永康肉饼，外省称永康食果。是浙江省金华市永康市的一种传统特色小吃。永康农家在丰收喜庆季节向有制作肉麦饼作为佐餐的传统。“永康肉麦饼”厚实而粗糙，虽然相貌不佳。但大家常说：“人不可相貌”，它与平时小吃店常见的面饼还是有区别的，馅更厚实，皮更有韧劲，一咬，就能觉出差别来：永康肉饼内的鲜汁顺口流出，干菜肉香扑鼻而来。永康肉麦饼以制作简便，配料讲究，做工考究，价廉物美，别具风味而闻名。因价廉物美，经济实惠甚得人们所喜爱，凡是到过永康的人，总不免要品尝几个。
肉麦饼
肉麦饼是浙江浦江、永康、武义等地传统的特色名点，属于馅饼类食品。浦江、永康、武义农家在丰收喜庆季节向有制作肉麦饼作为佐餐的传统。相传北宋兵部侍郎胡则就很喜欢吃肉麦饼，回到故里，总要吃上几只。肉麦饼饼体饱满、皮黄带软，加上浦江、永康、武义特有的酸菜和霉干菜肉馅，食之满口香脆。
金华汤包
金华汤包是浙江省金华地区特色传统名点，历史悠久，素有“金华第一点”的美誉，也是中国南方小吃汤包中的佼佼者。金华汤包以猪肉皮汁加老母鸡汁制成的皮冻和鲜肉笋丁作馅，并在笼底垫以青松蒸制，故馅特鲜，汁特多，清香宜人，深得广大食客的喜爱。2004年1月被金华市国内贸易办认定为金华名点，2005年6月被浙江省商业总会认定为浙江名点。
金华酥饼
金华酥饼是浙江省金华市的一种传统小吃，也是闻名遐迩的馈赠亲朋好友传统特产。其馅心用干菜为主料，故又名干菜酥饼。
游埠酥饼
游埠酥饼，刚出炉的游埠酥饼是又酥又脆香喷喷，咬一口真是齿颊留香。如今游埠酥饼不仅飘香本地，而且名声在外，不少游埠人就是靠着出门在外做酥饼赚了钱的
金华火腿
金华火腿，浙江省金华市特产，中国国家地理标志产品。金华火腿色泽鲜艳，红白分明，瘦肉香咸带甜，肥肉香而不腻，美味可口；内含丰富的蛋白质和脂肪，多种维生素和矿物质。2001年，国家质监总局正式批准“金华火腿”为原产地域保护产品（即地理标志保护产品）。
米筛爬
米筛爬是浙江省桐庐、诸暨、浦江等地的一道传统风味小吃。把面和虚后，搓成一指宽面条，然后扯下一小团，用大拇指在米筛上“爬”——摁，卷，再轻轻一拔就成。菜料以芋头，土豆，笋干，咸菜，萝卜干与排骨切碎切片伴煮为多。调料除普通盐外，葱末、蒜糊、姜丝、胡椒、辣油等均可，因时而异，随人喜好，自由调味。“米筛爬”做好后，外形好看，吃起来又韧又烂，口感好，别具风味。
东阳沃面
东阳沃面是以青菜、西火腿为主料的食品。
金华馒头
金华大酵馒头简称金华馒头，是以酒发酵的浙江著名传统美食。大酵俗称大胶、大窖、大教，与古代“胶、窖、教通酵”同，足见由来悠久。其形制呈圆丘状，平底圆顶，底部直径约13厘米，顶高约6厘米，上印有红色图案，以标作坊字号。如用于庆典或馈赠，淋裱以福禄寿喜字样，红艳欲滴，庄重大方，还有做成原只金华火腿形状的大型馒头，供上祭、祝寿、迎亲等专用。
东阳土鸡煲
东阳土鸡煲是一道营养价值很高的特色传统名菜，属于浙江菜。味道鲜美，鸡肉酥而烂，开筷前是整鸡一只，但轻轻触动鸡肉就会“四分五裂”
义乌东河肉饼
义乌东河肉饼是义乌东河当地的一种特色小吃，主要用面粉和肉混合后煎炸而成。
蒸油麻糍
蒸油麻糍是一种食物，制作原料有糯米粉、芝麻、白糖等。
兰溪鸡子馃
鸡子馃也叫鸡蛋饼，是浙江金华地区特色传统名点，金华各地均有摊店制作出售，而以兰溪鸡子馃最为著名。在猪油、瘦肉和葱馅的油煎饼中，灌入一只打碎调味的鸡蛋，熟后各馅结成整体，入口醇香鲜美，深受



*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const jinhuaFoodsList = [
  // 灯影牛肉
  {
    province: '浙江省', // 省
    city: '金华市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '浙江省', // 省
    city: '金华市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
