/**
 * 浙江-宁波市-特产美食
宁波菜以海鲜名闻内外，向以蒸、烤、炖制海鲜见长，别具特色，轻形式，重实味，鲜咸相兼，美味可口，宁波人昵称“下饭”。烹饪制作大都采取了蒸、烩，特别讲究火候、刀功，极注重色、香、味俱全。宁波十大名菜为冰糖甲鱼、剔骨锅烧河鳗、苔菜小方烤、雪菜大黄鱼、腐皮包黄鱼、网油包鹅肝、荷叶粉蒸肉、黄鱼海参羹、彩熘全黄鱼、炒鳝背。尤以冰糖甲鱼、锅烧河鳗为宁波传统名菜之最。
此外，各种饭后点心也别具风味。宁波十大名点：猪油汤团、龙凤金团、水晶油包、豆沙八宝饭、猪油洋酥块、三丝宴面、鲜肉小笼包子、烧卖、鲜肉馄饨、酒酿圆子。其中，尤以宁波猪油汤团为中国闻名小吃。其他美食则有邱隘咸菜、宁波汤圆、溪口千层饼、水果杨梅、象山海鲜、奉化芋艿头、奉化水蜜桃、年糕、尚田草莓、杨梅、三北豆酥糖、河姆渡茭白等。
溪口千层饼
溪口千层饼，浙江省宁波市奉化区溪口镇特产，中国国家地理标志产品。千层饼具有香、脆、酥、食而不厌的特点，颇受人们喜爱。此饼虽仅4—5厘米见方，约2厘米之厚，却内有27层，“千层饼”之名由此而来。千层饼是清人王毛龙从光绪四年（1878年）开始制作的，已有100多年历史。它采用面粉糅合芋艿粉，加入白糖、精盐、素油、芝麻仁、海苔等，擀出薄片，再折叠起来，切为一寸见方的小块，经黄泥制就的专用圆炉烘烤而成。嚼一口，酥松脆爽齿留芳，甜咸口味多样，被评为浙江奉化的三大特产之一。2004年09月14日，原国家质检总局批准对“溪口千层饼”实施原产地域产品保护。
豆沙八宝饭
豆沙八宝饭是浙江省宁波市的一种地方传统名点，属于浙菜系；该菜品由糯米、豆沙、枣泥、果脯、莲心、米仁、桂圆、白糖、猪板油等原料配合制成，其不仅营养丰富，延寿益年，且醇香甜蜜，别有风味，令人回味无穷。
龙凤金团
龙凤金团是浙江东部一带城乡妇孺皆知的传统名点，也是宁波十大名点之一。龙凤金团形圆似月，色黄似金，面印龙凤浮雕，显示吉祥、团圆。旧时候，宁波有许多制作金团的糕团店，但以赵大有制作的龙凤金团最为有名，称“赵大有金团”。
宁式糕点
宁式糕点是浙江宁波一带的特色传统名点，历史悠久，是全国糕点十二大派系之一。
宁波汤圆
宁波汤圆是浙江省宁波市的一种传统小吃，是中国的代表小吃之一，也是春节，元宵节节日食俗，历史十分悠久。据传，汤圆起源于宋朝。当时明州（现浙江宁波市）兴起吃一种新奇食品，即用黑芝麻、猪脂肪油、少许白砂糖做馅，外面用糯米粉搓成球，煮熟后，吃起来香甜可口，饶有风趣。因为这种糯米球煮在锅里又浮又沉，所以它最早叫“浮元子”，后来有的地区把“浮元子”改称元宵。与大多数中国人不同，宁波人在春节早晨都有合家聚坐共进汤圆的传统习俗。
水晶油包
水晶油包，是浙江宁波市的传统名点之一，属于甜包。板油粒晶莹剔透，满口流馅，香甜可口。其制法是油包的皮子需选上白面粉，经过发酵成面团，加适量食用石碱揉搓均匀后摘成剂子。
慈溪杨梅
慈溪杨梅，浙江省慈溪市特产，中国国家地理标志产品。慈溪市横河镇是著名的杨梅之乡，全镇杨梅种植面积2.5万亩，年总产量近万吨，面积和产量均居全国各镇乡之冠。1996年被国家有关部门命名为“中国杨梅之乡”。其杨梅鲜果销往杭州、上海、北京等大中城市，而且远销新加坡、日本、香港等国家和地区。浙江慈溪六成杨梅硒含量丰富。硒是人体必须的微量元素，在人体内的含量在摄入与排泄中保持动态平衡。以抗氧化作用为中心，硒元素对保护细胞膜、防癌抗癌、保护心血管和心肌健康等都有一定作用。2019年11月15日，入选中国农业品牌目录。
羊尾笋干
羊尾笋干为奉化县的传统著名特产，与水蜜桃和芋艿头齐名，为三大土特产名产之一，生产历史已经超过百年，早被列为浙江省“名特优”产品。由当地盛产的雷笋和龙须竹笋经加工而成，因其因其色泽纯白，长15-20厘米，外形很像羊尾，而被称作为羊尾笋干，肉色清白透黄而且鲜美可口，营养丰富的同时，还具有消暑开胃之功效。可用于烤肉，白切放麻油等吃，又脆又嫩，鲜美无比。
凉冻梅糕
凉冻梅糕是三北人避暑消夏的特色名点。一般在梅子成熟、天气较热的时候自制，是一道人人爱吃的冷冻点心。
宁波炒年糕
宁波炒年糕是浙江省宁波市的一种应节传统小吃，属于浙菜系；该菜品是一道以年糕为主料，白菜、 冬笋、 猪肉为辅料的浙菜菜肴；年糕含有蛋白质、脂肪、碳水化合物、烟酸、钙、磷、钾、镁等营养元素，多是以糯米（江米）或糯米粉为原料，添加不同的辅料制成的节令食品。
余姚微雕
余姚微雕是浙江余姚传统雕刻艺术之一，余姚的雕刻艺术可以说是历史悠久、源远流长，从七千年前的河姆渡古文化遗址发掘出来的文物中，就有不少的雕刻艺术品，其最著名的代表作便是河姆渡遗址的标志物——“双鸟舁日”象牙雕件。而微雕工艺，在余姚的历史应该说并不算长，作为余姚微雕工艺唯一的大师李期慈，七十年代开始摸索微雕工艺，他广泛收集微雕名家的工艺介绍资料，刻苦自学微雕技艺，呕心沥血，历经数载的钻研，终于进入微雕工艺领地，真是“无师自通”，于八十年代初就有微雕作品问世。从此，一发而不可收，每每有微雕精品问世，声名远播海内外。
余姚皮蛋
余姚皮蛋，浙江省余姚市特产，中国国家地理标志产品。余姚皮蛋蛋白呈半透明的褐色凝固体，表面有松枝状花纹，蛋壳易剥不粘连，结晶透明，松花点缀，美若玉雕，蛋黄紧缩，呈深绿色凝固状；切开后蛋块色彩斑斓，似菊花绽蕾，又如砂糖裹心，质地醇美，味道绵长，清凉爽口，四时咸宜。2013年06月26日，原国家质检总局批准对“余姚皮蛋”实施地理标志产品保护。
奉化芋艿头
奉化芋艿头，浙江省宁波市奉化区特产，中国国家地理标志产品。据《奉化县志》记载，芋艿头在宋代已有种植，已有700余年历史。明清时期，萧王庙境内前葛一带已广为种植，以后扩大到剡江沿岸的牌亭、罗村、同山岙、石桥等村。1996年，萧王庙被国务院研究发展中心、中国农学会、《中国特产报》联合命名为“中国芋艿头之乡”。奉化芋艿头是奉化，也是宁波的传统名特优无公害农产品，形如球型，外表棕黄，顶端粉红色，单个重1千克以上，个大皮薄，肉粉无筋，糯滑可口，既是蔬菜，又是粮食，“可烘蒸、生烤、热炒、白切、做糊、烧汤、煮冻，若烘蒸，其香扑鼻；若煮汤烧羹，双滑似银耳，糯如汤团。”不但食味佳，而且是一种营养丰富的保健食品。2004年09月14日，原国家质检总局批准对“奉化芋艿头”实施原产地域产品保护。
奉化曲毫茶
奉化曲毫茶，浙江省特产，中国国家地理标志产品。奉化曲毫茶外形肥壮蟠曲、绿润、花香持久、滋味鲜醇、汤色绿明、叶底成朵、嫩绿明亮。
清炖苋菜梗
清炖苋菜梗是以苋菜、汤卤为原料制作的菜品。
红头团
红头团是富有宁波地方特色的传统名名，油糯米粉和大米粉做成,馅子是甜的就是红豆沙,外面包裹一层糯米,点上一点红,其实就是区别萝卜团子的,甜的和咸的要有区别的。被评为象山十大特色小吃之一。
奉化摇蚶
“奉化摇蚶”是浙江传统名菜之一。蚶是软体动物，壳厚 而坚硬，外表淡褐色，状如瓦楞，因而也称“瓦楞子”。内壁 白色，边缘有锯齿。肉味鲜美，壳可作药用。中国沿海所产的 蚶约有十种，其中以奉化摇蚶最为著名。
镶嵌（骨木镶嵌）
镶嵌（骨木镶嵌），浙江省宁波市传统美术，国家级非物质文化遗产之一。中国镶嵌艺术历史久远，风格独特。殷商时代，铜器铸造中即已出现错金嵌玉的装饰纹样。随着工艺水平的不断提高，天然彩石、卵石、贝壳、螺钿、宝石、玉石和人造玻璃料器、陶瓷、木料等都成为了镶嵌的原料。在长期发展过程中，镶嵌艺术积累了许多重要的技术手段，主要包括直接镶嵌法、预制法、反贴反上法、正贴正上法等。除平面镶嵌外，也可以在浮雕上进行镶嵌，这种镶嵌方法可以进一步增强镶嵌对象的立体感。明清以后，浮雕镶嵌的方法广泛运用于各种工艺品的装饰，清代中晚期还出现了在不同“地子”上镶嵌戏曲人物故事的浮雕镶嵌法，嵌瓷、骨木镶嵌即属此类。镶嵌工艺品具有坚固、耐晒、耐潮湿、不易变色的优点，材料的质感及由此而产生的形、色、光效果使镶嵌工艺品平添了艺术魅力，尽显粗犷浑厚、华贵绚烂之美。 2008年6月7日，镶嵌（骨木镶嵌）经中华人民共和国国务院批准列入第二批国家级非物质文化遗产名录，项目编号Ⅶ-91。
余姚榨菜
余姚榨菜，浙江省宁波市余姚市特产，全国农产品地理标志。余姚市位于杭州湾南岸，主要土属为淡涂砂、淡涂泥和咸砂土，良好的灌排设施、疏松肥沃的土壤和生长期冷凉的气候等独特的自然生态环境，能满足榨菜生长对环境条件的要求。余姚榨菜质地脆嫩，略带苦涩味。腌制榨菜：色暗黄，皮微皱，质爽脆，味香浓、微甘鲜。生产的新鲜菜头头形圆整、质地脆嫩、营养丰富。2019年1月17日，中华人民共和国农业农村部正式批准对“余姚榨菜”实施国家农产品地理标志登记保护。2019年11月15日，入选中国农业品牌目录。
长街蛏子
长街蛏子，浙江省宁波市宁海县特产，全国农产品地理标志。宁海县蛏子的养殖历史悠久，并以长街的下洋涂出产的蛏子最为有名。早在宋嘉定年间（1027年前后），宁海学者写《风俗篇》中记载：“近则采螺蚌蛏哈之属，以自赡给或载往他郡为商贾。”长街蛏子，个体大小均匀，无畸形，贝壳完整，表面清洁，壳色呈浅黄色，壳表有黄绿色壳皮，条纹清晰，壳内壁有光泽；对外界刺激反映敏捷，用手触摸，双壳闭合迅速，进排水管及足部收缩快速；肥满度高。2012年08月03日，原中华人民共和国农业部正式批准对“长街蛏子”实施农产品地理标志登记保护。
象山红柑桔
象山红柑桔，浙江省宁波市象山县特产，全国农产品地理标志。早在宋代时，象山县的柑桔已作为贡品进行上贡。象山红柑桔平均单果重200克左右，最大单果重可达350克以上；果呈扁圆形，果型指数（纵径/横径）0.8；皮薄光滑，完全成熟时浓橙红色，外观艳丽诱人。2011年12月15日，原中华人民共和国农业部正式批准对“象山红柑桔”实施农产品地理标志登记保护。
宁式苔生片
宁式苔生片是浙江宁波传统糕点代表品种之一。宁式片糕有几百年生产历史。不少片糕生产季节较强，而苔生片却可长年生产，产品具有香、松、脆和苔菜咸鲜味等特点，深受群众欢迎。
余姚杨梅
余姚杨梅，浙江省余姚市特产，中国国家地理标志产品。在对浙江省余姚市境内新石器时代河姆渡遗址的考古中发现，早在七千年以前，这里就有杨梅原种存在，另据史书记述，人工栽培历史亦有二千余年，自汉代至明代都有对杨梅的记载。2004年06月04日，原国家质检总局批准对“余姚杨梅”实施原产地域产品保护。
上林湖越窑青瓷
上林湖越窑青瓷，中国国家地理标志产品。越窑青瓷产区地处浙东杭州湾南岸，宁、绍地区之上。慈溪市栲栳山麓上林湖一带，为越窑青瓷主要产区。因古代地属越州，故名越窑。
雪菜黄鱼
雪菜黄鱼是一道传统名菜，属于浙江宁波菜，是宁波的传统特色菜。
余姚甲鱼
余姚甲鱼，浙江省宁波市余姚市特产，全国农产品地理标志。余姚市年平均气温16.2摄氏度，日照2061小时，无霜期227天，降水量1361毫米，自然条件优越，水资源丰富，适合余姚甲鱼的繁衍生长。余姚甲鱼的主要特征是体型较薄，背甲色泽光亮，为青色或青黄色居多，背部光滑无明显的竖纹和凹凸，背疣不明显，腹部无明显的伤痕，腿部折褶较多，皮肤粗糙，裙边较宽且富有弹性，自然伸展且光滑，指爪色微黄，完整，长而锋利。2013年12月30日，原中华人民共和国农业部正式批准对“余姚甲鱼”实施农产品地理标志登记保护。
万年青菜干
万年青菜干宁波一带的风味名菜。以其色泽翠绿，与观赏植物万年青相似而得名。
宁波白茶
宁波白茶源于北宋时期，已有九百年历史，深得历代宁波名人关注，是宁波历史上传承有序、影响最大的名茶之一。二零零一年荣获第三届国际茶博会国际名茶金奖。二零零二年荣获第四届国际茶博会国际名茶金奖。
慈溪蜜梨
慈溪蜜梨，浙江省宁波市慈溪市特产，全国农产品地理标志。梨是慈溪重要的传统水果，在慈溪已有悠久的种植历史，550多年前已有相关种植的记载。慈溪属于北亚热带季风型气候，海洋性气候特征比较明显，全年四季分明，温和湿润，雨水充足，适宜种植梨树。慈溪蜜梨果实外观端正，单果重250克以上，成熟时具有该品种的固有色泽和特性，肉质细或中，汁多，脆甜可口，风味佳。2018年2月12日，原中华人民共和国农业部正式批准对“慈溪蜜梨”实施农产品地理标志登记保护。
慈城年糕
慈城年糕是浙江地区著名传统小吃。它已有数百年生产历史，以选料讲究，精工制作著称，它用优质晚粳米洗净后，用水浸泡3—4天或一周，用水磨成粉，压去水分至不干不湿之恰到好处，粉碎后置蒸笼中猛火蒸透，或舂或轧成大小均匀的条状年糕。
余姚咸蛋
余姚咸蛋，浙江省余姚市特产，中国国家地理标志产品。余姚历来素有养鸭制蛋的传统；隋唐时期，民间就有制作皮蛋及咸蛋的详细记载；余姚各乡镇均具有发展“带圈白翼梢”系的“绍兴麻鸭”养殖业的良好的自然环境。余姚咸蛋的蛋白“鲜、细、嫩”，蛋黄“红、沙、油”。将咸蛋煮熟剖开，蛋白如凝脂白玉，蛋黄似红橘流丹，赏心悦目，别具风味。2013年06月26日，原国家质检总局批准对“余姚咸蛋”实施地理标志产品保护。
苔菜月饼
苔菜月饼又称宁式苔菜月饼，是浙江宁波地区的传统特色月饼，以苔菜为辅料作馅的一种月饼，饼皮松酥，馅料有浓郁的麻油香味，甜中带咸，咸里透鲜，有苔菜的特殊香味。
苔菜油占子
苔菜油占子是浙江宁波地区有名的传统名菜。长3厘米左右，表面呈绿色，四根细小的油条子绕缠在一起，小巧玲珑。由于制作时掺进了苔菜粉和少量食盐，口味咸里透鲜，香酥可口。
宁波金柑
宁波金柑，浙江省宁波市北仑区特产，中国国家地理标志产品。金柑为芸香科柑橘族金柑属的植物，具有很高的食用价值和药用价值。宁波金柑栽培历史较长，元代有“金柑出慈溪，饱霜者甘”的记载，是金柑属中最重要的栽培种类。2006年10月25日，原国家质检总局批准对“宁波金柑”实施地理标志产品保护。
三北藕丝糖
三北藕丝糖是产自浙江慈溪的传统名点。相传，清代雍正年间，慈溪沈师桥有位叫沈永年的糕点师傅，做得一手好糕点，并不断创新，制作出了一种外形为柱状，粗细如同人的中指、长不过三寸似的糕点又似糖点的食品。折断来看，在这细细的的柱状里，意整整齐齐排列着数十个细状小孔，活似被折断的藕，后人就把这种食品称之为藕丝糖，因地处三北，所以也叫三北藕丝糖。
浙麦冬
浙麦冬是百合科沿阶草属草本植物的根。浙麦冬呈纺锤形,似枣核。表面黄白色或淡黄色,有纵纹。质柔软断面黄白色,半透明。具木质芯。气微香，肉质具油性糖质。喝之发粘。《余姚六仓志》载麦冬，来自川,近盛产塘沙地，医家言胜于川产，故称姚冬。浙麦冬分布在中国慈溪市西部和北部平原以及余姚市东部和北部平原地区。浙麦冬喜湿润而较耐干旱，喜冬暖夏凉而有较强耐寒力；土壤由浅海沉积物发育而成，为淡涂泥土属夜阴地或半夜阴地。质地为沙质壤土，通气性好,水、肥、气协调，保水保肥力强，是浙麦冬最佳适生环境。浙麦冬繁殖方式为根分株繁殖。浙麦冬具有养阴生津，润肺清心的功效。用于肺燥干咳，虚捞咳嗽，津伤口渴，心烦失眠，内热消渴，肠燥便秘，明白喉功效。
凫溪香鱼
凫溪，是宁波宁海县五大溪流之一，发源于大里，马岙的山涧小溪，自西向东，注入象山港，古代称野鸭为“凫”可见这条溪当年野鸭之多，宁波著名特产——香鱼。
宁波岱衢族大黄鱼
宁波岱衢族大黄鱼，浙江省宁波市特产，全国农产品地理标志。宁波地域位于中纬度地带，属亚热带季风气候区。南部有向中亚热带过度的痕迹；东部具有海洋性气候性特征。风向随季节交替明显，多异常天气。夏冬季长，春秋季短，四季分明。冬无严冬，夏无酷暑，温暖润湿，光照、热量、雨水资源丰富，适宜养殖大黄鱼。宁波岱衢族岱衢族大黄鱼具有体型细长、头型浑圆、吻短而细巧、体色金黄、线条优美等特征；体被圆鳞，体背面及上侧面黄褐色，侧面及下侧面金黄色，背鳍及尾鳍均灰黄色，胸鳍和腹鳍黄色。2013年4月15日，原中华人民共和国农业部正式批准对“宁波岱衢族大黄鱼”实施农产品地理标志登记保护。
朱金木雕
朱金木雕又称漆金木雕，是浙江省宁波市的汉族传统工艺品“三金”（金银彩绣、泥金彩漆、朱金木雕）之一。以樟木、椴木、银杏木等优质木材作原料，由浮雕、透雕、圆雕等形成。运用了贴金饰彩，结合砂金、碾金、碾银、沥粉、描金、开金、撒云母、铺绿、铺蓝等多种工艺手段，并涂以中国大漆而成。木雕构图饱满，造型古朴典雅，雕刻精美，内容多是喜庆吉事、民间传说等，具有宁波独特的地方风格。唐代高僧鉴真和他的弟子在日本建造的招提寺，就采用了很多朱金木雕做装饰，其中讲经殿、舍利殿等的朱金镂雕风格与现存的宁波阿育王寺装饰雕刻十分接近。
望海茶
望海茶产于浙江宁海县望海岗茶场。品质特征：外形细嫩挺秀，翠绿显毫。内质清香持久，滋味鲜爽回甘，汤色嫩绿明亮，叶底嫩绿成朵。产于国家级生态示范区——浙江宁波宁海县境内。外形细嫩挺秀、翠绿显亮，香气清香持久，汤色清澈明亮，滋味鲜爽回甘，叶底芽叶成朵、嫩绿明亮，尤其以干茶色泽翠绿、汤色清绿、叶底嫩绿的“三绿”特色而独树一帜。2019年11月15日，入选中国农业品牌目录。
奉化水蜜桃
奉化水蜜桃，浙江省宁波市奉化区特产，中国国家地理标志产品。据史料记载，奉化栽桃已有2000多年历史，水蜜桃已经成为奉化区的传统名果，也是中国四大传统名优桃之一。1980年农业出版社出版的《落叶果林分类学》一书，称奉化水蜜桃是“我国水蜜桃中最有名的品种”；国内外桃子专家也一致评价“奉化水蜜桃品质为全国之最，堪称中国第一桃”。自1996年奉化区被国务院发展研究中心等部门联合命名为“中国水蜜桃之乡”以来，奉化水蜜桃产业得到了持续、快速的发展，成为奉化农民增收的支柱产业。2002年8月29日，原国家质检总局批准对“奉化水蜜桃”实施原产地域产品保护。2010年3月25日，中华人民共和国农业部批准对“奉化水蜜桃”实施农产品地理标志登记保护。
臭冬瓜
臭冬瓜是浙江宁波的地方传统风味名菜。它风味独特，奇香味美，健脾开胃，老少咸宜。所谓臭冬瓜，其实只不过是用冬瓜切块，煮熟后凉透，再撒上细盐、麻油等作料。吃法无甚奇特，但有爱吃辣的，撒辣椒粉极解馋。热天时吃，大有解暑、通气、开胃的功效。
宁式百果糕
百果糕属宁式初夏季节的时令糕点之一，采用糯为粉、白糖粉及多种果仁制成，味香甜滋润。
龙山黄泥螺
龙山黄泥螺是浙江宁波传统名菜，头长、体黄、脂厚、味道特别鲜美。泥螺，俗称“吐铁”、“涂贴”，生活于浅海泥滩上，全身沾满泥土。泥螺含有丰富的蛋白质、钙、磷、铁及多种维生素，是一种味道鲜美、营养价值高的大众海产品。
豆酥糖
豆酥糖是浙江宁式传统小吃，茶食。创始于清代，一直是宁波“三北”的名点，故又称三北豆酥糖。特点是香、甜、松，进口酥而易化，具有浓郁的黄豆香味，酥松，易溶化，无糖渣，不粘牙，有黄豆香味。
松仁糕
松仁糕是浙江宁式传统特色糕点名吃，因馅内配有松子仁而得名。软润，有松子香味。
慈溪葡萄
慈溪葡萄，浙江省宁波市慈溪市特产，全国农产品地理标志。慈溪是浙江省重要的葡萄产区，栽培历史悠久，据慈溪县志记载，早在明嘉靖年间就有栽培，已有400多年历史。慈溪葡萄果肉软硬适中，汁多味甜，有香气，风味较浓。2010年12月15日，中华人民共和国农业部批准对“慈溪葡萄”实施农产品地理标志登记保护。
泥金彩漆
泥金彩漆（称为宁波特艺漆器）是中国一种濒临失传的特色传统工艺品种，它的历史可追溯到7000多年前的河姆渡文化。泥金彩漆是一种泥金工艺和彩漆工艺相结合为主要特征的漆器工艺。泥金彩漆主要是在木制还件上，将打成薄片的金银箔碾成粉状，调入漆料后或涂或描或填，并采用蚌壳片、镜片、砂会、沥粉等工艺技法精心装饰；也有以竹片；竹编为胎的。2006年6月，国务院批准文化部确定并公布第一批国家级非物质文化遗产名录
奉化芋头
奉化芋头是浙江奉化传统名吃，食材有芋头、海参、香菇、火腿、鸡肉、胡萝卜切丁等。个头如西瓜，味道甘美。
明府鲞
明府鲞一种墨鱼的干制品。舟山属于宁波，而宁波当时称为明州，因此得名明府鲞。
鄞州雪菜
鄞州雪菜，浙江省宁波市鄞州区特产，全国农产品地理标志。鄞州出产雪菜制品历史悠久。在过去的一千多年里，腌制雪菜都是鄞州地区百姓世代相传的手艺，自古以来就有“纵然金菜琅蔬好、不及吾乡雪里蕻”的说法。其中，鄞州邱隘出产的雪菜因其色泽黄亮、食之生津开胃，深受人们的喜爱。2010年11月15日，中华人民共和国农业部批准对“鄞州雪菜”实施农产品地理标志登记保护。
樟村浙贝
樟村浙贝，产自浙江省宁波市鄞州区章水镇。
宁波金银彩绣
宁波金银彩绣，浙江省宁波市鄞州区民间传统美术，国家级非物质文化遗产之一。金银彩绣又称“金银绣”，是在丝绸品上以金银丝线与其他各色丝线绣成的带有不同图案的绣品，既可应日常生活之需，又可做戏服和美术欣赏品，多用于官府、民间喜庆、服饰、宗教、室内陈设等方面。 宁波金银彩绣主要分布于宁波市鄞州区及其周边地区，主要技法以“盘金（银）”和“填金（银）”为主，充分调动材料的特性与工艺特性，增强图形的质感与空间感；大面积金银色的使用，使得任何颜色在同一画面上和谐共处，表现出富丽堂皇又不失典雅的艺术效果；追求金线、银线与彩线的有机结合，构成粗中有细、点面结合、板而不结、针法巧施的特色。2011年5月23日，宁波金银彩绣经中华人民共和国国务院批准列入第三批国家级非物质文化遗产名录，遗产编号为Ⅶ-104。2018年5月15日，宁波金银彩绣入选第一批国家传统工艺振兴目录。
宁波粽子
宁波粽子是浙江宁波传统节日食俗，一般在端午节制作食用，为四角形，有碱水粽、赤豆粽、红枣粽等品种。其代表品种碱水粽，是在糯米中加入适量的碱水，用老黄箬叶裹扎。
余姚茭白
余姚茭白是余姚当地的特色农产品，好吃，价格便宜。深受人民的喜爱。
宁式鳝糊
宁式鳝糊是浙江省宁波市的一种传统名菜，属于浙菜，其主要以鳝鱼为主要材料；宁式鳝糊的做法非常简单，只要按照菜谱步骤一步一步您来一定会享受到一道美味菜肴。
奉化芋艿头
奉化芋艿头，浙江省宁波市奉化区特产，中国国家地理标志产品。据《奉化县志》记载，芋艿头在宋代已有种植，已有700余年历史。明清时期，萧王庙境内前葛一带已广为种植，以后扩大到剡江沿岸的牌亭、罗村、同山岙、石桥等村。1996年，萧王庙被国务院研究发展中心、中国农学会、《中国特产报》联合命名为“中国芋艿头之乡”。奉化芋艿头是奉化，也是宁波的传统名特优无公害农产品，形如球型，外表棕黄，顶端粉红色，单个重1千克以上，个大皮薄，肉粉无筋，糯滑可口，既是蔬菜，又是粮食，“可烘蒸、生烤、热炒、白切、做糊、烧汤、煮冻，若烘蒸，其香扑鼻；若煮汤烧羹，双滑似银耳，糯如汤团。”不但食味佳，而且是一种营养丰富的保健食品。2004年09月14日，原国家质检总局批准对“奉化芋艿头”实施原产地域产品保护。
宁波汤圆
宁波汤圆是浙江省宁波市的一种传统小吃，是中国的代表小吃之一，也是春节，元宵节节日食俗，历史十分悠久。据传，汤圆起源于宋朝。当时明州（现浙江宁波市）兴起吃一种新奇食品，即用黑芝麻、猪脂肪油、少许白砂糖做馅，外面用糯米粉搓成球，煮熟后，吃起来香甜可口，饶有风趣。因为这种糯米球煮在锅里又浮又沉，所以它最早叫“浮元子”，后来有的地区把“浮元子”改称元宵。与大多数中国人不同，宁波人在春节早晨都有合家聚坐共进汤圆的传统习俗。
红膏炝蟹
红膏炝蟹是一道以梭子蟹、黄酒作为主要食材，以黄油、蒜粒、洋葱粒、糖、盐、胡椒粉、卡夫的奶酪粉、法香小朵、白葡萄酒作为辅料制作而成的家常菜，具有色彩艳红、鲜咸滑嫩的特色。红膏炝蟹是最具代表性的宁波菜之一。
酒酿圆子
酒酿圆子，是中国江南地区传统小吃。糯米粉搓的小圆子与酒酿同煮而成。酒酿味浓甜润，圆子软糯，汤品甜香。酒酿圆子属于甜点，主要原料是糯米、酒酿等，为温补强壮食品，具有补中益气、健脾养胃、止虚汗之功效。
溪口千层饼
溪口千层饼，浙江省宁波市奉化区溪口镇特产，中国国家地理标志产品。千层饼具有香、脆、酥、食而不厌的特点，颇受人们喜爱。此饼虽仅4—5厘米见方，约2厘米之厚，却内有27层，“千层饼”之名由此而


*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const ningboFoodsList = [
  // 灯影牛肉
  {
    province: '浙江省', // 省
    city: '宁波市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
  // 尖椒肥肠
  {
    province: '浙江省', // 省
    city: '宁波市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
  },
];
