/**
 * 浙江-宁波市-特产美食
 * 
 * 
 * 冰糖甲鱼、剔骨锅烧河鳗、苔菜小方烤、雪菜大黄鱼、腐皮包黄鱼、网油包鹅肝、荷叶粉蒸肉、黄鱼海参羹、彩熘全黄鱼、炒鳝背
猪油汤团、龙凤金团、水晶油包、豆沙八宝饭、猪油洋酥块、三丝宴面、鲜肉小笼包子、烧卖、鲜肉馄饨、酒酿圆子
邱隘咸菜、宁波汤圆、溪口千层饼、水果杨梅、象山海鲜、奉化芋艿头、奉化水蜜桃、年糕、尚田草莓、杨梅、三北豆酥糖、河姆渡茭白
溪口千层饼
豆沙八宝饭
龙凤金团
宁式糕点
宁波汤圆
水晶油包
凉冻梅糕
宁波炒年糕
清炖苋菜梗
红头团
奉化摇蚶
宁式苔生片
雪菜黄鱼
万年青菜干
慈城年糕
苔菜月饼
苔菜油占子
三北藕丝糖
凫溪香鱼
臭冬瓜
宁式百果糕
龙山黄泥螺
豆酥糖
松仁糕
奉化芋头
宁式鳝糊
宁波汤圆
红膏炝蟹
酒酿圆子
溪口千层饼

 * 
 * 
 * 
 * 
宁波菜以海鲜名闻内外，向以蒸、烤、炖制海鲜见长，别具特色，轻形式，重实味，鲜咸相兼，美味可口，宁波人昵称“下饭”。烹饪制作大都采取了蒸、烩，特别讲究火候、刀功，极注重色、香、味俱全。宁波十大名菜为冰糖甲鱼、剔骨锅烧河鳗、苔菜小方烤、雪菜大黄鱼、腐皮包黄鱼、网油包鹅肝、荷叶粉蒸肉、黄鱼海参羹、彩熘全黄鱼、炒鳝背。尤以冰糖甲鱼、锅烧河鳗为宁波传统名菜之最。
此外，各种饭后点心也别具风味。宁波十大名点：猪油汤团、龙凤金团、水晶油包、豆沙八宝饭、猪油洋酥块、三丝宴面、鲜肉小笼包子、烧卖、鲜肉馄饨、酒酿圆子。其中，尤以宁波猪油汤团为中国闻名小吃。其他美食则有邱隘咸菜、宁波汤圆、溪口千层饼、水果杨梅、象山海鲜、奉化芋艿头、奉化水蜜桃、年糕、尚田草莓、杨梅、三北豆酥糖、河姆渡茭白等。
溪口千层饼
溪口千层饼，浙江省宁波市奉化区溪口镇特产，中国国家地理标志产品。千层饼具有香、脆、酥、食而不厌的特点，颇受人们喜爱。此饼虽仅4—5厘米见方，约2厘米之厚，却内有27层，“千层饼”之名由此而来。千层饼是清人王毛龙从光绪四年（1878年）开始制作的，已有100多年历史。它采用面粉糅合芋艿粉，加入白糖、精盐、素油、芝麻仁、海苔等，擀出薄片，再折叠起来，切为一寸见方的小块，经黄泥制就的专用圆炉烘烤而成。嚼一口，酥松脆爽齿留芳，甜咸口味多样，被评为浙江奉化的三大特产之一。2004年09月14日，原国家质检总局批准对“溪口千层饼”实施原产地域产品保护。
豆沙八宝饭
豆沙八宝饭是浙江省宁波市的一种地方传统名点，属于浙菜系；该菜品由糯米、豆沙、枣泥、果脯、莲心、米仁、桂圆、白糖、猪板油等原料配合制成，其不仅营养丰富，延寿益年，且醇香甜蜜，别有风味，令人回味无穷。
龙凤金团
龙凤金团是浙江东部一带城乡妇孺皆知的传统名点，也是宁波十大名点之一。龙凤金团形圆似月，色黄似金，面印龙凤浮雕，显示吉祥、团圆。旧时候，宁波有许多制作金团的糕团店，但以赵大有制作的龙凤金团最为有名，称“赵大有金团”。
宁式糕点
宁式糕点是浙江宁波一带的特色传统名点，历史悠久，是全国糕点十二大派系之一。
宁波汤圆
宁波汤圆是浙江省宁波市的一种传统小吃，是中国的代表小吃之一，也是春节，元宵节节日食俗，历史十分悠久。据传，汤圆起源于宋朝。当时明州（现浙江宁波市）兴起吃一种新奇食品，即用黑芝麻、猪脂肪油、少许白砂糖做馅，外面用糯米粉搓成球，煮熟后，吃起来香甜可口，饶有风趣。因为这种糯米球煮在锅里又浮又沉，所以它最早叫“浮元子”，后来有的地区把“浮元子”改称元宵。与大多数中国人不同，宁波人在春节早晨都有合家聚坐共进汤圆的传统习俗。
水晶油包
水晶油包，是浙江宁波市的传统名点之一，属于甜包。板油粒晶莹剔透，满口流馅，香甜可口。其制法是油包的皮子需选上白面粉，经过发酵成面团，加适量食用石碱揉搓均匀后摘成剂子。
凉冻梅糕
凉冻梅糕是三北人避暑消夏的特色名点。一般在梅子成熟、天气较热的时候自制，是一道人人爱吃的冷冻点心。
宁波炒年糕
宁波炒年糕是浙江省宁波市的一种应节传统小吃，属于浙菜系；该菜品是一道以年糕为主料，白菜、 冬笋、 猪肉为辅料的浙菜菜肴；年糕含有蛋白质、脂肪、碳水化合物、烟酸、钙、磷、钾、镁等营养元素，多是以糯米（江米）或糯米粉为原料，添加不同的辅料制成的节令食品。
清炖苋菜梗
清炖苋菜梗是以苋菜、汤卤为原料制作的菜品。
红头团
红头团是富有宁波地方特色的传统名名，油糯米粉和大米粉做成,馅子是甜的就是红豆沙,外面包裹一层糯米,点上一点红,其实就是区别萝卜团子的,甜的和咸的要有区别的。被评为象山十大特色小吃之一。
奉化摇蚶
“奉化摇蚶”是浙江传统名菜之一。蚶是软体动物，壳厚 而坚硬，外表淡褐色，状如瓦楞，因而也称“瓦楞子”。内壁 白色，边缘有锯齿。肉味鲜美，壳可作药用。中国沿海所产的 蚶约有十种，其中以奉化摇蚶最为著名。
宁式苔生片
宁式苔生片是浙江宁波传统糕点代表品种之一。宁式片糕有几百年生产历史。不少片糕生产季节较强，而苔生片却可长年生产，产品具有香、松、脆和苔菜咸鲜味等特点，深受群众欢迎。
雪菜黄鱼
雪菜黄鱼是一道传统名菜，属于浙江宁波菜，是宁波的传统特色菜。
万年青菜干
万年青菜干宁波一带的风味名菜。以其色泽翠绿，与观赏植物万年青相似而得名。
慈城年糕
慈城年糕是浙江地区著名传统小吃。它已有数百年生产历史，以选料讲究，精工制作著称，它用优质晚粳米洗净后，用水浸泡3—4天或一周，用水磨成粉，压去水分至不干不湿之恰到好处，粉碎后置蒸笼中猛火蒸透，或舂或轧成大小均匀的条状年糕。
苔菜月饼
苔菜月饼又称宁式苔菜月饼，是浙江宁波地区的传统特色月饼，以苔菜为辅料作馅的一种月饼，饼皮松酥，馅料有浓郁的麻油香味，甜中带咸，咸里透鲜，有苔菜的特殊香味。
苔菜油占子
苔菜油占子是浙江宁波地区有名的传统名菜。长3厘米左右，表面呈绿色，四根细小的油条子绕缠在一起，小巧玲珑。由于制作时掺进了苔菜粉和少量食盐，口味咸里透鲜，香酥可口。
三北藕丝糖
三北藕丝糖是产自浙江慈溪的传统名点。相传，清代雍正年间，慈溪沈师桥有位叫沈永年的糕点师傅，做得一手好糕点，并不断创新，制作出了一种外形为柱状，粗细如同人的中指、长不过三寸似的糕点又似糖点的食品。折断来看，在这细细的的柱状里，意整整齐齐排列着数十个细状小孔，活似被折断的藕，后人就把这种食品称之为藕丝糖，因地处三北，所以也叫三北藕丝糖。
凫溪香鱼
凫溪，是宁波宁海县五大溪流之一，发源于大里，马岙的山涧小溪，自西向东，注入象山港，古代称野鸭为“凫”可见这条溪当年野鸭之多，宁波著名特产——香鱼。
臭冬瓜
臭冬瓜是浙江宁波的地方传统风味名菜。它风味独特，奇香味美，健脾开胃，老少咸宜。所谓臭冬瓜，其实只不过是用冬瓜切块，煮熟后凉透，再撒上细盐、麻油等作料。吃法无甚奇特，但有爱吃辣的，撒辣椒粉极解馋。热天时吃，大有解暑、通气、开胃的功效。
宁式百果糕
百果糕属宁式初夏季节的时令糕点之一，采用糯为粉、白糖粉及多种果仁制成，味香甜滋润。
龙山黄泥螺
龙山黄泥螺是浙江宁波传统名菜，头长、体黄、脂厚、味道特别鲜美。泥螺，俗称“吐铁”、“涂贴”，生活于浅海泥滩上，全身沾满泥土。泥螺含有丰富的蛋白质、钙、磷、铁及多种维生素，是一种味道鲜美、营养价值高的大众海产品。
豆酥糖
豆酥糖是浙江宁式传统小吃，茶食。创始于清代，一直是宁波“三北”的名点，故又称三北豆酥糖。特点是香、甜、松，进口酥而易化，具有浓郁的黄豆香味，酥松，易溶化，无糖渣，不粘牙，有黄豆香味。
松仁糕
松仁糕是浙江宁式传统特色糕点名吃，因馅内配有松子仁而得名。软润，有松子香味。
奉化芋头
奉化芋头是浙江奉化传统名吃，食材有芋头、海参、香菇、火腿、鸡肉、胡萝卜切丁等。个头如西瓜，味道甘美。
宁式鳝糊
宁式鳝糊是浙江省宁波市的一种传统名菜，属于浙菜，其主要以鳝鱼为主要材料；宁式鳝糊的做法非常简单，只要按照菜谱步骤一步一步您来一定会享受到一道美味菜肴。
宁波汤圆
宁波汤圆是浙江省宁波市的一种传统小吃，是中国的代表小吃之一，也是春节，元宵节节日食俗，历史十分悠久。据传，汤圆起源于宋朝。当时明州（现浙江宁波市）兴起吃一种新奇食品，即用黑芝麻、猪脂肪油、少许白砂糖做馅，外面用糯米粉搓成球，煮熟后，吃起来香甜可口，饶有风趣。因为这种糯米球煮在锅里又浮又沉，所以它最早叫“浮元子”，后来有的地区把“浮元子”改称元宵。与大多数中国人不同，宁波人在春节早晨都有合家聚坐共进汤圆的传统习俗。
红膏炝蟹
红膏炝蟹是一道以梭子蟹、黄酒作为主要食材，以黄油、蒜粒、洋葱粒、糖、盐、胡椒粉、卡夫的奶酪粉、法香小朵、白葡萄酒作为辅料制作而成的家常菜，具有色彩艳红、鲜咸滑嫩的特色。红膏炝蟹是最具代表性的宁波菜之一。
酒酿圆子
酒酿圆子，是中国江南地区传统小吃。糯米粉搓的小圆子与酒酿同煮而成。酒酿味浓甜润，圆子软糯，汤品甜香。酒酿圆子属于甜点，主要原料是糯米、酒酿等，为温补强壮食品，具有补中益气、健脾养胃、止虚汗之功效。
溪口千层饼
溪口千层饼，浙江省宁波市奉化区溪口镇特产，中国国家地理标志产品。千层饼具有香、脆、酥、食而不厌的特点，颇受人们喜爱。此饼虽仅4—5厘米见方，约2厘米之厚，却内有27层，“千层饼”之名由此而


*/

import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const ningboFoodsList = [
  // 灯影牛肉
  {
    province: '浙江省', // 省
    city: '宁波市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '浙江省', // 省
    city: '宁波市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
