/**
 * 浙江-绍兴市-特产美食
 * 
 ** 糟青鱼干,油爆大虾,绍式虾球,柯桥豆腐干,白斩鸡,米海茶,新昌春饼,清汤越鸡,头肚醋鱼,喉口馒头,干菜焖肉,芝麻千张丝,豆腐馒头,绍兴醉鸡,绍兴臭豆腐,绍兴腐乳,火腿炖老鸭,西施团圆饼,清蒸鳜鱼,绍兴香糕,茴香豆,白鲞扣鸡,鉴湖鱼味,孟大茂香糕,鲞冻肉,梅干菜烧肉,绍式八珍糕,绍式大夹沙,


 * 
 * 
 * 
糟青鱼干
糟青鱼干是浙江省传统的地方名菜，青鱼肉质肥美，富含蛋白质，经过冬腌春糟，夏天供应，肉色白里透红，糟香扑鼻，味鲜香甜，贮存方便，为下酒佳肴。此菜是1956年浙江省认定的36种杭州名菜之一。按照绍兴习俗，每年冬季，喜购鱼购制晒干，制成鱼干，可馈赠亲友作礼品，或自己享用，历史上曾被列为贡品。
油爆大虾
油爆大虾是浙江省传统名菜。取绍兴内河大虾，用旺火略爆而成。具有虾肉鲜嫩，略带甜酸，虾壳红艳，食时松脆的特色，是下酒的佳肴。这道菜口味特点 虾肉鲜嫩，酸甜鲜美，咸鲜适口。营养价值：减少血液中胆固醇含量，防止动脉硬化；虾的通乳作用较强，并且富含磷、钙、对小儿、孕妇尤有补益功效。
绍式虾球
绍式虾球又名蓑衣虾球，是浙江绍兴的地方传统名菜，属于浙菜系。此菜色泽金黄油润，质地香松酥脆，配以葱白段与甜面酱蘸食，味道颇佳。此菜已有100多年的历史。据史料记载此菜原名虾肉打蛋，是绍兴丁家弄福禄桥堍，一爿专营绍兴正宗菜点的雅堂酒店的看家菜肴。因其风味独特而久销不衰，后经厨师进一步的研究改制发展而成现今的绍式虾球。
柯桥豆腐干
柯桥豆腐干是浙江绍兴传统的地方名吃之一，以其历史悠久、制作精细、风味独特而驰名省内外。柯桥豆腐干原名“五香茶干”。辅料特多，做工考究。它选用优质黄豆为主要原料，配以大茴、小茴、桂皮、丁香、山萘、黄酒、甜面酱、冰糖等十几种辅料精制而成。
白斩鸡
白斩鸡又叫白切鸡、三黄油鸡，是一道中华民族特色菜肴，起源于广东，是一道经典的粤菜，在南方菜系中普遍存在，如广府菜、上海菜、客家菜中都有、始于清代的民间酒店，因烹鸡时不加调味白煮而成，食用时随吃随斩，故称“白斩鸡”。白斩鸡形状美观，皮黄肉白，肥嫩鲜美，滋味异常鲜美，十分可口，肉色洁白皮带黄油，具有葱油香味，葱段打花镶边，食时佐以姜蓉、蒜泥、酱油，保持了鸡肉的鲜美、原汁原味，食之别有风味。2018年9月，被评为“中国菜”之上海十大经典名菜，小绍兴白斩鸡、振鼎鸡白斩鸡、泰煌鸡白斩鸡在上海都是家喻户晓的品牌佳肴。
米海茶
米海茶是浙江新昌、嵊州一带的传统特色小吃，做法简单，种类多种多样，茶味香甜，解饥渴，老少皆宜。米海茶用糯米来制作。先把糯米涨饱，然后蒸至半熟，去机器上碾扁，拿出去晒，最后就是在锅上炒胖。要吃的时候，放入杯中或碗里，加些糖，用开水冲泡，即成所谓的米海茶。米海茶味香甜，解饥渴。当地人常用来招待客人。
新昌春饼
新昌春饼是浙江新昌县有名的传统风味小吃。新昌春饼形如圆月，薄如纸张。白中透黄，略带微咸，酥脆香美，再买一根油条或一块油氽豆腐，卷起来就可以吃，既松又香，别具风味。
清汤越鸡
清汤越鸡是浙江绍兴的特色传统风味名菜，据说是春秋时期越国流传下来的。它用绍兴的特产越鸡烹制而成。此鸡肉白嫩，骨质松脆。利用原汁清炖，味鲜爽口。
头肚醋鱼
头肚醋鱼是浙江绍兴传统的地方名肴，属于浙江菜。菜品色泽红亮，头肚肉质活络，汤汁浓滑，配用甜面酱、米醋烹制，味鲜而略带酸甜。延缓衰老调理 ，益智补脑调理。
喉口馒头
喉口馒头，又称候口馒首，是浙江绍兴地区特色传统名点，它始创于百余年前的太平天国时期，当时创始人王阿德携带一家老小避难绍兴，在望江楼关帝庙附近路亭内经营喉口馒头，携带方便很受吃客欢迎。在清末民初已在绍兴盛兴起来。 用半发面作皮子，肉馅内拌有香葱，蒸熟后皮薄松软，馅心鲜香，大小适口，现做现吃，故名候口馒头。
干菜焖肉
干菜焖肉是一道由猪肋条肉、梅干菜、白砂糖、酱油、 黄酒和红曲等食材制成的传统名菜，有滋阴调理的功效。2018年9月10日，“中国菜”正式发布，“干菜焖肉“被评为浙江十大经典名菜。
芝麻千张丝
芝麻千张丝是以千张、芝麻为主要材料制作而成的一款菜品，调料是辣椒油、花椒粉、料酒等，通过翻炒的方式做成。
豆腐馒头
豆腐馒头是嵊州地区最著名的传统风味小吃，不可不尝。说是馒头，其实只比小笼略大些，皮却是汤包般厚薄。透明的皮子里是嫩白的碎豆腐和肉冻做成的馅子，若是考究些还会加上虾脑。
绍兴醉鸡
醉鸡是浙江省绍兴市的一道传统名菜，属于浙菜系，该菜品由绍兴独有的越鸡和花雕酒浸泡而成，食之可谓鲜嫩滑美、酒香怡人，是绍兴人宴客时必不可少的一道当家菜
绍兴臭豆腐
绍兴臭豆腐，是有着丰富文化底蕴的浙江绍兴汉族民间休闲小吃，属于浙菜系。臭豆腐其名不美，外陋内秀，平中见奇，风味迷人。经选料、配卤、浸泡、发酵、晾干、油炸精细制作而成，色泽黄亮，外脆里松，香气浓郁。 臭豆腐好吃，究其原因还是那一坛好卤，卤的制作方法极其复杂，不仅仅是用新鲜蔬菜腌制让其自然发酵，而是在其腌制和发酵过程中不断加入各种香料精心调制，没有几年的时间不敢称老卤或好卤，只能称为清卤，一坛好的卤水常常有二十以上的年头。
绍兴腐乳
绍兴腐乳是浙江地区传统名菜，当地人叫“霉豆腐”，又有“素扎肉”的雅称。绍兴腐乳是价廉物美的佐餐佳品，红方的汁烧肉，肉味香冽，是绍兴传统的家乡名菜；醉方的汁，绍兴人多用来蒸豆腐，放上点小葱，呈白底、黄液、青盖面的特殊色汁，其味别有风味，令人食欲陡增。 绍兴腐乳虽不及绍兴老酒的举世闻名，但去绍兴旅游的中外游客，也喜欢买上几瓶，带回去以馈赠亲友。
火腿炖老鸭
火腿炖老鸭是绍兴的一道地方传统名菜，风味独特。 此菜味道鲜美，营养丰富。火腿还具有益肾、补脾、开胃、充精髓、补气血等功效。
西施团圆饼
西施团圆饼是以小麦面粉、萝卜、鲜猪肉等为主要原料，手工包制而成的一种扁圆饼子，属于浙江诸暨传统的地方名点。
清蒸鳜鱼
清蒸鳜鱼，是浙江省地方传统名菜。鳜鱼，刺少，肉质细嫩肥美，是绍兴的名特产之一，历史上曾作贡品。清诗有:“时值秋今级鱼肥，肩挑网箱入京级”之句。此菜选用鉴湖产的鳜鱼清蒸，以著名的绍酒调味,色泽淡雅悦目，味似蟹肉，食后富有清新之感，南宋大诗人陆游在田园诗中赞它“别饶风味胜一筹”。
绍兴香糕
绍兴香糕是浙江省绍兴地区的特色传统糕点。用精白粳米磨成米粉，配上适量的中药丁香、砂仁、白芷、豆蔻、大茴和研成粉末的食用香料，再拌以纯白沙糖，和粉成型后，放到白炭火上烘焙，这样焙制的香糕黄而不焦，硬而不坚，上口松脆香甜，并有解郁、和中、开胃、健脾之功能。绍兴香糕品种多样，以精制桂花香糕最佳。绍兴香糕已有200多年的历史，以前做为贡品进贡朝廷，如今是绍兴的特产之一。味道香甜，造型美观，深受消费者的喜爱。
茴香豆
茴香豆是浙江绍兴著名的传统小吃，属于民间闲食，亦是城乡酒店四季常备之下酒物。民谣云：“好吃茴香豆，嚼嚼韧纠纠，要用谦豫、同兴好酱油。”
白鲞扣鸡
白鲞扣鸡是浙江绍兴民间的地方传统佳肴，鲜美而咸香，肉质软滑，风味独特。白鲞是用大黄鱼加工制成的咸干品，味鲜美、肉结实，为名贵海产品，中医认为其味甘、性平，可开胃、消食、健脾、补虚。越鸡为绍兴历史贡品、名特产，鲜嫩肥美，中医认为其味甘、性温，可温中益气、补精添髓，白鲞与越鸡配伍，同蒸成肴，可谓锦上添花，其味更胜一筹，两物均具滋补之功，加之新鲜，咸鲜互补，两味渗合，鸡有鲞香，鲞有鸡鲜，咸鲜入味，香醇清口，富有回味，不愧为肴中之珍品，绍兴“咸鲜合一”风味的典型代表。
鉴湖鱼味
鉴湖鱼味是浙江绍兴传统的地方名菜，是草鱼的一种做法。 绍兴名厨运用鉴湖草鱼，创制了形状似花，咸酸甜辣，松香可口，香气馥郁的鱼味菜。鉴湖，湖水清澈，碧波荡漾。湖中水生植物丰富，为鱼群生长提供了良好条件，特别是草鱼，生长繁茂，体壮肥美。
孟大茂香糕
孟大茂香糕，是浙江地区传统特色糕点。以“孟大茂”店号名，在绍兴城内水澄巷，创建于清嘉庆十二年（1807）。以“葫芦”为记。
鲞冻肉
鲞冻肉是浙江绍兴的地方传统名菜，民间除夕“分岁”时必备此菜。鲞冻肉由文火细煮而成，鲞肉配伍，咸鲜合一，鲜香酥糯，红亮晶莹，油而不腻，别有风味。
梅干菜烧肉
梅干菜烧肉是一道以精肉、梅干菜作为主要食材，以低粉、糖、泡打粉、酵母、猪油、牛奶、水作为辅料制作而成的美食，口味甜香。
 */
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const shaoxingFoodsList = [
  // 灯影牛肉
  {
    province: '浙江省', // 省
    city: '绍兴市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '浙江省', // 省
    city: '绍兴市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
