/**
 * 浙江-温州市-特产美食
 * 
炒粉干,灯盏糕,猪油糕,双炊糕,长人馄饨,矮人松糕,楠溪江麦饼,鱼丸,牛杂,清明饼,蒜子鱼皮,油淋土鸡,爆墨鱼花,温州鸭舌,瑞安盘菜,县前汤团,三片敲虾,楠溪麦饼,寺前馄饨,温州松糖,炒双粉,胶冻,白象香糕,绿豆腐,五味香糕,陡门头灯盏糕,温州豆沙汤团,炸溜黄鱼,双味猷蛑,红烧梭子蟹,瓯菜,双色芙蓉蛋,马蹄松,蒜泥凤爪,什锦组碟,麻巧,白蛇烧饼,黄金卷,温州酱鸭舌

 * 
 * 
 * 
 * 
炒粉干
在温州，炒粉干算是最常见的小吃，街头小吃、排挡、餐馆或是酒店都可以看到炒粉干的身影。
灯盏糕
温州小吃灯盏糕。据说，清光绪年间温州有姓陈的兄弟二人，在市区东门陡门头路亭制卖一种形似灯盏的点心，形似灯盏，独具风味，一时名声大振，便被称为“灯盏糕”。
猪油糕
猪油糕是把一个糯米团，摊成薄薄的，放在猪油里煎到外皮稍脆时就可以吃了，吃时撒上些白糖，然后用粽子叶包着，猪油糕简单而古朴。
双炊糕
双炊糕是瑞安的特产，双炊糕的特点是：细、软、韧、香、甜其中一道工序，需要将糯米与铁砂一起炒制，这样做成的双炊糕才更香，之所以叫“白糖双炊糕”，是因为需要用糯米粉加白糖，经过两番炊制而成。
长人馄饨
1930年前后，乐清人陈立标经营馄饨，注重质量，馄饨皮薄，用碱得当，馅心新鲜，盖料讲究，有紫菜、蛋丝、肉松、酒浸虾米等。所煮馄饨，汤清见底，形似花朵，美味爽口。因陈立标个子很高，人称长人馄饨。
矮人松糕
矮人松糕为温州有名的特产，因创制人谷进芳矮小而得名。此糕选用纯糯米，过水磨成细粉，拌以腌渍了几天的猪臀肥肉丁，并配以上等桂花和白糖拌匀，炊熟成板，切成方块即可。
楠溪江麦饼
楠溪江麦饼的做法是把面粉和好，里面放入梅菜，肥猪肉，包好，擀成薄薄的，放进炉中烤就可以了。和面、做陷、包的时候皮的厚薄和烤的时间和火候都是十分讲究的，正是这一步步的精工细作才会有松脆弱、喷香的美味麦饼。
鱼丸
其并不是一个丸子，而是珊瑚一般的，或者说像树杈更合适。以其风味佳，有特色，同县前汤圆店麻心汤圆一起被认定为“中华名闲食”。
牛杂
牛杂是苍南县江南片区主要龙港一带的小吃，历史比较悠久，主要挑选牛屁股最有韧性肉切成丁放入锅中加入十几味香料包慢慢煮一天以上，以酱色为主，越煮越有嚼劲久煮不烂，乘热加醋、辣椒粉，配上葱，是温州地区为数不多以酸辣为主的小吃。
清明饼
温州民间，农村现仍保留农历一年到头都讲“吃”的习惯。如二月二，吃芥菜饭；三月，吃清明饼儿；清明节前，乡村户户磨糯米粉、采清明草做饼。清明草俗称绵菜，清明季节，会萌生出绵绵白毛细叶。采摘叶顶，洗净捣烂和之糯米粉，馅以猪肉丁、笋丝、蒸熟而食。吃芥菜饭和清明饼都有清热解毒之效。
蒜子鱼皮
蒜子鱼皮是浙江省地方传统名菜，属浙菜系。选用绵糯的厚鱼皮，和粒大而完整的大蒜头烹制而成，是温州民众推崇的酒席大菜之一。
油淋土鸡
油淋土鸡是一道色香味俱全的传统名菜，属于浙菜系温州菜。把鸡剁块，将八角、花椒、甘草加入调味料（1）烧开，作成卤汁，鸡和卤汁放入锅中，小火烧约1小时，使其入味后取出。卤好的鸡块放入热油中，炸至外皮微黄后捞出。葱切丁，用2大匙油爆香，放入拌匀的调味料（2）和鸡块同炒即成。
爆墨鱼花
爆墨鱼花是浙江温州地区传统名菜，温州人以墨鱼作原料，能制作很多菜肴，以爆墨鱼花最有特色。墨鱼肉锲花刀，烧熟后片片墨鱼卷曲成麦穗状，造型美观。没有深厚的功底，难以发挥特色，是一种刀工、火候并重的名肴。色泽洁白，脆嫩爽口，鲜香味美。
温州鸭舌
鸭舌是浙江省温州市的一种特色小吃，属于浙菜，鸭舌是卤的，风至半干，在口中细嚼，韧性十足，颇为耐嚼。温州人称鸭舌为“鸭赚”，而不称鸭舌。在温州话中舌发音和亏钱发音相近，但是温州生意人多，觉得“舌”的发音不吉利，所以把鸭舌改称为“鸭赚”。
瑞安盘菜
盘菜属十字花科芸苔属芜菁种的一个类型，系二年生草本植物。因其肉质根形扁贺如盘而得名。主要熟食法为红烧、生炒、汤煮年糕为主。盘菜药用价值甚高。
县前汤团
县前汤团是浙江温州地区传统名吃，原名郑德大汤团，始于清光绪二十七年（1901），相传，久盛不衰。温州人视吃汤团为吉祥，历来有汤团待客的风俗习惯。1998年，县前汤圆店的麻心汤圆被认定为“中华名小吃”。制作原料是上等糯米等。
三片敲虾
三片敲虾是浙江温州地区传统名菜，上海人称敲敲虾。选用鲜大河虾为主料，熟火腿、熟鸡脯肉、水发香菇、绿蔬菜为辅料，加鸡汤、绍酒、精盐、味精、干淀粉、熟猪油等调味品。此菜用大河虾敲制而成，形状如扇，红、白、黑三色鲜明，汤清味鲜，滑嫩爽口。
灯盏糕
灯盏糕是浙江省温州市和福建省闽西地区的一种传统特色名点，也是温州十大名小吃之一，同时该小吃也是福建闽西连城，长汀，闽北浦城等地的地方特色客家美食小吃。其历史悠久，最远可追溯至元末明初。一般是用大米、黄豆磨成稠浆，加入面粉，包裹萝卜丝，猪肉等为馅料，油炸而成。
楠溪麦饼
楠溪麦饼市浙江传统小吃，原出永嘉沙头。沙头历来是舴艋停靠旅客歇脚候潮的埠头。此地麦饼别有风味。往来旅人常备为干粮。一个麦饼的原配料是：半斤麦粉，一个鸡蛋，一汤匙菜油，搅拌揉透，成凹字形，嵌入咸菜、鲜肉、炊虾、味精。包拢后，用木槌捶成扁圆形，入在平底铁煎盘中两面白，再转到烤炉中焙硬。食之松脆弱，喷香，堪称美食。
寺前馄饨
寺前馄饨是浙江地区传统小吃，创始于清道光年间。采用上白面粉制成的馄饨皮薄如蝉翼；馅心 用当天宰杀的猪后腿瘦肉剁成。店主人能自己定下严格规矩，一锅汤只煮一碗馄饨，生意再好也不破例。佐料有鸡蛋丝、丝菜、碎肉和葱花等。
温州松糖
温州松糖是浙江温州地区传统小吃，选用优质糯米浸透琼干炊熟。加相当于糯米重量1/13的去皮白芋头，在石臼中乘热捣匀，做成条状，晒干，刨切片状，入锅油炸，拌以糖浆即成。
炒双粉
炒双粉是浙江温州传统的地方小吃、双粉二字，即番薯粉和细粉丝。高楼炒双粉的做法颇为讲究，双粉下锅前，要先在温水中浸泡，且要分先后，番薯粉先放，粉丝稍后，浸泡过的双粉炒出来后，较一般的炒粉更具韧性。热好猪油，双粉下锅，文火翻炒十余分钟，期间要将笋干、肉丝、豆芽放进去，即可上桌。番薯粉有弹性，细粉丝相辅相成，很有口感。
胶冻
胶冻是浙江温州传统的地方小吃。多以黄鱼胶或鮸鱼胶为原料，加水煮化成薄浆状后，自然冷却而成“胶冻”。切成小块或小条状，加酱油、米醋、麻油、味精搅拌后即可食用。外形晶莹剔透，口感清凉，可以醒酒。
白象香糕
香糕是浙江乐清县白象镇公久南北货商号所创，为传统特色糕类美食之一，白象香糕创始人北白象白塔王人王宏昌，其子王星宣为公久商号经理，迄今已有80多年历史。
绿豆腐
绿豆腐是浙江南部地区温州泰顺一带常见的传统小吃。在温州地区俗称“豆腐柴”。制作原材料是一种野生灌木，这种灌木在浙南闽北一带的山野里虽不能说是满山遍布，但也算是常见之物，当地人称之为豆腐柴。有清热解毒功能，是盛夏防暑降温的佳料，是纯真的自然绿色食品，是提取果胶的好资源。
五味香糕
五味香糕又称五色香糕，为浙江温州地方传统名点，创于60年代后期。以糯米粉和精白糖为主料，经糕盘加工成型后蒸炊而成。一包五条，其色各异。红色配以桂花香精，黄色配以香蕉香精，白色以五香（五香、八角、小茴、桔皮、花椒）为馅，黑色裹经黑芝麻粉，各具风味，老幼咸宜。
陡门头灯盏糕
陡门头灯盏糕是浙江温州地区传统糕类名点，
温州豆沙汤团
豆沙汤团是浙江温州地区传统小吃，主要食材有豆沙，糯米。
炸溜黄鱼
炸溜黄鱼是浙江温州地区特色传统名菜，选用宰净的黄鱼，先用油炸，然后热鱼浇热芡制成的，声色俱佳，松脆鲜嫩，酸甜可口。
双味猷蛑
双味猷蛑是浙江温州地区传统名菜，将肥膘煮熟后切成圆形的片，大概厚约0.5厘米左右，然后放入，虾料，再在外层放入鱼茸，用手摸光滑之后放入2成热的油锅中养熟之后捞起，摆在盘子里。然后把蝤蠓蒸熟后用到进行暗刀处理，也同样的摆放再盘子里，就行了，加上姜末醋的小堞调料就可以了。
红烧梭子蟹
红烧梭子蟹是浙江温州传统名菜，红烧梭子蟹就无虞“杀生”之嫌，虽名为“梭子”，其肉却丰美，其味之鲜，不在血蚶之下。梭子蟹因头胸甲呈梭子形，故名。红烧梭子蟹蟹肉肥味美，有较高的营养价值和经济价值。温州人嗜海鲜，有一种血蚶，是生着吃的，其味鲜美，但食者唇齿间避免不了血色斑斑，望上去不免有些恐怖。
双炊糕
双炊糕是浙江瑞安传统糕点，由李瑞庆创制于清代光绪年间，距今已有100多年的历史。
瓯菜
瓯菜是中国八大菜系浙菜的四个流派之一，温州菜系的代称。因温州古名东瓯，建国后，为了提高温州菜的知名度，经过餐饮专家共同研究，将温州菜改称“瓯菜”。

双色芙蓉蛋
双色芙蓉蛋是一道鲜寇名菜，属于温州菜。以鸡蛋为主料，配以蘑菇、青豆、木耳、炒匀。利用蛋白和蛋黄两种天然色彩，精心制成黄、白两色“芙蓉”蛋片。再以豌豆、木耳配色。
矮人松糕
矮人松糕是以纯糯米粉制作的食品，为浙江省温州的传统名吃，又是瓯菜名点，因创制人谷进芳矮小而得名。松糕既松又软，甜中有咸，清香可口，不粘牙，很是爽口。
马蹄松
马蹄松是浙江省温州市的一道特色小吃，属于浙菜系，该菜品最早产于清雍正年间乐清白象地区，以形状类似于马蹄而得名；该菜品以面粉和红糖作皮，馅入糖心和咸肉丁红瓜丝，熟芝麻粉和桂花，吃起来香酥可口。
蒜泥凤爪
蒜泥凤爪是一道传统的地方名菜，属于温州菜。含丰富胶质，有韧劲。蒜泥凤爪将鸡脚爪煮熟拆骨后，重用蒜泥，佐以辣椒油、芝麻油、曲香酒等多种调料拌制，微辣开胃，香脆爽口，为佐酒佳肴。
什锦组碟
什锦组碟是一道常见的佳肴，制作原料有五香鸭脯、椒油鸡脯、三色蒸蛋、素火腿等。
麻巧
麻巧，原名巧食，是传统小吃，温州特产，源自农历七月初七民间妇女向织女星“乞巧”的风俗。麻巧采用优质面粉、蔗糖、猪油、食盐、苏打等原辅料，经调制成舌形，撒以芝麻，烘烤而成。温州市面包食品厂生产的麻巧，1983年获取浙江省商业传统最佳产品奖。

五味香糕
五味香糕又称五色香糕，为浙江温州地方传统名点，创于60年代后期。以糯米粉和精白糖为主料，经糕盘加工成型后蒸炊而成。一包五条，其色各异。红色配以桂花香精，黄色配以香蕉香精，白色以五香（五香、八角、小茴、桔皮、花椒）为馅，黑色裹经黑芝麻粉，各具风味，老幼咸宜。
温州松糖
温州松糖是浙江温州地区传统小吃，选用优质糯米浸透琼干炊熟。加相当于糯米重量1/13的去皮白芋头，在石臼中乘热捣匀，做成条状，晒干，刨切片状，入锅油炸，拌以糖浆即成。
瑞安盘菜
盘菜属十字花科芸苔属芜菁种的一个类型，系二年生草本植物。因其肉质根形扁贺如盘而得名。主要熟食法为红烧、生炒、汤煮年糕为主。盘菜药用价值甚高。
白蛇烧饼
白蛇烧饼是以食碱烫酵面，精面粉为主要食材制作的小吃。
陡门头灯盏糕
陡门头灯盏糕是浙江温州地区传统糕类名点，
黄金卷
黄金卷，温州洞头县传统的地方小吃。由鳗鱼炮胶、竹荪、墨鱼饼三种原料套成圆卷后制成。“黄金卷”金黄的面饼色泽鲜亮，香味诱人，采用五谷杂粮面，精制而成的黄色面饼口感香浓，营养丰富



*/
import { lampshadedBeefScriptsList } from './templateFoodScriptContent/lampshadedBeef';
export const foodsStr = '';
export const wenzhouFoodsList = [
  // 灯影牛肉
  {
    province: '浙江省', // 省
    city: '温州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
  // 尖椒肥肠
  {
    province: '浙江省', // 省
    city: '温州市', // 市
    district: '', // 区
    address: '', // 地方名称
    foodAvatar: '', // 美食图片
    foodName: '灯影牛肉', // 美食名称
    foodName_en: '', // 美食英文名称
    foodCategoryCode: 'beef', // 食材类别编码
    foodCategoryName: '牛肉', // 食材类别名称
    cuisineCategoryCode: 'zhejiangCuisine', // 菜系编码
    cuisineCategoryName: '浙江菜', // 所属菜系
    tasteCode: 'spicy', // 口味编码
    tasteName: '麻辣', // 口味名称
    menuCategoryCode: '', // 菜品分类编码
    menuCategoryName: '', // 菜品分类名称，比如：早餐，米，面，饼，菜肴，酱，酒，醋等
    cookingTypeCode: 'multiple', // 烹饪类型编码
    cookingTypeName: '腌、晾、烘、蒸、炸、炒', // 烹饪类型名称
    featuresName: '薄如纸，色红亮，味麻辣鲜脆', // 特色、特点
    // 美食详情
    detail: {
      introduction: '', // 简介
      storyBackground: '', // 故事背景
      ingredients: '', // 原料
      // 制作过程
      productionProcess: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 营养价值
      nutritionalValue: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 食用功效
      edibleEffects: [
        {
          stepDesc: '', // 步骤描述
        },
      ],
      // 做法
      practiceList: [
        {
          way: '1', // 步骤名称
          practiceDesc: '1', // 做法详情介绍
        },
      ],
    },
    shootingStatus: 0, // 拍摄状态
    scripts: lampshadedBeefScriptsList,
    remark: '', // 备注
    tags: null, // 标签
    isCookFlag: 0, // 是否已完成烹饪标记，0是否，1是完成
  },
];
